[
  {
    "company_name": "Apple",
    "description": "Apple Inc. is an American hardware and software developer and technology company that develops and sells computers, smartphones and consumer electronics as well as operating systems and application software. Apple also operates internet sales portals for music, films and software.",
    "country_name": " USA"
  },
  {
    "company_name": "Microsoft",
    "description": "\nMicrosoft is an American company that develops and distributes software and services such as: a search engine (Bing), cloud solutions and the computer operating system Windows. ",
    "country_name": " USA"
  },
  {
    "company_name": "NVIDIA",
    "description": "Nvidia Corporation is one of the largest developers of graphics processors and chipsets for personal computers and game consoles. The head office is in Santa Clara, California. NVIDIA Corporation does not have its own manufacturing facilities and therefore works according to the fabless principle.",
    "country_name": " USA"
  },
  {
    "company_name": "Alphabet (Google)",
    "description": "Alphabet Inc. is a listed US holding company of the former Google LLC, which continues to exist as a subsidiary. The headquarters is Mountain View in Silicon Valley. The company is led by Sundar Pichai as CEO.",
    "country_name": " USA"
  },
  {
    "company_name": "Amazon",
    "description": "Amazon.com, Inc. is an American online retailer with a wide range of products. According to its own information, Amazon, as the market leader in Internet trade, has the world's largest selection of books, CDs and videos. Via the integrated sales platform Marketplace, private individuals or other companies can also offer new and used products as part of online trading. The Amazon Kindle is sold under its own brand as a reader for electronic books, the Amazon Fire HD tablet computer, the Fire TV set-top box, the Fire TV Stick HDMI stick and the Echo speech recognition system.",
    "country_name": " USA"
  },
  {
    "company_name": "Saudi Aramco",
    "description": "\nSaudi Aramco is the Saudi Arabian national petroleum and natural gas company. As of 2020 it is the largest oil producing company in the world and has the world's second-largest proven crude oil reserves. ",
    "country_name": " Saudi Arabia"
  },
  {
    "company_name": "Meta Platforms (Facebook)",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Berkshire Hathaway ",
    "description": "Berkshire Hathaway Inc. is an American holding company, whose conglomerate includes over 80 companies with activities spanning a wide range of business areas, including insurance and reinsurance, rail freight, energy supply, financial services, manufacturing, and wholesale and retail. The chairman is the major US investor and multi-billionaire Warren Buffett.",
    "country_name": " USA"
  },
  {
    "company_name": "TSMC",
    "description": "Taiwan Semiconductor Manufacturing Company, Limited is the world's third largest semiconductor manufacturer after Intel and Samsung and the world's largest independent contract manufacturer of semiconductor products. The company was founded in 1987. The headquarters and the main parts of the company are located in Hsinchu, Taiwan.",
    "country_name": " Taiwan"
  },
  {
    "company_name": "Eli Lilly",
    "description": "With over 33,000 employees worldwide, production plants in 13 countries and annual sales of over $22 billion worldwide, Eli Lilly and Company is one of the largest pharmaceutical companies in the world. It was founded in Indianapolis in 1876 by the pharmacologist, officer and entrepreneur Eli Lilly.",
    "country_name": " USA"
  },
  {
    "company_name": "Tesla",
    "description": "Tesla, Inc. is an American company that manufactures and sells electric cars, as well as power storage and photovoltaic systems. The company's goal is to “accelerate the transition to sustainable energy”. The company name is based on the physicist and inventor Nikola Tesla.",
    "country_name": " USA"
  },
  {
    "company_name": "Broadcom",
    "description": "Broadcom is a semiconductor company based in San José, California. The company was the semiconductor product division of Hewlett-Packard and later Agilent prior to its spin-off.",
    "country_name": " USA"
  },
  {
    "company_name": "JPMorgan Chase",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Novo Nordisk",
    "description": "Novo Nordisk A / S produces and markets pharmaceutical products and services. Since its founding in Denmark in 1923, the company has developed into a leading company in the diabetes sector worldwide.",
    "country_name": " Denmark"
  },
  {
    "company_name": "Walmart",
    "description": "Walmart Inc. is a global US retail group that dominates a large part of the US market. Walmart is number one in the Fortune Global 500 list of the top-selling companies in the world.",
    "country_name": " USA"
  },
  {
    "company_name": "UnitedHealth",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Exxon Mobil",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Visa",
    "description": "Visa Inc. is a stock corporation and, alongside Mastercard, one of the two major payment card companies and employed around 14,200 people in 2016. The VISA brand is a recursive acronym and stands for Visa International Service Association.",
    "country_name": " USA"
  },
  {
    "company_name": "Tencent",
    "description": "\nTencent Holdings Ltd. is a Chinese tech company that provides messaging services, social networks on the Internet, online media, Internet value-added services, multiplayer online games (MMO, MMORPG), e-commerce and online advertising.The company is behind WeChat and QQ. ",
    "country_name": " China"
  },
  {
    "company_name": "Mastercard",
    "description": "Mastercard Incorporated, based in Purchase near New York, is a listed payment service provider and employed around 18,600 people in 2019. Alongside VISA, Mastercard is one of the two major international companies for payment cards (credit cards, debit cards and prepaid cards).",
    "country_name": " USA"
  },
  {
    "company_name": "Procter & Gamble",
    "description": "The Procter & Gamble Company is an American consumer goods group with headquarters in Cincinnati, Ohio, which is represented in 70 countries.",
    "country_name": " USA"
  },
  {
    "company_name": "Johnson & Johnson",
    "description": "Johnson & Johnson is a global American pharmaceutical and consumer goods company with headquarters in New Brunswick, New Jersey. The company is listed in the Dow Jones Industrial Average.",
    "country_name": " USA"
  },
  {
    "company_name": "Samsung",
    "description": "\nThe Samsung Group is a South Korean conglomerate behind Samsung Electronics, the world's largest manufacturer of DRAM, NAND flash memory, SSD, television, refrigerator, cell phones and smartphones. ",
    "country_name": " South Korea"
  },
  {
    "company_name": "Oracle",
    "description": "Oracle Corporation is an American software and hardware manufacturer with its headquarters in Redwood City (Silicon Valley), California. The company specializes in the development and marketing of computer hardware and software for corporate customers - especially the Oracle Database system. Oracle is one of the world's largest software manufacturers in terms of sales. Oracle employs more than 138,000 people and has 430,000 customers in 175 countries. In addition to the database product Oracle Database, Oracle produces and sells the Oracle Fusion middleware as well as the JEE servers Oracle Application Server and Oracle WebLogic.",
    "country_name": " USA"
  },
  {
    "company_name": "Costco",
    "description": "Costco Wholesale Corporation is an American wholesale chain with headquarters in Issaquah near Seattle, Washington State.",
    "country_name": " USA"
  },
  {
    "company_name": "ASML",
    "description": "No description available",
    "country_name": " Netherlands"
  },
  {
    "company_name": "Home Depot",
    "description": "The Home Depot, Inc is an American home improvement chain based in Atlanta. It operates 2,284 DIY stores (as of April 2018) in North America (USA, Canada, Mexico, Puerto Rico) and claims to be the largest DIY store chain in the world. The company has over 400,000 employees.",
    "country_name": " USA"
  },
  {
    "company_name": "LVMH",
    "description": "No description available",
    "country_name": " France"
  },
  {
    "company_name": "AbbVie",
    "description": "The biotechnology and pharmaceutical company Abbvie, spelled AbbVie, was founded in 2013 as a spin-off from Abbott Laboratories and is traded on the NYSE stock exchange in the S&P 100 index under the symbol “ABBV”.",
    "country_name": " USA"
  },
  {
    "company_name": "Bank of America ",
    "description": "Bank of America Corporation is a major US bank headquartered in Charlotte, North Carolina. The company was at times the largest credit institution in the United States.",
    "country_name": " USA"
  },
  {
    "company_name": "Coca-Cola",
    "description": "The Coca-Cola Company is an American beverage company specializing in soft drinks and based in Atlanta, Georgia in the United States. CEO is James Quincey. The Coca-Cola Company describes itself as the largest beverage company worldwide.\n",
    "country_name": " USA"
  },
  {
    "company_name": "Merck",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Chevron",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Netflix",
    "description": "Netflix, Inc. is an American media company engaged in paid streaming and the production of films and series.",
    "country_name": " USA"
  },
  {
    "company_name": "ICBC",
    "description": "The Industrial and Commercial Bank of China Limited is the largest bank in the People's Republic of China and the world in terms of total assets. With sales of $176 billion, it ranked #1 in Forbes Global 2000 of the 2,000 largest listed companies in the world in 2019.",
    "country_name": " China"
  },
  {
    "company_name": "Nestlé",
    "description": "\nNestlé S.A. is the world's largest food company and the largest industrial company in Switzerland. The head office is in Vevey, The company's portfolio includes over 2000 food and beverage brands such as: Nestea, Nespresso, Buitoni, Nesquik, Perrier, Chocapic and Crunch. ",
    "country_name": " Switzerland"
  },
  {
    "company_name": "Roche",
    "description": "No description available",
    "country_name": " Switzerland"
  },
  {
    "company_name": "AstraZeneca",
    "description": "No description available",
    "country_name": " UK"
  },
  {
    "company_name": "International Holding Company",
    "description": "No description available",
    "country_name": " United Arab Emirates"
  },
  {
    "company_name": "Salesforce",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Toyota",
    "description": "Toyota Motor Corporation is a multinational company and one of the largest automobile manufacturers in the world. In 2016, the company manufactured approximately 10.2 million vehicles, making it the world's largest automaker in terms of production figures, ahead of Volkswagen AG.",
    "country_name": " Japan"
  },
  {
    "company_name": "Reliance Industries",
    "description": "No description available",
    "country_name": " India"
  },
  {
    "company_name": "Adobe",
    "description": "Adobe Inc. is an American software company registered in the state of Delaware. It was founded in 1982 by John Warnock and Charles Geschke, the inventors of the PostScript page description language.",
    "country_name": " USA"
  },
  {
    "company_name": "SAP",
    "description": "SAP SE, is a German software company based in Walldorf (Baden-Württemberg). SAP is the largest European and the third largest listed software company in terms of sales.",
    "country_name": " Germany"
  },
  {
    "company_name": "Kweichow Moutai",
    "description": "Kweichow Moutai produces and sells high-end Chinese liquors. The Moutai liquor is very popular in China.",
    "country_name": " China"
  },
  {
    "company_name": "Pepsico",
    "description": "PepsiCo, Inc. is an American beverage and food company headquartered in Purchase, New York. PepsiCo is currently the Coca-Cola Company's biggest competitor.",
    "country_name": " USA"
  },
  {
    "company_name": "Thermo Fisher Scientific",
    "description": "Thermo Fisher Scientific Inc., also known as Thermo Fisher, is an American technology company based in Waltham, Massachusetts. It describes itself as \"the world's largest supplier of scientific applications.\"",
    "country_name": " USA"
  },
  {
    "company_name": "Shell",
    "description": "The Royal Dutch Shell is one of the world's largest mineral oil and natural gas companies. The group is active in more than 140 countries. Shell employs around 83,000 people worldwide.",
    "country_name": " UK"
  },
  {
    "company_name": "Novartis",
    "description": "Novartis AG is a biotechnology and pharmaceutical company based in Basel, Switzerland. Novartis was formed in 1996 from a merger of the two Basel pharmaceutical and chemical companies Ciba-Geigy AG and Sandoz AG. Novartis is one of the largest pharmaceutical companies in the world with sales of USD 47.4 billion in 2019.",
    "country_name": " Switzerland"
  },
  {
    "company_name": "Hermès",
    "description": "No description available",
    "country_name": " France"
  },
  {
    "company_name": "L'Oréal",
    "description": "\nL’Oréal S.A. is a French consumer goods group with headquarters in Paris and currently the largest cosmetics manufacturer in the world. The company owns brands such as L’Oréal Paris, Garnier, Maybelline Jade, Essie, Softsheen Carson and NYX Cosmetics. ",
    "country_name": " France"
  },
  {
    "company_name": "Agricultural Bank of China",
    "description": "No description available",
    "country_name": " China"
  },
  {
    "company_name": "T-Mobile US",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Linde",
    "description": "Linde (The Linde Group) is a listed, globally active industrial group headquartered in Dublin and with operational headquarters in Guildford, UK. Linde's core business are process plants that extract or produce gases. Linde is the global market leader in industrial gases ahead of its French competitor Air Liquide.",
    "country_name": " UK"
  },
  {
    "company_name": "PetroChina",
    "description": "PetroChina Company Limited is the largest Chinese oil company with a network of over 18,000 filling stations, making it one of the largest listed companies in the world.",
    "country_name": " China"
  },
  {
    "company_name": "AMD",
    "description": "Advanced Micro Devices (AMD) is an American chip developer headquartered in Santa Clara, California. AMD develops and produces microprocessors, chipsets, graphics chips and system-on-chip (SoC) solutions for the computer, communication and consumer industries. AMD has been fabless since the actual semiconductor production was spun off in Globalfoundries in 2009. The company has been listed in the Standard & Poor's 500 stock index since March 20, 2017, has around 9,700 employees worldwide and is the world's second largest x86 processor manufacturer after Intel (as of 2011). The company's shares were traded on the New York Stock Exchange from 1979 to 2014, and have been listed on NASDAQ since January 2, 2015.",
    "country_name": " USA"
  },
  {
    "company_name": "China Mobile",
    "description": "China Mobile Ltd. is the world's largest mobile operator by customer base and is listed on the Hong Kong Stock Exchange. The company was entered in the Hong Kong Commercial Register under the name China Telecom in 1997 and changed it to China Mobile in 2000.",
    "country_name": " China"
  },
  {
    "company_name": "Accenture",
    "description": "\nAccenture plc is a major Irish-American professional services company with headquarters in Dublin.\nAccenture provides consulting services and solutions for a large variety of industries such as: Health, Aerospace, Energy, Retail, Automobile and Banking. ",
    "country_name": " Ireland"
  },
  {
    "company_name": "Danaher",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Fomento Económico Mexicano",
    "description": "No description available",
    "country_name": " Mexico"
  },
  {
    "company_name": "McDonald",
    "description": "McDonald’s Corporation is an American operator and franchisor of fast food restaurants represented worldwide and the biggest fast food company in the world.",
    "country_name": " USA"
  },
  {
    "company_name": "Wells Fargo",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Abbott Laboratories",
    "description": "Abbott Laboratories (ABT), (founding name: Abbott Alkaloid Company) is a global pharmaceutical company with around 73,000 employees in 150 countries. Abbott was founded in 1888 by Wallace C. Abbott (1857-1921) and is headquartered in Abbott Park, a northern suburb of Chicago, Illinois.",
    "country_name": " USA"
  },
  {
    "company_name": "Cisco",
    "description": "Cisco Systems, Inc. is an American company in the telecommunications industry. It is primarily known for its routers and switches, which are used by a substantial part of the Internet backbones.\nCisco was founded in December 1984 by a group of scientists (primarily Leonard Bosack and Sandy Lerner) from Stanford University near San Francisco.",
    "country_name": " USA"
  },
  {
    "company_name": "Alibaba",
    "description": "The company had 4,400 permanent employees in 2007, and the number of employees rose to around 66,500 by 2018. At the company u. a. Yahoo and Softbank involved. Sales on Alibaba Group's Chinese retail platforms totaled over 4.8 trillion yuan ($677 billion) in 2017.",
    "country_name": " China"
  },
  {
    "company_name": "Tata Consultancy Services",
    "description": "No description available",
    "country_name": " India"
  },
  {
    "company_name": "General Electric",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "QUALCOMM",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Philip Morris",
    "description": "Philip Morris International Inc. is the world's largest private tobacco company. The group sells cigarettes in more than 180 countries and has a 15.5 percent share of the global tobacco market.",
    "country_name": " USA"
  },
  {
    "company_name": "Amgen",
    "description": "The biotechnology company Amgen was founded in 1980 as AMGen. With approximately 20,000 employees, Amgen is one of the world's largest biotechnology companies with annual sales of approximately $ 24 billion in 2018.",
    "country_name": " USA"
  },
  {
    "company_name": "China Construction Bank",
    "description": "No description available",
    "country_name": " China"
  },
  {
    "company_name": "Intuit",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Pinduoduo",
    "description": "No description available",
    "country_name": " China"
  },
  {
    "company_name": "American Express",
    "description": "The American Express Company, often abbreviated Amex, AmEx, AX or Amexco, is a global provider of financial services based in New York City, USA. The company is best known for its charge card, credit card, and traveler's cheque businesses.",
    "country_name": " USA"
  },
  {
    "company_name": "Texas Instruments",
    "description": "Texas Instruments Incorporated, often referred to as TI, is one of the largest US technology companies. TI designs and manufactures semiconductors and various integrated circuits, which it sells to electronics designers and manufacturers globally.",
    "country_name": " USA"
  },
  {
    "company_name": "IBM",
    "description": "The International Business Machines Corporation is an American IT and consulting company based in Armonk, New York. IBM is one of the world's leading companies for hardware, software and services in the IT sector and one of the largest consulting companies.",
    "country_name": " USA"
  },
  {
    "company_name": "Bank of China",
    "description": "No description available",
    "country_name": " China"
  },
  {
    "company_name": "Pfizer",
    "description": "Pfizer Inc., is a global pharmaceutical company headquartered in New York City, New York, United States. It was founded by Charles Pfizer from Ludwigsburg. Pfizer is the second largest pharmaceutical company in the world after Roche, followed by Novartis.",
    "country_name": " USA"
  },
  {
    "company_name": "Verizon",
    "description": "Verizon Communications Inc., or Verizon for short, is an American telecommunications company headquartered in New York City.",
    "country_name": " USA"
  },
  {
    "company_name": "Walt Disney",
    "description": "The Walt Disney Company, commonly known as Disney, is an American media company. Disney became internationally known for the production of animated films and entertainment films for children and young people.",
    "country_name": " USA"
  },
  {
    "company_name": "HSBC",
    "description": "No description available",
    "country_name": " UK"
  },
  {
    "company_name": "ServiceNow",
    "description": "\nServiceNow, Inc. is an American software company that develops a cloud computing platform to help companies manage digital workflows for enterprise operations. ",
    "country_name": " USA"
  },
  {
    "company_name": "Morgan Stanley",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Applied Materials",
    "description": "Applied Materials, Inc. is one of the world's largest semiconductor companies.\nThe company supplies equipment, services and software for the manufacture of semiconductor chips for electronics, flat panel displays for computers, smartphones, televisions, and solar products.\n",
    "country_name": " USA"
  },
  {
    "company_name": "Caterpillar",
    "description": "Caterpillar Inc. is the world's largest construction equipment manufacturer with headquarters in Peoria, Illinois. In addition to construction machinery, Caterpillar also manufactures diesel engines, gas engines and industrial gas turbines.",
    "country_name": " USA"
  },
  {
    "company_name": "Goldman Sachs",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Nextera Energy",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Intuitive Surgical",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Royal Bank Of Canada",
    "description": "The Royal Bank of Canada is Canada's largest bank. The bank has over 1,300 branches in Canada and approximately 80,000 employees in 55 countries.",
    "country_name": " Canada"
  },
  {
    "company_name": "Comcast",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "TotalEnergies",
    "description": "No description available",
    "country_name": " France"
  },
  {
    "company_name": "Raytheon Technologies",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "HDFC Bank",
    "description": "No description available",
    "country_name": " India"
  },
  {
    "company_name": "Unilever",
    "description": "\nUnilever is a Dutch-British company that is one of the largest manufacturers of consumer goods worldwide. The main business areas include the production of food, cosmetics, personal care as well as household and textile care products. ",
    "country_name": " UK"
  },
  {
    "company_name": "S&P Global",
    "description": "No description available",
    "country_name": " USA"
  },
  {
    "company_name": "Inditex",
    "description": "\nInditex is one of the worlds biggest textile company, Inditex owns several brands including: Zara, Massimo Dutti, Bershka and Pull & Bea ",
    "country_name": " Spain"
  },
  {
    "company_name": "Prosus",
    "description": "No description available",
    "country_name": " Netherlands"
  },
  {
    "company_name": "Union Pacific Corporation",
    "description": "Union Pacific Corporation is an American company based in Omaha, Nebraska. The company is part of the Dow Jones Composite Average and Dow Jones Transportation Average indices. It is the parent company of the Union Pacific Railroad and had a network of 51,610km (32,068 miles) in 2016.",
    "country_name": " USA"
  },
  {
    "company_name": "Commonwealth Bank",
    "description": "The Commonwealth Bank of Australia Ltd. (abbreviated CBA or CommBank) is an Australian financial services company based in Sydney. It is the largest bank in Australia and the 45th largest bank in the world in terms of assets under management.",
    "country_name": " Australia"
  },
  {
    "company_name": "AT&T",
    "description": "AT&T Inc. is a North American telecommunications company. In addition to telephone, data and video telecommunications, AT&T also provides mobile communications and internet services for companies, private customers and government organizations. AT&T has long had a monopoly in the United States and Canada.",
    "country_name": " USA"
  }
]
