[
    {
        "name": "Calcite Might",
        "type": "Ascension 1",
        "desc": "Transient Blossoms generated by Abiogenesis: Solar Isotoma deal 25% more DMG to enemies whose HP is below 50%."
    },
    {
        "name": "Homuncular Nature",
        "type": "Ascension 4",
        "desc": "Using Rite of Progeniture: Tectonic Tide increases the Elemental Mastery of nearby party members by 125 for 10s."
    },
    {
        "name": "Flash of Genius (Albedo)",
        "type": "Passive",
        "desc": "When Albedo crafts Weapon Ascension Materials, he has a 10% chance to receive double the product."
    },
    {
        "name": "Four-Causal Correction",
        "type": "Ascension 1",
        "desc": "When Alhaitham's Charged or Plunging Attacks hit opponents, they will generate 1 Chisel-Light Mirror. This effect can be triggered once every 12s."
    },
    {
        "name": "Mysteries Laid Bare",
        "type": "Ascension 4",
        "desc": "Each point of Alhaitham's Elemental Mastery will increase the DMG dealt by Projection Attacks and Particular Field: Fetters of Phenomena by 0.1%. The maximum DMG increase this way for both these abilities is 100%."
    },
    {
        "name": "Law of Reductive Overdetermination",
        "type": "Passive",
        "desc": "When Alhaitham crafts Weapon Ascension Materials, he has a 10% chance to receive double the product."
    },
    {
        "name": "Agony Alone May Be Repaid",
        "type": "Ascension 1",
        "desc": "Blood-Debt Directives have the following characteristics: Arlecchino will be granted a Bond of Life worth 130% of her Max HP when an opponent to which she herself applied a Directive is defeated. 5s after a Directive is applied, it will be upgraded to a Blood-Debt Due. When absorbed, it will instead grant Arlecchino a Bond of Life worth 130%. A Bond of Life created in the aforementioned ways cannot exceed the original limit on the value of Bonds of Life obtained through All Is Ash."
    },
    {
        "name": "Strength Alone Can Defend",
        "type": "Ascension 4",
        "desc": "Arlecchino gains 1% All Elemental and Physical RES for every 100 ATK she has in excess of 1,000. The maximum RES increase she can gain this way for each is 20%."
    },
    {
        "name": "The Balemoon Alone May Know",
        "type": "Passive",
        "desc": "While in combat, Arlecchino gains a 40% Pyro DMG Bonus and can only be healed through Balemoon Rising."
    },
    {
        "name": "Amatsumi Kunitsumi Sanctification",
        "type": "Ascension 1",
        "desc": "After using Kamisato Art: Hyouka, Kamisato Ayaka's Normal and Charged attacks deal 30% increased DMG for 6s."
    },
    {
        "name": "Kanten Senmyou Blessing",
        "type": "Ascension 4",
        "desc": "When the Cryo application at the end of Kamisato Art: Senho hits an opponent, Kamisato Ayaka gains the following effects: Restores 10 Stamina Gains 18% Cryo DMG Bonus for 10s."
    },
    {
        "name": "Fruits of Shinsa",
        "type": "Passive",
        "desc": "When Ayaka crafts Weapon Ascension Materials, she has a 10% chance to receive double the product."
    },
    {
        "name": "Kamisato Art: Michiyuku Hagetsu",
        "type": "Ascension 1",
        "desc": "If Ayato is not on the field and his Energy is low, he will regenerate a set amount of Energy at regular intervals."
    },
    {
        "name": "Kamisato Art: Mine Wo Matoishi Kiyotaki",
        "type": "Ascension 4",
        "desc": "When Ayato uses his Elemental Skill and when the watery illusion explodes, he will gain a set amount of Namisen stacks."
    },
    {
        "name": "Kamisato Art: Daily Cooking",
        "type": "Passive",
        "desc": "When Kamisato Ayato cooks a dish perfectly, he has a set chance to receive an additional Suspicious dish of the same type."
    },
    {
        "name": "Five Fortunes Forever",
        "type": "Ascension 1",
        "desc": "Baizhu gains different effects according to the current HP of your current active character: When their HP is less than 50%, Baizhu gains 20% Healing Bonus. When their HP is equal to or more than 50%, Baizhu gains 25% Dendro DMG Bonus."
    },
    {
        "name": "All Things Are of the Earth",
        "type": "Ascension 4",
        "desc": "Characters who are healed by Seamless Shields will gain the Year of Verdant Favor effect: Each 1,000 Max HP that Baizhu possesses that does not exceed 50,000 will increase the Burning, Bloom, Hyperbloom, and Burgeon reaction DMG dealt by these characters by 2%, while the Aggravate and Spread reaction DMG dealt by these characters will be increased by 0.8%. This effect lasts 6s."
    },
    {
        "name": "Herbal Nourishment",
        "type": "Passive",
        "desc": "When Baizhu is in the party, interacting with certain harvestable items will heal your current active character for 2.5% of Baizhu's Max HP."
    },
    {
        "name": "Never Ending",
        "type": "Ascension 1",
        "desc": "Extends Riptide duration by 8s."
    },
    {
        "name": "Sword of Torrents",
        "type": "Ascension 4",
        "desc": "When Tartaglia is in Foul Legacy: Raging Tide's Melee Stance, or if his Normal and Charged Attacks do CRIT DMG, they will apply the Riptide status effect on the hit enemy."
    },
    {
        "name": "Master of Weaponry",
        "type": "Passive",
        "desc": "Increases your own party member's Normal Attack Level by 1."
    },
    {
        "name": "Tailor-Made",
        "type": "Ascension 1",
        "desc": "Gain different effects depending on the next action you take within a short duration after using Fluttering Hasode's upward sweep. If you (Press/Tap) the Elemental Skill, you will trigger the Tapestry effect. If you (Press/Tap) your Normal Attack, the Tailoring effect will be triggered instead. Tapestry Switches to the next character in your roster. Grants all your party members \"Seize the Moment\": When your active party member's Normal Attacks, Charged Attacks, and Plunging Attacks hit a nearby opponent, \"Tamoto\" will execute a coordinated attack, dealing 100% of Fluttering Hasode's upward sweep DMG as AoE Geo DMG at the opponent's location. DMG dealt this way is considered Elemental Skill DMG. \"Seize the Moment\" lasts 8s, and 1 of \"Tamoto\"'s coordinated attack can be unleashed every 2s. 2 such coordinated attacks can occur per \"Seize the Moment\" effect duration. Tailoring Chiori gains Geo infusion for 5s. When on the field, if Chiori does not either (Press/Tap) her Elemental Skill or use a Normal Attack within a short time after using Fluttering Hasode's upward sweep, the Tailoring effect will be triggered by default."
    },
    {
        "name": "The Finishing Touch",
        "type": "Ascension 4",
        "desc": "When a nearby party member creates a Geo Construct, Chiori will gain 20% Geo DMG Bonus for 20s."
    },
    {
        "name": "Brocaded Collar's Beauteous Silhouette",
        "type": "Passive",
        "desc": "When any party member is wearing an outfit apart from their default outfit, or is wearing a wind glider other than the Wings of First Flight, your party members will obtain the Swift Stride effect: Movement SPD is increased by 10%. This effect does not take effect in Domains, Trounce Domains and the Spiral Abyss. Swift Stride does not stack."
    },
    {
        "name": "Dark-Shattering Flame",
        "type": "Ascension 1",
        "desc": "After a nearby party member triggers an Electro-related reaction against an opponent, Electro DMG dealt by Clorinde's Normal Attacks and Last Lightfall will be increased by 20% of Clorinde's ATK for 15s. Max 3 stacks. Each stack is counted independently. The Maximum DMG increase achievable this way for the above attacks is 1,800."
    },
    {
        "name": "Lawful Remuneration",
        "type": "Ascension 4",
        "desc": "If Clorinde's Bond of Life is equal to or greater than 100% of her Max HP, her CRIT Rate will increase by 10% for 15s whenever her Bond of Life value increases or decreases. Max 2 stacks. Each stack is counted independently. Additionally, Hunter's Vigil's Night Vigil state is buffed: While it is active, the percent of healing converted to Bond of Life increases to 100%."
    },
    {
        "name": "Night Vigil's Harvest",
        "type": "Passive",
        "desc": "Displays the location of nearby resources unique to Fontaine on the mini-map."
    },
    {
        "name": "Featherfall Judgment",
        "type": "Ascension 1",
        "desc": "When Cyno is in the Pactsworn Pathclearer state activated by Sacred Rite: Wolf's Swiftness, Cyno will enter the Endseer stance at intervals. If he activates Secret Rite: Chasmic Soulfarer while affected by this stance, he will activate the Judication effect, increasing the DMG of this Secret Rite: Chasmic Soulfarer by 35%, and firing off 3 Duststalker Bolts that deal 100% of Cyno's ATK as Electro DMG. Duststalker Bolt DMG is considered Elemental Skill DMG."
    },
    {
        "name": "Authority Over the Nine Bows",
        "type": "Ascension 4",
        "desc": "Cyno's DMG values will be increased based on his Elemental Mastery as follows: Pactsworn Pathclearer's Normal Attack DMG is increased by 125% of his Elemental Mastery. Duststalker Bolt DMG from his Passive Talent Featherfall Judgment is increased by 250% of his Elemental Mastery."
    },
    {
        "name": "The Gift of Silence",
        "type": "Passive",
        "desc": "Gains 25% more rewards when dispatched on a Sumeru Expedition for 20 hours."
    },
    {
        "name": "Unstinting Succor",
        "type": "Ascension 1",
        "desc": "Within 6 seconds after Dehya retrieves the Fiery Sanctum field through Molten Inferno: Ranging Flame or Leonine Bite, she will take 60% less DMG when receiving DMG from Redmane's Blood. This effect can be triggered once every 2s. Additionally, within 9s after Dehya unleashes Molten Inferno: Indomitable Flame, she will grant all party members the Gold-Forged Form state. This state will further increase a character's resistance to interruption when they are within the Fiery Sanctum field. Gold-Forged Form can be activated once every 18s."
    },
    {
        "name": "Stalwart and True",
        "type": "Ascension 4",
        "desc": "When her HP is less than 40%, Dehya will recover 20% of her Max HP and will restore 6% of her Max HP every 2s for the next 10s. This effect can be triggered once every 20s."
    },
    {
        "name": "The Sunlit Way",
        "type": "Passive",
        "desc": "Increases the Movement SPD of your own party members by 10% during the day (6:00 – 18:00). Does not take effect in Domains, Trounce Domains, or Spiral Abyss. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Relentless",
        "type": "Ascension 1",
        "desc": "Diluc's Charged Attack Stamina Cost is decreased by 50%, and its duration is increased by 3s."
    },
    {
        "name": "Blessing of Phoenix",
        "type": "Ascension 4",
        "desc": "The Pyro Enchantment provided by Dawn lasts for 4s longer. Additionally, Diluc gains 20% Pyro DMG Bonus during the duration of this effect."
    },
    {
        "name": "Tradition of the Dawn Knight",
        "type": "Passive",
        "desc": "Refunds 15% of the ores used when crafting Claymore-type weapons."
    },
    {
        "name": "Roiling Rime",
        "type": "Ascension 1",
        "desc": "If 2 stacks of Grimheart are consumed upon unleashing the Holding Mode of Icetide Vortex, a Shattered Lightfall Sword will be created that will explode immediately, dealing 50% of the basic Physical DMG dealt by a Lightfall Sword created by Glacial Illumination."
    },
    {
        "name": "Wellspring of War-Lust",
        "type": "Ascension 4",
        "desc": "When Glacial Illumination is cast, the CD of Icetide Vortex is reset and Eula gains 1 stack of Grimheart."
    },
    {
        "name": "Aristocratic Introspection",
        "type": "Passive",
        "desc": "When Eula crafts Character Talent Materials, she has a 10% chance to receive double the product."
    },
    {
        "name": "Endless Waltz",
        "type": "Ascension 1",
        "desc": "When the active character in your party receives healing, if the source of the healing is not Furina herself and the healing overflows, then Furina will heal a nearby party member for 2% of their Max HP once every 2s within the next 4s."
    },
    {
        "name": "Unheard Confession",
        "type": "Ascension 4",
        "desc": "Every 1,000 points of Furina's Max HP can buff the different Arkhe-aligned Salon Solitaire in the following ways: Will increase Salon Member DMG dealt by 0.7%, up to a maximum of 28%. Will decrease active character healing interval of the Singer of Many Waters by 0.4%, up to a maximum of 16%."
    },
    {
        "name": "The Sea Is My Stage",
        "type": "Passive",
        "desc": "Xenochromatic Fontemer Aberrant ability CD decreased by 30%."
    },
    {
        "name": "Undivided Heart",
        "type": "Ascension 1",
        "desc": "After firing a Frostflake Arrow, the CRIT Rate of subsequent Frostflake Arrows and their resulting bloom effects is increased by 20% for 5s."
    },
    {
        "name": "Harmony between Heaven and Earth",
        "type": "Ascension 4",
        "desc": "Celestial Shower grants a 20% Cryo DMG Bonus to active party members in the AoE."
    },
    {
        "name": "Preserved for the Hunt",
        "type": "Passive",
        "desc": "Refunds 15% of the ores used when crafting Bow-type weapons."
    },
    {
        "name": "Flutter By",
        "type": "Ascension 1",
        "desc": "When a Paramita Papilio state activated by Guide to Afterlife ends, all allies in the party (excluding Hu Tao herself) will have their CRIT Rate increased by 12% for 8s."
    },
    {
        "name": "Sanguine Rouge",
        "type": "Ascension 4",
        "desc": "When Hu Tao's HP is equal to or less than 50%, her Pyro DMG Bonus is increased by 33%."
    },
    {
        "name": "The More the Merrier",
        "type": "Passive",
        "desc": "When Hu Tao cooks a dish perfectly, she has a 18% chance to receive an additional \"Suspicious\" dish of the same type."
    },
    {
        "name": "Arataki Ichiban",
        "type": "Ascension 1",
        "desc": "When Arataki Itto uses consecutive Arataki Kesagiri, he obtains the following effects: Each slash increases the ATK SPD of the next slash by 10%. Max ATK SPD increase is 30%. Increases his resistance to interruption. These effects will be cleared once he stops performing consecutive slashes."
    },
    {
        "name": "Bloodline of the Crimson Oni",
        "type": "Ascension 4",
        "desc": "Arataki Kesagiri DMG is increased by 35% of Arataki Itto's DEF."
    },
    {
        "name": "Woodchuck Chucked",
        "type": "Passive",
        "desc": "When a party member uses attacks to obtain wood from a tree, they have a 25% chance to obtain an additional log of wood."
    },
    {
        "name": "Wind Companion",
        "type": "Ascension 1",
        "desc": "Hits by Normal Attacks have a 50% chance to regenerate HP equal to 15% of Jean's ATK for all party members."
    },
    {
        "name": "Let the Wind Lead",
        "type": "Ascension 4",
        "desc": "Using Dandelion Breeze will regenerate 20% of its Energy."
    },
    {
        "name": "Guiding Breeze",
        "type": "Passive",
        "desc": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product."
    },
    {
        "name": "Soumon Swordsmanship",
        "type": "Ascension 1",
        "desc": "If Chihayaburu comes into contact with Hydro/Pyro/Cryo/Electro when cast, Chihayaburu will absorb that element and if Plunging Attack: Midare Ranzan is used before the effect expires, it will deal an additional 200% ATK of the absorbed elemental type as DMG. This will be considered Plunging Attack DMG. Elemental Absorption may only occur once per use of Chihayaburu."
    },
    {
        "name": "Poetics of Fuubutsu",
        "type": "Ascension 4",
        "desc": "Upon triggering a Swirl reaction, Kaedehara Kazuha will grant teammates a 0.04% Elemental DMG Bonus to their corresponding Element for every point of Elemental Mastery he has for 8s. Bonuses for different elements obtained through this method can co-exist."
    },
    {
        "name": "Cloud Strider",
        "type": "Passive",
        "desc": "Decreases sprinting Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Thundering Penance",
        "type": "Ascension 1",
        "desc": "Within 5s of recasting Stellar Restoration while a Lightning Stiletto is present, Keqing's Normal and Charged Attacks are converted to Electro DMG."
    },
    {
        "name": "Aristocratic Dignity",
        "type": "Ascension 4",
        "desc": "When casting Starward Sword, Keqing's CRIT Rate is increased by 15%, and her Energy Recharge is increased by 15%. This effect lasts for 8s."
    },
    {
        "name": "Land's Overseer",
        "type": "Passive",
        "desc": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%."
    },
    {
        "name": "Pounding Surprise",
        "type": "Ascension 1",
        "desc": "When Jumpy Dumpty and Normal Attacks deal DMG, Klee has a 50% chance to obtain an Explosive Spark. This Explosive Spark is consumed by the next Charged Attack, which costs no Stamina and deals 50% increased DMG."
    },
    {
        "name": "Sparkling Burst",
        "type": "Ascension 4",
        "desc": "When a Charged Attack results in a CRIT, all party members gain 2 Elemental Energy."
    },
    {
        "name": "All Of My Treasures!",
        "type": "Passive",
        "desc": "Displays the location of nearby resources unique to Mondstadt on the mini-map."
    },
    {
        "name": "Tamanooya's Casket",
        "type": "Ascension 1",
        "desc": "If Sangonomiya Kokomi's own Bake-Kurage are on the field when she uses Nereid's Ascension, the Bake-Kurage's duration will be refreshed."
    },
    {
        "name": "Song of Pearls",
        "type": "Ascension 4",
        "desc": "While donning the Ceremonial Garment created by Nereid's Ascension, the Normal and Charged Attack DMG Bonus Sangonomiya Kokomi gains based on her Max HP will receive a further increase based on 15% of her Healing Bonus."
    },
    {
        "name": "Princess of Watatsumi",
        "type": "Passive",
        "desc": "Decreases swimming Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Perilous Performance",
        "type": "Ascension 1",
        "desc": "If Lyney consumes HP when firing off a Prop Arrow, the Grin-Malkin hat summoned by the arrow will, upon hitting an opponent, restore 3 Energy to Lyney and increase DMG dealt by 80% of his ATK."
    },
    {
        "name": "Conclusive Ovation",
        "type": "Ascension 4",
        "desc": "The DMG Lyney deals to opponents affected by Pyro will receive the following buffs: Increases the DMG dealt by 60%. Each Pyro party member other than Lyney will cause the DMG dealt to increase by an additional 20%. Lyney can deal up to 100% increased DMG to opponents affected by Pyro in this way."
    },
    {
        "name": "Trivial Observations",
        "type": "Passive",
        "desc": "Displays the location of nearby resources unique to Fontaine on the mini-map."
    },
    {
        "name": "Come 'n' Get Me, Hag!",
        "type": "Ascension 1",
        "desc": "After she has used Illusory Torrent for 2s, if there are any enemies nearby, Mona will automatically create a Phantom. A Phantom created in this manner lasts for 2s, and its explosion DMG is equal to 50% of Mirror Reflection of Doom."
    },
    {
        "name": "Waterborne Destiny",
        "type": "Ascension 4",
        "desc": "Increases Mona's Hydro DMG Bonus by a degree equivalent to 20% of her Energy Recharge rate."
    },
    {
        "name": "Principium of Astrology",
        "type": "Passive",
        "desc": "When Mona crafts Weapon Ascension Materials, she has a 25% chance to refund a portion of the crafting materials used."
    },
    {
        "name": "Compassion Illuminated",
        "type": "Ascension 1",
        "desc": "When unleashing Illusory Heart, the Shrine of Maya will gain the following effects: The Elemental Mastery of the active character within the field will be increased by 25% of the Elemental Mastery of the party member with the highest Elemental Mastery. You can gain a maximum of 250 Elemental Mastery in this manner."
    },
    {
        "name": "Awakening Elucidated",
        "type": "Ascension 4",
        "desc": "Each point of Nahida's Elemental Mastery beyond 200 will grant 0.1% Bonus DMG and 0.03% CRIT Rate to Tri-Karma Purification from All Schemes to Know. A maximum of 80% Bonus DMG and 24% CRIT Rate can be granted to Tri-Karma Purification in this manner."
    },
    {
        "name": "On All Things Meditated",
        "type": "Passive",
        "desc": "Nahida can use All Schemes to Know to interact with some harvestable items within a fixed AoE. This skill may even have some other effects..."
    },
    {
        "name": "Undisclosed Distribution Channels",
        "type": "Ascension 1",
        "desc": "For 4s after using Ceremonial Crystalshot, the DMG dealt by Navia's Normal Attacks, Charged Attacks, and Plunging Attacks will be converted into Geo DMG which cannot be overridden by other Elemental infusions, and the DMG dealt by Navia's Normal Attacks, Charged Attacks, and Plunging Attacks will be increased by 40%."
    },
    {
        "name": "Mutual Assistance Network",
        "type": "Ascension 4",
        "desc": "For each Pyro/Electro/Cryo/Hydro party member, Navia gains 20% increased ATK. This effect can stack up to 2 times."
    },
    {
        "name": "Painstaking Transaction",
        "type": "Passive",
        "desc": "Gains 25% more rewards when dispatched on a Fontaine Expedition for 20 hours."
    },
    {
        "name": "Heir to the Ancient Sea's Authority",
        "type": "Ascension 1",
        "desc": "When a party member triggers a Vaporize, Frozen, Electro-Charged, Bloom, Hydro Swirl, or a Hydro Crystallize reaction on opponents, 1 stack of Past Draconic Glories will be granted to Neuvillette for 30s. Max 3 stacks. Past Draconic Glories causes Charged Attack: Equitable Judgment to deal 110%/125%/160% of its original DMG. The stacks of Past Draconic Glories created by each kind of Elemental Reaction exist independently."
    },
    {
        "name": "Discipline of the Supreme Arbitration",
        "type": "Ascension 4",
        "desc": "For each 1% of Neuvillette's current HP greater than 30% of Max HP, he will gain 0.6% Hydro DMG Bonus. A maximum bonus of 30% can be obtained this way."
    },
    {
        "name": "Gather Like the Tide",
        "type": "Passive",
        "desc": "Increases underwater Sprint SPD for your own party members by 15%. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Court of Dancing Petals",
        "type": "Ascension 1",
        "desc": "When all characters in the party are all Dendro or Hydro, and there are at least one Dendro character and one Hydro character: The completion of the third dance step of Nilou's Dance of Haftkarsvar will grant all nearby characters the Golden Chalice's Bounty for 30s. Characters under the effect of Golden Chalice's Bounty will increase the Elemental Mastery of all nearby characters by 100 for 10s whenever they are hit by Dendro attacks. Also, triggering the Bloom reaction will create Bountiful Cores instead of Dendro Cores. Such Cores will burst very quickly after being created, and they have larger AoEs. Bountiful Cores cannot trigger Hyperbloom or Burgeon, and they share an upper numerical limit with Dendro Cores. Bountiful Core DMG is considered DMG dealt by Dendro Cores produced by Bloom. Should the party not meet the conditions for this Passive Talent, any existing Golden Chalice's Bounty effects will be canceled."
    },
    {
        "name": "Dreamy Dance of Aeons",
        "type": "Ascension 4",
        "desc": "Every 1,000 points of Nilou's Max HP above 30,000 will cause the DMG dealt by Bountiful Cores created by characters affected by Golden Chalice's Bounty to increase by 9%. The maximum increase in Bountiful Core DMG that can be achieved this way is 400%."
    },
    {
        "name": "White Jade Lotus",
        "type": "Passive",
        "desc": "When Perfect Cooking is achieved on Food with Adventure-related effects, there is a 12% chance to obtain double the product."
    },
    {
        "name": "Life-Prolonging Methods",
        "type": "Ascension 1",
        "desc": "When a character under the effects of Adeptus Art: Herald of Frost triggers an Elemental Reaction, their Incoming Healing Bonus is increased by 20% for 8s."
    },
    {
        "name": "A Glimpse into Arcanum",
        "type": "Ascension 4",
        "desc": "When Qiqi hits enemies with her Normal and Charged Attacks, she has a 50% chance to apply a Fortune-Preserving Talisman to them for 6s. This effect can only occur once every 30s."
    },
    {
        "name": "Former Life Memories",
        "type": "Passive",
        "desc": "Displays the location of nearby resources unique to Liyue on the mini-map."
    },
    {
        "name": "Wishes Unnumbered",
        "type": "Ascension 1",
        "desc": "When nearby party members gain Elemental Orbs or Particles, Chakra Desiderata gains 2 Resolve stacks. This effect can occur once every 3s."
    },
    {
        "name": "Enlightened One",
        "type": "Ascension 4",
        "desc": "Each 1% above 100% Energy Recharge that the Raiden Shogun possesses grants her: 0.6% greater Energy restoration from Musou Isshin 0.4% Electro DMG Bonus"
    },
    {
        "name": "All-Preserver",
        "type": "Passive",
        "desc": "Mora expended when ascending Swords and Polearms is decreased by 50%."
    },
    {
        "name": "Deific Embrace",
        "type": "Ascension 1",
        "desc": "An active character within the field created by Divine Maiden's Deliverance gains 15% Cryo DMG Bonus."
    },
    {
        "name": "Spirit Communion Seal",
        "type": "Ascension 4",
        "desc": "After Shenhe uses Spring Spirit Summoning, she will grant all nearby party members the following effects: Press: Elemental Skill and Elemental Burst DMG increased by 15% for 10s. Hold: Normal, Charged, and Plunging Attack DMG increased by 15% for 15s."
    },
    {
        "name": "Precise Comings and Goings",
        "type": "Passive",
        "desc": "Gains 25% more rewards when dispatched on a Liyue Expedition for 20 hours."
    },
    {
        "name": "Keen Sight",
        "type": "Ascension 1",
        "desc": "After Tighnari fires a Wreath Arrow, his Elemental Mastery is increased by 50 for 4s."
    },
    {
        "name": "Scholarly Blade",
        "type": "Ascension 4",
        "desc": "For every point of Elemental Mastery Tighnari possesses, his Charged Attack and Fashioner's Tanglevine Shaft DMG are increased by 0.06%. The maximum DMG Bonus obtainable this way is 60%."
    },
    {
        "name": "Encyclopedic Knowledge",
        "type": "Passive",
        "desc": "Displays the location of nearby resources unique to Sumeru on the mini-map."
    },
    {
        "name": "Slitting Wind",
        "type": "Ascension 1",
        "desc": "The last hit of a Normal Attack combo unleashes a wind blade, dealing 60% of ATK as Anemo DMG to all opponents in its path."
    },
    {
        "name": "Second Wind",
        "type": "Ascension 4",
        "desc": "Palm Vortex kills renegerate 2% HP for 5s. This effect can only occur once every 5s."
    },
    {
        "name": "Verdant Overgrowth",
        "type": "Ascension 1",
        "desc": "Lea Lotus Lamp will obtain one level of Overflowing Lotuslight every second it is on the field, increasing the Elemental Mastery of active character(s) within its AoE by 6. Overflowing Lotuslight has a maximum of 10 stacks."
    },
    {
        "name": "Verdant Luxury",
        "type": "Ascension 4",
        "desc": "Every point of Elemental Mastery the Traveler possesses increases the DMG dealt by Razorgrass Blade by 0.15% and the DMG dealt by Surgent Manifestation by 0.1%."
    },
    {
        "name": "Thunderflash",
        "type": "Ascension 1",
        "desc": "When another nearby character in the party obtains an Abundance Amulet created by Lightning Blade, Lightning Blade's CD is decreased by 1.5s."
    },
    {
        "name": "Resounding Roar",
        "type": "Ascension 4",
        "desc": "Increases the Energy Recharge effect granted by Lightning Blade's Abundance Amulet by 10% of the Traveler's Energy Recharge."
    },
    {
        "name": "Shattered Darkrock",
        "type": "Ascension 1",
        "desc": "Reduces Starfell Sword's CD by 2s."
    },
    {
        "name": "Frenzied Rockslide",
        "type": "Ascension 4",
        "desc": "The final hit of a Normal Attack combo triggers a collapse, dealing 60% of ATK as AoE Geo DMG."
    },
    {
        "name": "Spotless Waters",
        "type": "Ascension 1",
        "desc": "After the Dewdrop fired by the Hold Mode of the Aquacrest Saber hits an opponent, a Sourcewater Droplet will be generated near to the Traveler. If the Traveler picks it up, they will restore 7% HP. 1 Droplet can be created this way every second, and each use of Aquacrest Saber can create 4 Droplets at most."
    },
    {
        "name": "Clear Waters",
        "type": "Ascension 4",
        "desc": "If HP has been consumed via Suffusion while using the Hold Mode Aquacrest Saber, the Torrent Surge at the skill's end will deal Bonus DMG equal to 45% of the total HP the Traveler has consumed in this skill use via Suffusion. The maximum DMG Bonus that can be gained this way is 5,000."
    },
    {
        "name": "Embrace of Winds",
        "type": "Ascension 1",
        "desc": "Holding Skyward Sonnet creates an upcurrent that lasts for 20s."
    },
    {
        "name": "Stormeye",
        "type": "Ascension 4",
        "desc": "Regenerates 15 Energy for Venti after the effects of Wind's Grand Ode end. If an Elemental Absorption occurred, this also restores 15 Energy to all characters of that corresponding element."
    },
    {
        "name": "Windrider",
        "type": "Passive",
        "desc": "Decreases all party member's gliding Stamina Consumption by 20%."
    },
    {
        "name": "Jade-Claimed Flower",
        "type": "Ascension 1",
        "desc": "If Hanega: Song of the Wind comes into contact with Hydro/Pyro/Cryo/Electro when it is unleashed, this instance of the Windfavored state will obtain buffs according to the contacted element(s): Hydro: Kuugoryoku Point cap increases by 20. Pyro: ATK increases by 30%. Cryo: CRIT Rate increases by 20%. Electro: When Normal and Charged Attacks hit an opponent, 0.8 Energy will be restored. Energy can be restored this way every 0.2s. You can have up to 2 different kinds of these buffs simultaneously."
    },
    {
        "name": "Gales of Reverie",
        "type": "Ascension 4",
        "desc": "When the Wanderer hits opponents with Kuugo: Fushoudan or Kuugo: Toufukai in his Windfavored state, he has a 16% chance to obtain the Descent effect: The next time the Wanderer accelerates in mid-air while in this instance of the Windfavored state, this effect will be removed, this acceleration instance will not consume any Kuugoryoku Points, and he will fire off 4 wind arrows that deal 35% of his ATK as Anemo DMG each. For each Kuugo: Fushoudan and Kuugo: Toufukai that does not produce this effect, the next attack of those types will have a 12% increased chance of producing it. The calculation of the effect production is done once every 0.1s."
    },
    {
        "name": "Strum the Swirling Winds",
        "type": "Passive",
        "desc": "Mora expended when ascending Bows and Catalysts is decreased by 50%."
    },
    {
        "name": "There Shall Be a Plea for Justice",
        "type": "Ascension 1",
        "desc": "When Wriothesley's HP is less than 60%, he will obtain a Gracious Rebuke. The next Charged Attack of his Normal Attack: Forceful Fists of Frost will be enhanced to become Rebuke: Vaulting Fist. It will not consume Stamina, will deal 50% increased DMG, and after hitting will restore HP for Wriothesley equal to 30% of his Max HP. You can gain a Gracious Rebuke this way once every 5s."
    },
    {
        "name": "There Shall Be a Reckoning for Sin",
        "type": "Ascension 4",
        "desc": "When Wriothesley's current HP increases or decreases, if he is in the Chilling Penalty state conferred by Icefang Rush, Chilling Penalty will gain one stack of Prosecution Edict. Max 5 stacks. Each stack will increase Wriothesley's ATK by 6%."
    },
    {
        "name": "The Duke's Grace",
        "type": "Passive",
        "desc": "When Wriothesley crafts Weapon Ascension Materials, he has a 10% chance to receive double the product."
    },
    {
        "name": "Galefeather Pursuit",
        "type": "Ascension 1",
        "desc": "Each opponent hit by Driftcloud Waves from White Clouds at Dawn will grant all nearby party members 1 stack of Storm Pinion for 20s. Max 4 stacks. These will cause the characters' Plunging Attack CRIT Rate to increase by 4%/6%/8%/10% respectively. Each Storm Pinion created by hitting an opponent has an independent duration."
    },
    {
        "name": "Consider, the Adeptus in Her Realm",
        "type": "Ascension 4",
        "desc": "When the Starwicker created by Stars Gather at Dusk has Adeptal Assistance stacks, nearby active characters' Plunging Attack shockwave DMG will be increased by 200% of Xianyun's ATK. The maximum DMG increase that can be achieved this way is 9,000. Each Plunging Attack shockwave DMG instance can only apply this increased DMG effect to a single opponent. Each character can trigger this effect once every 0.4s."
    },
    {
        "name": "Crane Form",
        "type": "Passive",
        "desc": "Increases gliding SPD for your own party members by 15%. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Conqueror of Evil: Tamer of Demons",
        "type": "Ascension 1",
        "desc": "While under the effects of Bane of All Evil, all DMG dealt by Xiao increases by 5%. DMG increases by a further 5% for every 3s the ability persists. The maximum DMG Bonus is 25%."
    },
    {
        "name": "Dissolution Eon: Heaven Fall",
        "type": "Ascension 4",
        "desc": "Using Lemniscatic Wind Cycling increases the DMG of subsequent uses of Lemniscatic Wind Cycling by 15%. This effect lasts for 7s, and has a maximum of 3 stacks. Gaining a new stack refreshes the effect's duration."
    },
    {
        "name": "Transcension: Gravity Defier",
        "type": "Passive",
        "desc": "Decreases climbing Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Meditations of a Yako",
        "type": "Ascension 1",
        "desc": "When she crafts Character Talent Material she has a set chance to create an extra Talent Material from the same region of a random type. The rarity of this material will be the same materials consumed during crafting."
    },
    {
        "name": "Enlightened Blessing",
        "type": "Ascension 4",
        "desc": "Yae Miko's Elemental Mastery will increase the DMG dealt by the Sesshou Sakura."
    },
    {
        "name": "The Shrine's Sacred Shade",
        "type": "Passive",
        "desc": "When Yae Miko uses her Elemental Burst, each Sesshou Sakura destroyed resets the cooldown for one charge of her Elemental Skill."
    },
    {
        "name": "Turn Control",
        "type": "Ascension 1",
        "desc": "When the party has 1/2/3/4 Elemental Types, Yelan's Max HP is increased by 6%/12%/18%/30%."
    },
    {
        "name": "Adapt With Ease",
        "type": "Ascension 4",
        "desc": "So long as an Exquisite Throw is in play, your own active character deals 1% more DMG. This increases by a further 3.5% DMG every second. The maximum increase to DMG dealt is 50%. The pre-existing effect will be dispelled if Depth-Clarion Dice is recast during its duration."
    },
    {
        "name": "Necessary Calculation",
        "type": "Passive",
        "desc": "Gains 25% more rewards when dispatched on a Liyue Expedition for 20 hours."
    },
    {
        "name": "Tricks of the Trouble-Maker",
        "type": "Ascension 1",
        "desc": "During Niwabi Fire-Dance, shots from Yoimiya's Normal Attack will increase her Pyro DMG Bonus by 2% on hit. This effect lasts for 3s and can have a maximum of 10 stacks."
    },
    {
        "name": "Summer Night's Dawn",
        "type": "Ascension 4",
        "desc": "Using Ryuukin Saxifrage causes nearby party members (not including Yoimiya) to gain a 10% ATK increase for 15s. Additionally, a further ATK Bonus will be added on based on the number of \"Tricks of the Trouble-Maker\" stacks Yoimiya possesses when using Ryuukin Saxifrage. Each stack increases this ATK Bonus by 1%."
    },
    {
        "name": "Blazing Match",
        "type": "Passive",
        "desc": "When Yoimiya crafts Decoration, Ornament, and Landscape-type Furnishings, she has a 100% chance to refund a portion of the materials used."
    },
    {
        "name": "Resonant Waves",
        "type": "Ascension 1",
        "desc": "When the Jade Shield takes DMG, it will Fortify: Fortified characters have 5% increased Shield Strength. Can stack up to 5 times, and lasts until the Jade Shield dissapears."
    },
    {
        "name": "Dominance of Earth",
        "type": "Ascension 4",
        "desc": "Zhongli deals bonus DMG based on his Max HP: Normal Attack, Charged Attack, and Plunging Attack DMG is increased by 1.39% of Max HP. Dominus Lapidis Stone Stele, resonance, and hold DMG is increased by 1.9% of Max HP. Planet Befall deals additional DMG equal to 33% of Zhongli's Max HP."
    },
    {
        "name": "Arcanum of Crystal",
        "type": "Passive",
        "desc": "Refunds 15% of the ores used when crafting Polearm-type weapons."
    },
    {
        "name": "Every Arrow Finds Its Target",
        "type": "Ascension 1",
        "desc": "Increases the CRIT Rate of Fiery Rain by 10% and widens its AoE by 30%."
    },
    {
        "name": "Precise Shot",
        "type": "Ascension 4",
        "desc": "Aimed Shot hits on weak spots increase Base ATK by 15% for 10s."
    },
    {
        "name": "Gliding Champion",
        "type": "Passive",
        "desc": "Decreases all party members' gliding Stamina Consumption by 20%. The greatest effect out of all Talents of the same type prevails."
    },
    {
        "name": "Glorious Season",
        "type": "Ascension 1",
        "desc": "The Stamina Consumption of characters within Let the Show Begin's Melody Loop is reduced by 12%."
    },
    {
        "name": "Encore",
        "type": "Ascension 4",
        "desc": "When a character gains an Elemental Orb/Particle, the duration of Let the Show Begin's Melody Loop is extended by 1s. The maximum extension is 5s."
    },
    {
        "name": "With My Whole Heart",
        "type": "Passive",
        "desc": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product."
    },
    {
        "name": "Retribution",
        "type": "Ascension 1",
        "desc": "Counterattacking with Tidecaller at the precise moment when the character is hit grants the maximum DMG Bonus."
    },
    {
        "name": "Lightning Storm",
        "type": "Ascension 4",
        "desc": "Gain the following effects for 10s after unleashing Tidecaller with its maximum DMG Bonus: DMG dealt by Normal and Charged Attacks is increased by 15%. ATK SPD of Normal and Charged Attacks is increased by 15%. Greatly reduced delay before unleashing Charged Attacks."
    },
    {
        "name": "Conqueror of Tides",
        "type": "Passive",
        "desc": "Decreases all party member's swimming Stamina consumption by 20%."
    },
    {
        "name": "Rekindle",
        "type": "Ascension 1",
        "desc": "Decreases Passion Overload's CD by 20%."
    },
    {
        "name": "Fearnaught",
        "type": "Ascension 4",
        "desc": "When inside the area created by Fantastic Voyage, Passion Overload takes on the following effects: CD is reduced by 50%. Bennett will not be launched by the effects of Charge Level 2."
    },
    {
        "name": "It Should Be Safe...",
        "type": "Passive",
        "desc": "When dispatched on an expedition in Mondstadt, time consumed is reduced by 25%."
    },
    {
        "name": "Aegis of Crossed Arrows",
        "type": "Ascension 1",
        "desc": "If Candace is hit by an attack in the Hold duration of Sacred Rite: Heron's Sanctum, that skill will finish charging instantly."
    },
    {
        "name": "Celestial Dome of Sand",
        "type": "Ascension 4",
        "desc": "Characters affected by the Prayer of the Crimson Crown caused by Sacred Rite: Wagtail's Tide will deal 0.5% increased DMG to opponents for every 1,000 points of Candace's Max HP when they deal Elemental DMG with their Normal Attacks."
    },
    {
        "name": "To Dawn's First Light",
        "type": "Passive",
        "desc": "Decreases climbing Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Moment of Impact",
        "type": "Ascension 1",
        "desc": "When opponents marked by \"Focused Impression\" are defeated, Framing: Freezing Point Composition's CD will be decreased by 2s. This CD decrease can be triggered 4 times every 12s."
    },
    {
        "name": "Diversified Investigation",
        "type": "Ascension 4",
        "desc": "When the party contains 1/2/3 Fontainians other than herself, Charlotte gains a 5%/10%/15% Healing Bonus. When the party contains 1/2/3 non-Fontainians, Charlotte gains a 5%/10%/15% Cryo DMG Bonus."
    },
    {
        "name": "First-Person Shutter",
        "type": "Passive",
        "desc": "After activating the Special Analysis Zoom Lens, Charlotte's \"Framing: Freezing Point Composition\" Hold Mode cannot trigger its original effects, but instead enables her to take photos in a rather unique manner..."
    },
    {
        "name": "Vanguard's Coordinated Tactics",
        "type": "1st Ascension Passive",
        "desc": "When all party members are Pyro and Electro characters and there is at least one Pyro and one Electro character each in the party: Chevreuse grants \"Coordinated Tactics\" to nearby party members: After a character triggers the Overloaded reaction, the Pyro and Electro RES of the opponent(s) affected by this Overloaded reaction will be decreased by 40% for 6s. The \"Coordinated Tactics\" effect will be removed when the Elemental Types of the characters in the party do not meet the basic requirements for the Passive Talent."
    },
    {
        "name": "Vertical Force Coordination",
        "type": "4th Ascension Passive",
        "desc": "After Chevreuse fires an Overcharged Ball using Short-Range Rapid Interdiction Fire, nearby Pyro and Electro characters in the party gain 1% increased ATK for every 1,000 Max HP Chevreuse has for 30s. ATK can be increased by up to 40% in this way."
    },
    {
        "name": "Double Time March",
        "type": "Passive",
        "desc": "Decreases sprinting Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Steady Breathing",
        "type": "Ascension 1",
        "desc": "Sword, Claymore, or Polearm-wielding characters within the field created by Spirit Blade - Chonghua's Layered Frost have their Normal Attack SPD increased by 8%."
    },
    {
        "name": "Rimechaser Blade",
        "type": "Ascension 4",
        "desc": "When the field created by Spirit Blade - Chonghua's Layered Frost disappears, another spirit will be summoned to strike nearby enemies, dealing 100% of Chonghua's Layered Frost's Skill DMG as AoE Cryo DMG. Enemies hit by this blade will have their Cryo RES decreased by 10% for 8s."
    },
    {
        "name": "Gallant Journey",
        "type": "Passive",
        "desc": "When dispatched on an expedition in Liyue, time consumed is reduced by 25%."
    },
    {
        "name": "Floral Sidewinder",
        "type": "Ascension 1",
        "desc": "If one of your party members has triggered Burning, Quicken, Aggravate, Spread, Bloom, Hyperbloom, or Burgeon reactions before the Floral Ring returns, it will grant the character the Sprout effect upon return, which will continuously deal Dendro DMG equivalent to 40% of Collei's ATK to nearby opponents for 3s. If another Sprout effect is triggered during its initial duration, the initial effect will be removed. DMG dealt by Sprout is considered Elemental Skill DMG."
    },
    {
        "name": "The Languid Wood",
        "type": "Ascension 4",
        "desc": "When a character within the Cuilein-Anbar Zone triggers Burning, Quicken, Aggravate, Spread, Bloom, Hyperbloom, or Burgeon reactions, the Zone's duration will be increased by 1s. A single Trump-Card Kitty can be extended by up to 3s."
    },
    {
        "name": "Gliding Champion of Sumeru",
        "type": "Passive",
        "desc": "Decreases gliding Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Cat's Tail Secret Menu",
        "type": "Ascension 1",
        "desc": "Characters shielded by Icy Paws have their Movement SPD increased by 10% and their Stamina Consumption decreased by 10%."
    },
    {
        "name": "Drunkards' Farce",
        "type": "Ascension 4",
        "desc": "Opponents who enter the AoE of Signature Mix have 10% decreased ATK for 15s."
    },
    {
        "name": "Complimentary Bar Food",
        "type": "Passive",
        "desc": "When a Perfect Cooking is achieved on a dish with restorative effects, there is a 12% chance to obtain double the product."
    },
    {
        "name": "An Eye for Gold",
        "type": "Ascension 1",
        "desc": "After a character connected to the Jinni triggers an Electro-Charged, Superconduct, Overloaded, Quicken, Aggravate, Hyperbloom, or an Electro Swirl or Crystallize reaction, the CD of Spirit-Warding Lamp: Troubleshooter Cannon is decreased by 1s. This effect can be triggered once every 3s."
    },
    {
        "name": "Compound Interest",
        "type": "Ascension 4",
        "desc": "When the Troubleshooter Shots or After-Sales Service Rounds from Spirit-Warding Lamp: Troubleshooter Cannon hit opponents, Dori will restore 5 Elemental Energy for every 100% Energy Recharge possessed. Per Spirit-Warding Lamp: Troubleshooter Cannon, only one instance of Energy restoration can be triggered and a maximum of 15 Energy can be restored this way."
    },
    {
        "name": "Unexpected Order",
        "type": "Passive",
        "desc": "When Dori crafts Character and Weapon Enhancement Materials, she has a chance to refund a portion of the crafting materials used."
    },
    {
        "name": "Impetuous Flow",
        "type": "Ascension 1",
        "desc": "When Faruzan is in the Manifest Gale state created by Wind Realm of Nasamjnin, the amount of time taken to charge a shot is decreased by 60%, and she can apply The Wind's Secret Ways' Perfidious Wind's Bale to opponents who are hit by the vortex created by Pressurized Collapse."
    },
    {
        "name": "Lost Wisdom of the Seven Caverns",
        "type": "Ascension 4",
        "desc": "When characters affected by The Wind's Secret Ways' Prayerful Wind's Gift deal Anemo DMG using Normal, Charged, Plunging Attacks, Elemental Skills, or Elemental Bursts to opponents, they will gain the Hurricane Guard effect: This DMG will be increased based on 32% of Faruzan's Base ATK. 1 instance of Hurricane Guard can occur once every 0.8s. This DMG Bonus will be cleared after Prayerful Wind's Benefit expires or after the effect is triggered once."
    },
    {
        "name": "Tomes Light the Path",
        "type": "Passive",
        "desc": "Gains 25% more rewards when dispatched on a Sumeru Expedition for 20 hours."
    },
    {
        "name": "Stellar Predator",
        "type": "Ascension 1",
        "desc": "When Fischl hits Oz with a fully-charged Aimed Shot, Oz brings down Thundering Retribution, dealing AoE Electro DMG equal to 152.7% of the arrow's DMG."
    },
    {
        "name": "Undone Be Thy Sinful Hex",
        "type": "Ascension 4",
        "desc": "If a character triggers an Electro-related Elemental Reaction when Oz is on the field, the enemy shall be stricken with Thundering Retribution, dealing Electro DMG equal to 80% of Fischl's ATK."
    },
    {
        "name": "Mein Hausgarten",
        "type": "Passive",
        "desc": "When dispatched on an expedition in Mondstadt, time consumed is reduced by 25%."
    },
    {
        "name": "Saturation Deep Dive",
        "type": "Ascension 1",
        "desc": "When Freminet unleashes Pressurized Floe: Shattering Pressure, if Pers Timer has yet to reach Pressure Level 4, the CD of Pressurized Floe will be decreased by 1s."
    },
    {
        "name": "Parallel Condensers",
        "type": "Ascension 4",
        "desc": "When Freminet triggers Shatter against opponents, the DMG dealt by Pressurized Floe: Shattering Pressure will be increased by 40% for 5s."
    },
    {
        "name": "Deepwater Navigation",
        "type": "Passive",
        "desc": "Decreases Aquatic Stamina consumption for your own party members by 35%. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Dance of Amity",
        "type": "Ascension 1",
        "desc": "After Bestial Ascent's Plunging Attack: Charmed Cloudstrider hits an opponent, Gaming will regain 1.5% of his Max HP once every 0.2s for 0.8s."
    },
    {
        "name": "Air of Prosperity",
        "type": "Ascension 4",
        "desc": "When Gaming has less than 50% HP, he will receive a 20% Incoming Healing Bonus. When Gaming has 50% HP or more, Plunging Attack: Charmed Cloudstrider will deal 20% more DMG."
    },
    {
        "name": "The Striding Beast",
        "type": "Passive",
        "desc": "Increases the Movement SPD of your own party members by 10% during the day (6:00 – 18:00). Does not take effect in Domains, Trounce Domains, or Spiral Abyss. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Heedless of the Wind and Weather",
        "type": "Ascension 1",
        "desc": "After using Juuga: Forward Unto Victory, all nearby party members' DEF is increased by 25% for 12s."
    },
    {
        "name": "A Favor Repaid",
        "type": "Ascension 4",
        "desc": "Gorou receives the following DMG Bonuses to his attacks based on his DEF: Inuzaka All-Round Defense: Skill DMG increased by 156% of DEF Juuga: Forward Unto Victory: Skill DMG and Crystal Collapse DMG increased by 15.6% of DEF"
    },
    {
        "name": "Seeker of Shinies",
        "type": "Passive",
        "desc": "Displays the location of nearby resources unique to Inazuma on the mini-map."
    },
    {
        "name": "Paradoxical Practice",
        "type": "Ascension 1",
        "desc": "When Shikanoin Heizou activates a Swirl reaction while on the field, he will gain 1 Declension stack for Heartstopper Strike. This effect can be triggered every 0.1s."
    },
    {
        "name": "Penetrative Reasoning",
        "type": "Ascension 4",
        "desc": "After Shikanoin Heizou‘s Heartstopper Strike hits an opponent, increases all party members' (excluding Shikanoin Heizou) Elemental Mastery by 80 for 10s."
    },
    {
        "name": "Pre-Existing Guilt",
        "type": "Passive",
        "desc": "Decreases sprinting Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Cold-Blooded Strike",
        "type": "Ascension 1",
        "desc": "Every hit with Frostgnaw regenerates HP for Kaeya equal to 15% of ATK."
    },
    {
        "name": "Glacial Heart",
        "type": "Ascension 4",
        "desc": "Enemies Frozen by Frostgnaw will drop additional Elemental Particles. Frostgnaw may only produce a maximum of 2 additional Elemental Particles per use."
    },
    {
        "name": "Hidden Strength",
        "type": "Passive",
        "desc": "Decreases all party member's sprinting Stamina consumption by 20%."
    },
    {
        "name": "An Architect's Undertaking",
        "type": "Ascension 1",
        "desc": "When DMG dealt by a Dendro Core (including DMG from Burgeon and Hyperbloom) hits Kaveh, Kaveh will regain HP equal to 300% of his Elemental Mastery. This effect can be triggered once every 0.5s."
    },
    {
        "name": "Bloodline of the Crimson Oni",
        "type": "Ascension 4",
        "desc": "During Painted Dome, after Kaveh's Normal, Charged, or Plunging Attacks hit opponents, his Elemental Mastery will increase by 25. This effect can be triggered once every 0.1s. Max 4 stacks. This effect will be canceled when Painted Dome's effects end."
    },
    {
        "name": "The Art of Budgeting",
        "type": "Passive",
        "desc": "When Kaveh crafts Landscape, Building, and Courtyard-type Furnishings, he has a 100% chance to refund a portion of the materials used."
    },
    {
        "name": "Bewitching, Betwitching Tails",
        "type": "Ascension 1",
        "desc": "When Kirara is in the Urgent Neko Parcel state of Meow-teor Kick, each impact against an opponent will grant her a stack of Reinforced Packaging. This effect can be triggered once for each opponent hit every 0.5s. Max 3 stacks. When the Urgent Neko Parcel state ends, each stack of Reinforced Packaging will create 1 Shield of Safe Transport for Kirara. The shields that are created this way will have 20% of the DMG absorption that the Shield of Safe Transport produced by Meow-teor Kick would have. If Kirara is already protected by a Shield of Safe Transport created by Meow-teor Kick, its DMG absorption will stack with these shields and its duration will reset."
    },
    {
        "name": "Pupillary Variance",
        "type": "Ascension 4",
        "desc": "Every 1,000 Max HP Kirara possesses will increase the DMG dealt by Meow-teor Kick by 0.4%, and the DMG dealt by Secret Art: Surprise Dispatch by 0.3%."
    },
    {
        "name": "Cat's Creeping Carriage",
        "type": "Passive",
        "desc": "When Kirara is in the party, animals who produce Fowl, Raw Meat, or Chilled Meat will not be startled when party members approach them."
    },
    {
        "name": "Breaking Free",
        "type": "Ascension 1",
        "desc": "When Shinobu's HP is not higher than 50%, her Healing Bonus is increased by 15%."
    },
    {
        "name": "Heart's Repose",
        "type": "Ascension 4",
        "desc": "Sanctifying Ring's abilities will be boosted based on Shinobu's Elemental Mastery: Healing amount will be increased by 75% of Elemental Mastery. DMG dealt is increased by 25% of Elemental Mastery."
    },
    {
        "name": "Protracted Prayers",
        "type": "Passive",
        "desc": "Gains 25% more rewards when dispatched on an Inazuma Expedition for 20 hours."
    },
    {
        "name": "Like Nascent Light",
        "type": "Ascension 1",
        "desc": "While the Curtain of Slumber is active, the Deep Sleep effect will activate each time the Curtain gains 1 Night Star: The Shield Strength of a character under the effect of the Curtain of Slumber increases by 6%. This effect can have a maximum of 4 stacks and persists until the Curtain of Slumber disappears."
    },
    {
        "name": "Sweet Slumber Undisturbed",
        "type": "Ascension 4",
        "desc": "The DMG dealt by the Shooting Stars fired by Nights of Formal Focus is increased by 1.5% of Layla's Max HP."
    },
    {
        "name": "Shadowy Dream-Signs",
        "type": "Passive",
        "desc": "When Layla crafts Character Talent Materials, she has a 10% chance to receive double the product."
    },
    {
        "name": "Induced Aftershock",
        "type": "Ascension 1",
        "desc": "Hits by charged Attacks apply Violet Arc's Conductive status to enemies."
    },
    {
        "name": "Static Electricity Field",
        "type": "Ascension 4",
        "desc": "Enemies hit by Lightning Rose have their DEF decreased by 15% for 10s."
    },
    {
        "name": "General Pharmaceutics",
        "type": "Passive",
        "desc": "When Lisa crafts a potion, she has a 20% chance to refund a portion of the crafting materials used."
    },
    {
        "name": "Sophisticated Synergy",
        "type": "Ascension 1",
        "desc": "Within 10s after using Magic Trick: Astonishing Shift, when there are 1/2/3/4 Elemental Types in the party, all party members' ATK will be increased by 8%/12%/16%/20% respectively."
    },
    {
        "name": "Props Positively Prepped",
        "type": "Ascension 4",
        "desc": "After the Bogglecat Box summoned by Magic Trick: Astonishing Shift performs Elemental Coversion, Lynette's Elemental Burst will deal 15% more DMG. This effect will persist until the Bogglecat Box's duration ends."
    },
    {
        "name": "Loci-Based Mnemonics",
        "type": "Passive",
        "desc": "Shows the location of nearby Recovery Orbs on the minimap. The Aquatic Stamina and HP gained from touching Orbs will be increased by 25%."
    },
    {
        "name": "Suppressive Barrage",
        "type": "Ascension 1",
        "desc": "Per the following circumstances, the Soulwind state caused by Starfrost Swirl will grant characters the Detector effect, increasing their Physical DMG by 10% when they are on the field. If the Flowfrost Arrow hits more than one opponent, each additional opponent hit will generate 1 Detector stack. When a Rimestar Shard hits an opponent, it will generate 1 Detector stack. Each Rimestar Shard can trigger the effect 1 time. The Soulwind state can have a maximum of 3 Detector stacks, and if Starfrost Swirl is cast again during this duration, the pre-existing Soulwind state and all its Detector stacks will be cleared."
    },
    {
        "name": "Topographical Mapping",
        "type": "Ascension 4",
        "desc": "When an active character affected by both Skyfeather Song's Eagleplume and Starfrost Swirl's Soulwind at once scores a CRIT Hit with their attacks, Soulwind will grant them 1 stack of Detector from Suppressive Barrage. During a single instance of Soulwind, 1 Detector stack can be gained in this manner. Additionally, the maximum number of stacks that can be gained through Soulwind alone is increased by 1. Requires Suppressive Barrage to be unlocked first."
    },
    {
        "name": "Demarcation",
        "type": "Passive",
        "desc": "Displays the location of nearby resources unique to Mondstadt on the mini-map."
    },
    {
        "name": "Backup Plan",
        "type": "Ascension 1",
        "desc": "When Ningguang is in possession of Star Jades, her Charged Attack does not consume Stamina."
    },
    {
        "name": "Strategic Reserve",
        "type": "Ascension 4",
        "desc": "A character that passes through the Jade Screen will gain a 12% Geo DMG Bonus for 10s."
    },
    {
        "name": "Trove of Marvelous Treasures",
        "type": "Passive",
        "desc": "Displays the location of nearby ore veins (Iron Ore, White Iron Ore, Crystal Ore, and Magical Crystal Ore) on the mini-map."
    },
    {
        "name": "Devotion",
        "type": "Ascension 1",
        "desc": "When Noelle is in the party but not on the field, this ability triggers automatically when the active character's HP falls below 30%: Creates a shield that lasts for 20s and absorbs DMG equal to 400% of Noelle's DEF. This effect can only occur once every 60s."
    },
    {
        "name": "Nice and Clean",
        "type": "Ascension 4",
        "desc": "Every 4 Normal or Charged Attack hits will decrease the CD of Breastplate by 1s. Hitting multiple enemies with a single attack is only counted as 1 hit."
    },
    {
        "name": "Maid's Knighthood",
        "type": "Passive",
        "desc": "When a Perfect Cooking is achieved on a DEF-boosting dish, Noelle has a 12% chance to obtain double the product."
    },
    {
        "name": "Awakening",
        "type": "Ascension 1",
        "desc": "Decreases Claw and Thunder's CD by 18%. Using Lightning Fang resets the CD of Claw and Thunder."
    },
    {
        "name": "Hunger",
        "type": "Ascension 4",
        "desc": "When Razor's Energy is below 50%, increases Energy Recharge by 30%."
    },
    {
        "name": "Wolvensprint",
        "type": "Passive",
        "desc": "Decreases all party member's sprinting Stamina Consumption by 20%."
    },
    {
        "name": "Regina Probationum",
        "type": "Ascension 1",
        "desc": "When Rosaria strikes an opponent from behind using Ravaging Confession, Rosaria's CRIT Rate increases by 12% for 5s."
    },
    {
        "name": "Shadow Samaritan",
        "type": "Ascension 4",
        "desc": "Casting Rites of Termination increases CRIT Rate of all nearby party members (except Rosaria herself) by 15% of Rosaria's CRIT Rate for 10s. CRIT Rate Bonus gained this way cannot exceed 15%."
    },
    {
        "name": "Night Walk",
        "type": "Passive",
        "desc": "At night (18:00 - 6:00), increases the Movement SPD of your own party members by 10%. Does not take effect in Domains, Trounce Domains, or Spyral Abyss. Not stackable with Passive Talents that provide the exact same effects."
    },
    {
        "name": "Immovable Will",
        "type": "Ascension 1",
        "desc": "While in the Crowfeather Cover state provided by Tengu Stormcall, Aimed Shot charge times are decreased by 60%."
    },
    {
        "name": "Decorum",
        "type": "Ascension 4",
        "desc": "When Tengu Juurai: Ambush hits opponents, Kujou Sara will restore 1.2 Energy to all party members for every 100% Energy Recharge she has. This effect can be triggered once every 3s."
    },
    {
        "name": "Land Survey",
        "type": "Passive",
        "desc": "When dispatched on an expedition in Inazuma, time consumed is reduced by 25%."
    },
    {
        "name": "Someone More Capable",
        "type": "Ascension 1",
        "desc": "When Sayu triggers a Swirl reaction while active, she heals all your characters and nearby allies for 300 HP. She will also heal an additional 1.2 HP for every point of Elemental Mastery she has. This effect can be triggered once every 2s."
    },
    {
        "name": "No Work Today!",
        "type": "Ascension 4",
        "desc": "The Muji-Muji Daruma created by Yoohoo Art: Mujina Flurry gains the following effects: When healing a character, it will also heal characters near that healed character for 20% the amount of HP. Increases the AoE of its attack against opponents."
    },
    {
        "name": "Yoohoo Art: Silencer's Secret",
        "type": "Passive",
        "desc": "When Sayu is in the party, your characters will not startle Crystalflies and certain other animals when getting near them. Check the \"Other\" sub-category of the \"Living Beings / Wildlife\" section in the Archive for creatures this skill works on."
    },
    {
        "name": "Black Kite's Enigma",
        "type": "Ascension 1",
        "desc": "When Aiming, the charging time is decreased by 0.285s based on each point of Sethos's current Elemental Energy. Charging time can be reduced to a minimum of 0.3s through this method and a maximum of 20 Energy can be tallied. If a Shadowpiercing Shot is fired, consume the tallied amount of Elemental Energy; if it is a Charge Level 1 shot, then consume 50% of the tallied amount of Elemental Energy."
    },
    {
        "name": "The Sand King's Boon",
        "type": "Ascension 4",
        "desc": "Sethos gains the \"Scorching Sandshade\" effect, increasing the DMG dealt by Shadowpiercing Shots by 700% of Sethos's Elemental Mastery. The Scorching Sandshade effect will be canceled when any of the following conditions are met: 5s after a Shadowpiercing Shot first hits an opponent. After 4 Shadowpiercing Shots strike opponents. When a Shadowpiercing Shot affected by Scorching Sandshade first hits an opponent, Sethos will regain Scorching Sandshade after 15s."
    },
    {
        "name": "Thoth's Revelation",
        "type": "Passive",
        "desc": "Displays the location of nearby resources unique to Sumeru on the mini-map."
    },
    {
        "name": "Catalyst Conversion",
        "type": "Ascension 1",
        "desc": "When Sucrose triggers a Swirl effect, characters in the party with the matching element have their Elemental Mastery increased by 50 for 8s."
    },
    {
        "name": "Mollis Favonius",
        "type": "Ascension 4",
        "desc": "When Astable Anemohypostatis Creation - 6308 or Forbidden Creation - Isomer 75 / Type II hit an enemy, increases other party member's Elemental Mastery based on 20% of Sucrose's Elemental Mastery for 8s."
    },
    {
        "name": "Astable Invention",
        "type": "Passive",
        "desc": "When Sucrose crafts Character and Weapon Enhancement Materials, she has a 10% to obtain double the product."
    },
    {
        "name": "Imbricated Armor",
        "type": "Ascension 1",
        "desc": "When your current active character obtains or refreshes a Blazing Barrier, this character's Shield Strength will increase by 5% for 6s. This effect can be triggered once every 0.3 seconds. Max 5 stacks."
    },
    {
        "name": "Flaming Assault",
        "type": "Ascension 4",
        "desc": "DMG dealt by Crimson Ooyoroi's Fiery Collapse is increased by 2.2% of Thoma's Max HP."
    },
    {
        "name": "Snap and Swing",
        "type": "Passive",
        "desc": "When you fish successfully in Inazuma, Thoma's help grants a 20% chance of scoring a double catch."
    },
    {
        "name": "Crossfire",
        "type": "Ascension 1",
        "desc": "Increases the flame range of Guoba by 20%."
    },
    {
        "name": "Beware, It's Super Hot!",
        "type": "Ascension 4",
        "desc": "When Guoba Attack's effect ends, Guoba leaves a chili pepper on the spot where it disappeared. Picking up a chili pepper increases ATK by 10% for 10s."
    },
    {
        "name": "Chef de Cuisine",
        "type": "Passive",
        "desc": "When Xiangling cooks an ATK-boosting dish perfectly, she has a 12% chance to receive double the product."
    },
    {
        "name": "Hydropathic",
        "type": "Ascension 1",
        "desc": "When a Rain Sword is shattered or when its duration expires, it regenerates the current character's HP based on 6% of Xingqiu's Max HP."
    },
    {
        "name": "Blades Amidst Raindrops",
        "type": "Ascension 4",
        "desc": "Xingqiu gains a 20% Hydro DMG Bonus."
    },
    {
        "name": "Flash of Genius",
        "type": "Passive",
        "desc": "When Xingqiu crafts Character Talent Materials, he has a 25% chance to refund a portion of the crafting materials used."
    },
    {
        "name": "\"The Show Goes On, Even Without an Audience...\"",
        "type": "Ascension 1",
        "desc": "Decreases the number of enemies Sweeping Fervor must hit to trigger each level of shielding. Shield Level 2: Lead-In requirement reduced to 1 enemy hit. Shield Level 3: Rave requirement reduced to 2 enemies hit or more."
    },
    {
        "name": "\"...Now That's Rock 'N' Roll!\"",
        "type": "Ascension 4",
        "desc": "Characters shielded by Sweeping Fervor deal 15% increased Physical DMG."
    },
    {
        "name": "A Rad Recipe",
        "type": "Passive",
        "desc": "When a Perfect Cooking is achieved on an DEF-boosting dish, Xinyan has a 12% chance to obtain double the product."
    },
    {
        "name": "Proviso",
        "type": "Ascension 1",
        "desc": "When Yanfei consumes Scarlet Seals by using a Charged Attack, each Scarlet Seal will increase Yanfei's Pyro DMG Bonus by 5%. This effect lasts for 6s. When a Charged Attack is used again during the effect's duration, it will dispel the previous effect."
    },
    {
        "name": "Blazing Eye",
        "type": "Ascension 4",
        "desc": "When Yanfei's Charged Attack deals a CRIT Hit to opponents, she will deal an additional instance of AoE Pyro DMG equal to 80% of her ATK. This DMG counts as Charged Attack DMG."
    },
    {
        "name": "Encyclopedic Expertise",
        "type": "Passive",
        "desc": "Displays the location of nearby resources unique to Liyue on the mini-map."
    },
    {
        "name": "Starscatter",
        "type": "Ascension 1",
        "desc": "While affected by the Adeptal Legacy state caused by Moonjade Descent, Yaoyao will constantly throw White Jade Radishes at nearby opponents when she is sprinting, jumping, or running. She can throw 1 White Jade Radish this way once every 0.6s."
    },
    {
        "name": "In Others' Shoes",
        "type": "Ascension 4",
        "desc": "When White Jade Radishes explode, active characters within their AoE will regain HP every 1s based on 0.8% of Yaoyao's Max HP. This effect lasts 5s."
    },
    {
        "name": "Tailing on Tiptoes",
        "type": "Passive",
        "desc": "When Yaoyao is in the party, your characters will not startle Crystalflies and certain other animals when getting near them. Check the \"Other\" sub-category of the \"Living Beings / Wildlife\" section in the Archive for creatures this skill works on."
    },
    {
        "name": "True to Oneself",
        "type": "Ascension 1",
        "desc": "Using Opening Flourish at the precise moment when Yun Jin is attacked will unleash its Level 2 Charged (Hold) form."
    },
    {
        "name": "Breaking Conventions",
        "type": "Ascension 4",
        "desc": "The Normal Attack DMG Bonus granted by Flying Cloud Flag Formation is further increased by 2.5%/5%/7.5%/11.5% of Yun Jin's DEF when the party contains characters of 1/2/3/4 Elemental Types, respectively."
    },
    {
        "name": "Light Nourishment",
        "type": "Passive",
        "desc": "When Perfect Cooking is achieved on Food with Adventure-related effects, there is a 12% chance to obtain double the product."
    }
]