[
    {
        "post_id": 1,
        "food_id": "178249",
        "user_id": "2003135967",
        "content": "Can kalamata olives be substituted for the green olives?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 2,
        "food_id": "178249",
        "user_id": "2001693157",
        "content": "Can kalamata olives be substituted for the green olives?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 3,
        "food_id": "178249",
        "user_id": "2002470084",
        "content": "I know it would be delicious, but must the chicken be grilled? Can it be baked in the oven?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 4,
        "food_id": "178249",
        "user_id": "2002091378",
        "content": "How many calories sodium and carbs in this meal\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 5,
        "food_id": "178249",
        "user_id": "239767",
        "content": "DH and I made this for dinner last night and our only complaint was that we ate too much becuase it was so good! Only change I made was used garlic powder instead of roasted garlic in the tapenade as we were short on time. Thank you for posting.\nSee More  ",
        "likes": "3",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "178249",
        "user_id": "2001492522",
        "content": "Great dish to make and serve right off the grill. Flavor was so wonderful.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 7,
        "food_id": "178249",
        "user_id": "2002974579",
        "content": "Absolutely loved this! We fought over who was getting the left overs for lunch. It was equally as delicious as left overs. I added feta cheese. I may cut the lemon juice down in the veggies the next time.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 8,
        "food_id": "178249",
        "user_id": "735767",
        "content": "This has so much flavor and easy to make! This is will be a new regular at our house!! I served it with some angel hair with a little garlic and olive oil....home run:)\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 9,
        "food_id": "178249",
        "user_id": "2002012581",
        "content": "This was ABSOLUTELY delicious!!! My family loved it and had seconds! I doubled it so my husband and I finished it last night. We sprinkled a little bit of feta on top as well. Thank you for sharing your recipe!\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 10,
        "food_id": "178249",
        "user_id": "2003135967",
        "content": "I bought a very cheap roast and stabbed it all over with a fork (just to make sure that it was dead).\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 11,
        "food_id": "178249",
        "user_id": "239767",
        "content": "DH and I made this for dinner last night and our only complaint was that we ate too much becuase it was so good! Only change I made was used garlic powder instead of roasted garlic in the tapenade as we were short on time. Thank you for posting.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 12,
        "food_id": "178249",
        "user_id": "481092",
        "content": "Excellent! Perfect summer dish with the easy to grill chicken and the cool topping. I just used lemon pepper on the chicken instead of juice and peel. Very good. Thanks for posting.\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "293197",
        "user_id": "2002480485",
        "content": "What can the falafel be served with?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 2,
        "food_id": "293197",
        "user_id": "465829",
        "content": "This is good Falafel! I could not find dried fava beans, so I used well drained canned. The blend of spices were so good. I served with Recipe #59336 and some red onions sliced very thinly inside pita bread. I will make again. Made and Reviewed for ANZ Recipe Swap #25 - Thanks! :)\nSee More  ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "293197",
        "user_id": "2001112113",
        "content": "I love falafel so much and this recipe makes them so easy to do at home. The key is to remember to soak the beans the night before! Followed the recipe exactly and it was great.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "293197",
        "user_id": "599450",
        "content": "These are as good as any falafel I've eaten from American west to east coasts (i.e., San Francisco to NYC). I, too, couldn't find \"broad beans\", aka \"fava beans\", so I used all garbanzo beans, which is fairly traditional from my understanding. Great flavors! I served them in recipe #187699. Thanks, Che floWer! Made for PRMR.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "293197",
        "user_id": "498487",
        "content": "No stars because I really didn't know what to expect from this recipe. I've never had Falafel before and just thought this would be a nice change of pace. It didn't go over as well as I'd hoped. We found them bland, which surprised me given the delectable spices that went into them, and dry. Now a friend of mine who has had Falafel in Israel liked them though she agreed they were a bit dry and suggested adding a small amount of extra virgin olive oil to the mix. I may try this again adding oil and doubling the spices, if I do I'll update my review.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "293197",
        "user_id": "1580637",
        "content": "First time making (though long time eating!) falafel and this was surprisingly easy and really really good (I used all dried garbanzos though). They were crispy on the outside and super tender in the middle. They had really good flavor too even though I had no coriander nor cilantro. A couple things I'd do different next time, and recommend to others: 1) Careful not to chop/puree the chickpea mixture too much. I over-did it and they were a bit too runny. Stop when the mixture is still a bit course. 2) When deep-frying I found they did best at 350 degrees for 5 minutes (though I found another recipe telling me 375, I thought they came out too dark at that temp). 3) Sprinkle with course salt immediately after removing from the frier, the salt will stick better when they are still hot.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 7,
        "food_id": "293197",
        "user_id": "2001112113",
        "content": "I served them on top of some hummus with pita. So good!\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 8,
        "food_id": "293197",
        "user_id": "2001112113",
        "content": "I served them on top of some hummus with pita. So good!\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "487593",
        "user_id": "2001112113",
        "content": "Loved these little fish foil packets so much. They were so easy and the oven does all the work for you which is always a nice bonus. These would be great thrown on the grill as well.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "487593",
        "user_id": "612622",
        "content": "Sooooo good! I rarely write reviews but this one is worth it. Very quick and easy. I did find that I needed to cook it about 28 min instead of the suggested 15-20. I probably ended up doubling the amount of veggies to just because I love zucchini so much. Very happy I have another new fish recipe in my cookbook! Oh also, I wasn't able to find an actual Greek seasoning so I got a seasoning that had similar ingredients.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "487593",
        "user_id": "2201427",
        "content": "Looks (and sounds) awesome!!! Love tilapia!!!\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "487593",
        "user_id": "914360",
        "content": "This looks really delicious !\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "487593",
        "user_id": "2206320",
        "content": "Awesome recipe ~ mouthwatering!!!!\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "47961",
        "user_id": "2001112113",
        "content": "I love lentils so much, and wanted to try something new. This recipe is a keeper. I've never had anything like this before and will definitely be making it again!\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "47961",
        "user_id": "282673",
        "content": "i have made this salad several times now and love it! i use the french puy lentils but don't cook them as long as the recipe states. i use dried mint, and also reduce the garlic since in this recipe it is not cooked. i founf that this makes great leftovers, the flavors blend and intensify. i plan to make this a lot over the summer.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "47961",
        "user_id": "1182971",
        "content": "This was really good. I didn't know what to expect since it is my first experience with lentil salad, but it certainly won't be the last. The only change I made to the recipe was to lower the amount of oil. I do agree with one review that it is best served in smaller quantities since it is quite bold. I will be making this again.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "47961",
        "user_id": "13796",
        "content": "I liked this. It was easy to prepare as I had all of the ingredients on hand. I used mint AND fresh basil. I cut out 1 tablespoon each of the oil and lemon juice and it was just right. I brought the lentils to a boil and then turned them down to a very low simmer for 25 minutes. They were almost a little too soft but most of them held their shape really well. I poured ice water over them to stop the cooking process. Good recipe and good for you, too.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "47961",
        "user_id": "2002526386",
        "content": "I actually tried this recipe because I adore all kinds of varieties and flavors of Salsa that adds to my main dishes. It could be PASTA, a Baked Potato, not just meat, and this particular salsa is DELICIOUS!! Very filling. I highly recommend this salsa recipe if you love Lentils like myself.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "47961",
        "user_id": "2002242767",
        "content": "For my next meal/leftovers, I added garlic powder, extra lemon juice, salt and pepper to taste, and lemon zest to add a little extra flavor. Those changes helped make it better but still not excellent.\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 7,
        "food_id": "47961",
        "user_id": "167225",
        "content": "This is delicious; I've had the recipe for a while and made it several times (most recently for a 4th of July barbecue) and everyone who tries it is impressed. I really like the flavor of the mint. This time, I found there was too much dressing (I think this may be in part because I didn't use the full amount of cheese), so if your measurements are a bit loose, it might be a good idea to whisk those ingredients together and then add as needed. I've successfully used balsamic vinegar instead of lemon juice; it's a different flavor, but still very tasty.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "229948",
        "user_id": "844554",
        "content": "I'm starting to cook more with balsamic vinegar and this one hit the spot. I used white button, less oil and no salt. Delicious! Made for Zaar Cookbook Tag Game 2011.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "229948",
        "user_id": "21752",
        "content": "These were wonderful! I used generic button mushrooms on sale at the supermarket and a healthy dash of Moroccan paprika as well. Made for ZWT 5.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "229948",
        "user_id": "135470",
        "content": "These were good mushrooms, but in making several varieties at once, found them of be lacking in flavor comparatively. The addition of garlic or shallots, would definitely make an improvement. Thanks for sharing your recipe made for ZWT 5 for the Cooks With Dirty Faces\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "229948",
        "user_id": "2156777",
        "content": "This was quick and easy. I have another similar recipe but it has more spices...garlic, parsley, oregano and such. This is better if I need to put soemthing together quickly though.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "229948",
        "user_id": "1060667",
        "content": "These were delicious! I do think some chopped garlic would be a great addition, but great as is :)\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "158351",
        "user_id": "2002044255",
        "content": "What is the bed the salmon is placed upon ?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 2,
        "food_id": "158351",
        "user_id": "1188676",
        "content": "The best salmon recipe on Zaar. I make it over and over again. Sometimes I double the marinade since that is the best part and add a bit of water at the end to have some gravy.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "158351",
        "user_id": "277434",
        "content": "I baked instead of seared this, mainly because I had a whole side of salmon and was feeling lazy, but it was excellent. I made a fairly large amount of the paste (using the proportions in the recipe of course) which I spread on the flesh side and baked in a rimmed baking sheet at 450Âº for 10 minutes (it was about 1\" thick at the thickest). As an aside, the paste did not burn when baking it.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "158351",
        "user_id": "137911",
        "content": "Awesome recipe!!! I was looking for a pan-seared recipe for salmon and this is wonderful! I did add about 1/2 tsp of tumeric to the marinade, but other than that, it was as listed. I seared it in my stainless steel pan with just a spray of canola oil. I had no problem with sticking. Served this with some jasmine rice and beets (at my dd's request). Pam\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "158351",
        "user_id": "2003097947",
        "content": "https://worldfashiontips.com/\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "158351",
        "user_id": "496803",
        "content": "This was a great flavor combination with the fish. A bit spicy, but not enough to blow your head off, and very easy to mix up. I left the skin on, put the marinade on the flesh side, and let it sit for about 1/2 hour. Then I grilled it skin side down. A wonderful meal, made for ZWT9\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "537248",
        "user_id": "2003034514",
        "content": "This was almost perfect! I didn't have a mandolin, so I hand sliced, and loved how delicious the vegetable blend was. The only thing I will change next time is to reduce the lemon zest to about a tablespoon. the zest of one whole lemon almost overpowered the recipe, and my guys didn't like that. Might also add mozarella cheese to make it a little richer.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "537248",
        "user_id": "2002978494",
        "content": "To be honest I do not care for lasagna at all but this recipe sounded wonderful so gave it a shot last night. . I did make a few changes from the original. I hand sliced the eggplant and zucchini and were much thicker than Natasha’s so roasted both in the oven for 10 minutes before assembling the dish. I also added lots of mozzarella and Parmesan because I love Gooey food. I used my homemade marinara put the dish together baked and it was beyond fabulous. Will definitely Make again.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "537248",
        "user_id": "2002770718",
        "content": "Loved cooking this! It was delicious.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "537249",
        "user_id": "2000407935",
        "content": "There are directions for making the vinaigrette but the ingredients for the vinaigrette are not listed. How much vinegar, orange juice, Dijon mustard, shallots, and garlic?\n ",
        "likes": "3",
        "type": "question"
    },
    {
        "post_id": 1,
        "food_id": "138183",
        "user_id": "2001112113",
        "content": "Okay, one of the best salmon dishes on this site! I cooked it under the broiler since it's easier but honestly the salad topping is what really makes it! I love this recipe.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "138183",
        "user_id": "8629",
        "content": "Loved this! I used kalamata olives. I prepared the topping (less the fresh basil) a day in advance and refrigerated it. I brought the topping to room temperature the next day and added the fresh basil just before serving. I served this with the couscous. I'm glad I have leftovers.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "138183",
        "user_id": "2001755986",
        "content": "Trying to get my husband to like salmon. He will eat it if I make fresh salmon patties and tolerate one other recipe. I made this last night and he can’t stop raving about it. I did ours on the stove and it was perfect. Crispy on the outside and juicy inside. As I sautéed it I did cut off the thinner ends as they got done and placed them on top of the thicker ends so they’d stay warm. The tomato/olive tepanade was great !\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "138183",
        "user_id": "2002039866",
        "content": "The salad was good enough to hide the fact that I was using 1.5-year-old frozen salmon fillets, but I bet this would be out of this world with fresh, bbq’d salmon! I used Kalamata olives and dried basil.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "138183",
        "user_id": "285039",
        "content": "Loved it! Quick and easier version of the copycat Buca Di Beppo Salmon Siracusa I often make! Delish\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "428004",
        "user_id": "836852",
        "content": "Really liked these veggies! Didn't have eggplant and used sweet potatoes and threw in some mushrooms, but it was still sooo good. Was even better in leftovers the next day.\n ",
        "likes": "3",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "428004",
        "user_id": "128473",
        "content": "My dh & I really enjoyed this dish. It was the first time that we tried eggplant and we loved it. It was quick and easy to make, tender and crisp with a slightly sweet, yet savory flavor. I used white balsamic vinegar and green onions instead of chives, I also added a small sweet potato. Thank you starrynews for sharing a recipe that we will enjoy again and again.\nSee More  ",
        "likes": "3",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "428004",
        "user_id": "1226388",
        "content": "I love roasted vegetables, but this was even better than I expected. The marinade flavors really come thru, it was sweet and tangy, and really delicious! Thanks for posting this, it really hit the spot tonight! Made for ZWT 9\n ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "428004",
        "user_id": "1169750",
        "content": "This was wonderful. There was not one morsel left! Next time, more eggplant, less potatoes. Thanks for posting.\n ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "428004",
        "user_id": "131126",
        "content": "We really enjoyed this tasy dish & will make it again. The eggplant was divine & paired wonderfully with the potatoes. The balsamic gave a nice undertone with a slightly sweet highlight. Thank you for sharing the recipe!\n ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "428004",
        "user_id": "2001556102",
        "content": "I replaced Eggplant with courgettes and added cherry tomatoes 10 minutes before the end.\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 7,
        "food_id": "428004",
        "user_id": "148221",
        "content": "So easy and soooo good! I made a few changes; I used two large potatoes and 2 large zucchini in place of the eggplant, and I didn't have any chives so I bumped the basil up to 1 tsp in it's place. I cut my potatoes in smaller chunks to reduce the cooking time, and ended up cooking it 22 minutes, stirring it, then 10 minutes more and my veggies were all nice and soft. I also skipped the cooking spray part and coated my veggies in a large bowl with the oil and herbs. I was a little scared of 2 TBS of vinegar, but it wasn't a problem at all. I'm extremely excited about this because, to me, I felt like I was eating vegetarian hash but wasn't missing the meat a bit. Thanks so much!!\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 8,
        "food_id": "428004",
        "user_id": "815198",
        "content": "Love this recipe!! It tasted like I the vegetables were grilled, perfect for when it's not grilling season. I made this as is, except I chickened out on the eggplant and substituted mushrooms instead. We'll be making this again for sure, so maybe next time I'll try it out with the eggplant :)\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 9,
        "food_id": "428004",
        "user_id": "128473",
        "content": "My dh & I really enjoyed this dish. It was the first time that we tried eggplant and we loved it. It was quick and easy to make, tender and crisp with a slightly sweet, yet savory flavor. I used white balsamic vinegar and green onions instead of chives, I also added a small sweet potato. Thank you starrynews for sharing a recipe that we will enjoy again and again.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "12684",
        "user_id": "2002470084",
        "content": "Is there anything else you can substitute for the beans besides chickpeas? I'm not a bean fan but would like to have the protein.\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 2,
        "food_id": "12684",
        "user_id": "12657",
        "content": "This was great! I omitted the feta cheese, and used walnuts instead of pine nuts. Also, I wasn't sure if you meant dried oregano or fresh, and all I had was dried, so I used the given amount of dried oregano, even though it looked like a bit much! However, it all came together in the end, with the crunch of the walnuts complimenting the kidney beans, tomatoes, and cousous to perfection! Thanks stephanie!\nSee More  ",
        "likes": "6",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "12684",
        "user_id": "143308",
        "content": "Yumbo! I used Isreali couscous, which is bigger than other types of couscous and it was fab!\n ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "12684",
        "user_id": "171210",
        "content": "I really enjoyed this dish, it was very light and refreshing. The only reason I'm not giving it a 5 star is because my kids weren't really fans and my husband was indifferent. I will still make this again, but to take for lunch instead of for the whole family. Thanks for the recipe!\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "12684",
        "user_id": "126440",
        "content": "Loved this salad with Mediterranean Tilapia Pockets. Easy and such great flavors.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "12684",
        "user_id": "452355",
        "content": "I loved this fresh tasting couscous salad! Perfect combination of ingredients and flavors and it was so easy. I made no modifications. I'll definitely be making this again! Thanks!\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 7,
        "food_id": "12684",
        "user_id": "2001831916",
        "content": "This salad was so good, I used garbanzos instead of the kidney beans, and chopped kalamata olives instead of the pine nuts because the store was out, and a teaspoon of dried oregano because I think the original recipe calls for fresh, but it was perfect! I'd definitely serve it up with some grilled steak or chicken next time.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 8,
        "food_id": "12684",
        "user_id": "539990",
        "content": "Everybody loved it! My daughter had a blast helping make it. We used chickpeas instead of kidney beans. Will make again, thanks!! :)\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 9,
        "food_id": "12684",
        "user_id": "465460",
        "content": "we really enjoyed this, especially with the chickpeas instead of the kidney beans.\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 10,
        "food_id": "12684",
        "user_id": "3288",
        "content": "Nice tasting recipe! I fought my need to mess with the recipe and did as posted with the exception of using red beans instead of kidney beans - just what I had on hand. This was subtle, and I can't wait to see how the tastes meld overnight. Thanks for a great summer salad!\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 11,
        "food_id": "12684",
        "user_id": "145960",
        "content": "Very good. I made this ahead of time (8 hours or so) and it was great. I'm eating it today as leftovers. I used toasted slivered almonds instead of pine nuts. Next time I will add sliced kalamata olives. I think it would enhance the recipe alot.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "536387",
        "user_id": "2001038345",
        "content": "These were awesome! Very quick and easy. And the Tzatziki sauce is very good. This recipe is worth it for that alone.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "536387",
        "user_id": "2001736429",
        "content": "Easy, delicious, full of flavor. Will put this in the rotation! I do think the turkey burgers need more than 4 mins per side but I am going to grill them the next time.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "131988",
        "user_id": "900992",
        "content": "The 3-star rating if for the recipe as is. After the following changes, we would rate it 5 stars. <br/>We roasted the red pepper and removed the skin. However, we found the flavor of the kalamata olives to be very overpowering. To fix this, we added an extra half of a red pepper (raw, not roasted), 2 tablespoons of plain yogurt, 1 extra tablespoon of lemon juice, 1 extra tablespoon of tahini, and 1 extra tablespoon of parsley. It was fine after these additions... and this resulted in more hummus :-)\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "131988",
        "user_id": "292841",
        "content": "Oh my word, thank you for this absolutely fabulous recipe! I thought it was the best hummus I have ever had the pleasure to have tasted. And I made it!<br/>The only thing I did to change it was pour boiling water on my chick peas a couple of times, stir it around a bit to get the skin like covering off the peas. The skin coverings float to the top. <br/>It may take a wee bit more time, but it allows for a more creamier hummus. Again, thank you!\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "131988",
        "user_id": "402698",
        "content": "I made it for myself and a couple of moms I had over for lunch. It was sooo delicious. I like the spiciness...just right!\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "131988",
        "user_id": "312679",
        "content": "OOOH My goodness this is so so yummy! Try this! My friend loved it too!! I also love #117045, #35625, and #11424.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "131988",
        "user_id": "89831",
        "content": "this hummus is SOOOOOOOO good! I have been wanting to try this recipe for quite sometime and I'm so glad I finally got to making it, it's just delicious! I increased the garlic and added in lots black pepper, I can't wait to make this again, thanks for sharing this great hummus recipe hon!...Kitten :)\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "299973",
        "user_id": "444132",
        "content": "So simple, so delicious, so fresh - this is perfect for such a beautiful sunny spring day! I added some fresh ground pepper, used pearl boccocini for the mozzerella, and vidalia onion for my sweet onion. I love it! Thanks for posting, Brooke! Made for Zaar Stars Tag.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "299973",
        "user_id": "494084",
        "content": "THis was easy, healthy and good! THe flavor was missing something for me (that I can't quite put my finer on) but since it was so easy and good for you I'll probably make it again. Thanks so much Brooke!!\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "299973",
        "user_id": "191533",
        "content": "I was actually surprised at how much my husband ate of this. He's not big on vinegar. I did think it was lacking flavor so I added sugar, salt, and garlic powder. (didn't use fresh garlic)\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "299973",
        "user_id": "604906",
        "content": "Had some chickpeas I cooked myself and this looked like a good recipe to try. I made it twice, added a lot more balsamic vinegar because it didn't have enough flavor for me. Also left out the cheese the second time, it was just as good.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "299973",
        "user_id": "169430",
        "content": "This was a most enjoyable salad. With the cheese this could easily be a full meal on it's own but it was great with grilled chicken. A wonderful balance of flavors.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "299973",
        "user_id": "13593",
        "content": "I do not hesitate to rate this recipe with five stars. This is so easy, refreshing, and healthy. I followed the directions as written, but did use yellow onion and Kosher salt instead of sweet onion and sea salt. I don't think it really changed the recipe. This is a nice cooling recipe that is great for summer and lunch boxes. Thank you for sharing.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 7,
        "food_id": "299973",
        "user_id": "691407",
        "content": "I took this salad to a backyard BBQ this weekend as my side dish. It was served with burgers, brats, ribs, hot dogs, etc. The crowd loved it and finished it off. Very easy to make, literally chop everything and throw it into one bowl. I used feta cheese instead of mozzarella, and waited to add it until right before it was served. I also used table salt instead of sea salt, tasted great!!\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 8,
        "food_id": "299973",
        "user_id": "216999",
        "content": "Easy to prepare and delicious, this one is a keeper! I left out the parsley and basil and we do not care for them, and used fresh goat-milk feta instead of the mozzarella. Made for the Dining Daredevils for ZWT5.\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 9,
        "food_id": "299973",
        "user_id": "197023",
        "content": "A wonderfully delicious - and SO healthy - summer salad. I made this exactly to the recipe - except for using chives instead of the sweet onion and doubling the garlic (a matter of availability and personal taste preferences) and served it on a bed of baby spinach leaves. I'll be making this again during the summer months. Thank you for sharing another fabulous recipe, Brooke!\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 10,
        "food_id": "299973",
        "user_id": "89831",
        "content": "very good although it needed a few amount adjustments and fresh ground black pepper, I used green onions in place of the sweet onion as I have a huge crop in my garden, thanks for sharing Brooke!\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "304166",
        "user_id": "2001556398",
        "content": "I have a couple of quick questions I have never really dealt with english cucumbers. I've read about the differences. Can you use plain cucumbers instead? Does it significantly alter the taste of the sauce?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 2,
        "food_id": "304166",
        "user_id": "2000898883",
        "content": "Love this recipe for an easy tzatziki. I don’t salt my cucumber, instead I grate and squeeze them in a dish towel to remove all the liquid. Have never had an issue with watery leftovers. I don’t use a blender, instead I just mix everything in one bowl. And refidgerate for a while. Easy to adjust this to taste.\nSee More  ",
        "likes": "6",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "304166",
        "user_id": "2001160057",
        "content": "I worked for a Greek/Lebanese restaurant, and we would make this with sour cream instead of yogurt. Really tasty!\n ",
        "likes": "5",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "304166",
        "user_id": "2001067738",
        "content": "For 14+ years I lived in Tarpon Springs, FL which has a very large population of Greeks. So, I've had real, authentic Greek-style food and my favorite was their gyros. I LOVED those gyros which, of course, are served with tzaztiki sauce. This recipe is amazing! I made it exactly as the recipe stated and it was so good I'm making more for dipping veggies for our Fourth of July party this weekend! I did use an English cucumber because of its mild flavor (I don't like cucumbers) but I changed NOTHING in this recipe because it was perfect! Thank you so much for such a delicious recipe!\nSee More  ",
        "likes": "3",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "304166",
        "user_id": "2002225290",
        "content": "Made the recipe here's what I'd change. Use 1 container full fat Greek yogurt as is don't bother with squeezing. Peel, seed and finely grate 3 cucumbers. Squeeze out liquid from cukes. Using a garlic press take around 10 garlic cloves to start press add more to your preference. Juice of 1 lemon 2 tablespoons each finely chopped mint and dill salt white pepper mix in bowl all ingredients omit blender\nSee More  ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "304166",
        "user_id": "2001650017",
        "content": "I wanted a garlicy tzatziki so I had to add 11 cloves of garlic. Great recipe! Edit: Tried it an hour later and it was too spicy. Probably should stick to 5-6 cloves\n ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 7,
        "food_id": "304166",
        "user_id": "2000165997",
        "content": "Don’t Salt the cucumber. Made this recipe per directions. Way too watery and way too salty. Grate the cucumber and squeeze in a towel to get the water out. Unless you’re feeding an army make 1/3 or 1/4 recipe. Don’t process the cucumber - just the other seasonings.\nSee More  ",
        "likes": "1",
        "type": "tweak"
    },
    {
        "post_id": 8,
        "food_id": "304166",
        "user_id": "2895155",
        "content": "This was an okay sauce. I've made other versions of tzatziki sauce that I liked better. This one came out a little thinner than I would have liked. I think it's because the recipe has you blend the cucumber and spices before adding to the yogurt. In previous recipes I've tried, you just dice the cucumber and add the seasonings to the yogurt instead of blending it all up to make a puree. I probably won't be making this recipe again.\nSee More  ",
        "likes": "1",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "536714",
        "user_id": "505731",
        "content": "The last ingredient for the tabbouleh is listed as \" 1 other seeds or nuts\". What measurement is this \"1\" referring to? One Tablespoon, One Cup, ??\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 1,
        "food_id": "39195",
        "user_id": "58104",
        "content": "I just love this! I also put raisins(golden) in along with the capers.\n ",
        "likes": "6",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "39195",
        "user_id": "2003001761",
        "content": "This is a delicious dish, however your recipe is not in the traditional way. This is a Sicilian dish and we don't use peppers, nor balsamic vinegrette or brown sugar. The authentic way is to use cut whole tomatoes, ONLY Green olives, not the pimentos, red wine vinegar and white sugar to taste. This is a sweet/sour dish. Room temperature over a nice crusted bread or toasted crusted bread is ideal. This is a rustic dish and no pre-manufactured products are needed (puree & balsamic vinegrette)\nSee More  ",
        "likes": "4",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "39195",
        "user_id": "10033",
        "content": "I have now made this several times. This is an excellent and versatile recipe--I even froze a bunch of it and have reheated it to serve with pasta or as relish for a main dish. I did leave the skin on the eggplant for color and fiber. I also added a bit of white wine. thanks for posting!\nSee More  ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "39195",
        "user_id": "2001112113",
        "content": "Such a delicious recipe! I made it just as directed and it turned out great. Perfect as a side or a light summer meal with some crusty bread on the side.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "39195",
        "user_id": "37779",
        "content": "This caponata was excellent. Very fresh tasting and had lively flavors. I skinned the eggplant because I don't like the toughness the skin sometimes has. Skipped the anchovies, although next time, I might get brave and try them. I served this on lightly toasted sliced baguette. Made a perfect light supper with a chilled bottle of white wine. Thanks 1Steve.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "39195",
        "user_id": "2002180508",
        "content": "chiffinade is strips, not finely chopped..like ribbons\n ",
        "likes": "2",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "382432",
        "user_id": "573325",
        "content": "WOW, absolutely DELICIOUS!!!! Debbie I have eaten quite a number of bulgur salads (always using millet in place of the bulgur), but this one really is one of the best! The flavours mingle perfectly and the dill and feta combined with the tomatoes and spinach are just super yummy! :) I used your recipe #415662 in place of the bulgur and it was very nice. Added a slightly nutty flavour to the salad. I will most definitely make this again as everyone just raved about it! THANKS SO MUCH for sharing this surpreme recipe here with us! Made and reviewed for my chosen chef in Veggie Swap #21 April 2010.\nSee More  ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "382432",
        "user_id": "440735",
        "content": "Wow! This was delicious. I was worried when I saw the amount of bulgar in the bowl soaking. I had to \"nuke\" the bulgur because after 40 minutes it was still crunchy. I reduced the dill to one tablespoon because dill is overpowering. I would add a1 tablespoon and a half next time. This salad was surprisingly Fantastic. I only added 3 ounces of Feta because that is what I had on hand. I did add the tomatoes which is a MUST in my opinion. It was so good. Did I say this was good?\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "382432",
        "user_id": "42413",
        "content": "This was fantastic! My only regret was that I couldn't get fresh dill (I did use some dill weed though), as I am sure that would have put it into a whole other dimension. Having said that, I loved this recipe! I will definitely be making this for the next gathering I attend. Thanks for posting!\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "382432",
        "user_id": "358796",
        "content": "I made this recipe but tweaked the amounts on ingredients. Only used 2 Tablespoons fresh dill and that was plenty. 1/3 cup would be too much for us. Overall it was good, but can't give stars since I changed the amounts so much from the original recipe.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "382432",
        "user_id": "869184",
        "content": "I cannot believe how delicious this salad is! The dill really makes the salad. Do NOT omit the dill when making this salad. I added a bit of lemon juice to the Bulgar wheat before platting, otherwise made as stated. Made for PRMR Tag.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "382432",
        "user_id": "2002912073",
        "content": "Red onion, bell peppers, and white cheddar instead of green onion, dill, and feta. Also cooked bulgur according to packaging. It was delicious!\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "111865",
        "user_id": "2001112113",
        "content": "I love this recipe! The little salad on top of the avocados is SO flavorful. It goes perfectly with the butteriness of the avocados. It's a great simple and healthy weeknight meal, or perfect as a side dish! Can't wait to make again.\n ",
        "likes": "3",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "111865",
        "user_id": "503845",
        "content": "The second time I made this I cheated and bought precut mixture of tomato, onion and jalapeno. Turned out great in half the time. I love bruschetta so this is my new go to item. Also used basil instead of oregano as I love basil.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "111865",
        "user_id": "942456",
        "content": "So good! We eat lots of avocados here in So. Cal. I see this recipe being used often. I did use cilantro but besides that followed the recipe as written. Can't wait to try it with balsamic vinegar next time.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "111865",
        "user_id": "400708",
        "content": "Made these as my contribution to a bar-b-q and they were a big hit. So simple, tasty and looked elegant. I was so pleased. Made exactly as directed except forgot to add the feta cheese. Bought it and all, just plain forgot. It was still awesome and I'll be making it again. May try balsamic vinager next time as I love the taste. Thanks for posting a wonderful recipe.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "111865",
        "user_id": "543977",
        "content": "I also added a few olives - and used white wine vinegar instead of red since I didn't have any - I will definitely be making this again\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "111865",
        "user_id": "503845",
        "content": "The second time I made this I cheated and bought precut mixture of tomato, onion and jalapeno. Turned out great in half the time. I love bruschetta so this is my new go to item. Also used basil instead of oregano as I love basil.\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 7,
        "food_id": "111865",
        "user_id": "579298",
        "content": "Yum!! I even got my little brother (11) to eat this healthy treat :) I subbed red wine vinegar for balsamic. Delicious!\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "220089",
        "user_id": "2001935726",
        "content": "I may have missed it, but is there a list of the nutritional information (including calorie count)?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 2,
        "food_id": "220089",
        "user_id": "829331",
        "content": "So i got excited that i had all the ingredients on hand for a change and prepped this without realizing the crockpot part. ha! So for those without one also, here is a useful tip I found.... \"A recipe needing 4-6 hours on HIGH in the crock will need about 90 minutes+ in the oven.\"\nSee More  ",
        "likes": "12",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "220089",
        "user_id": "39835",
        "content": "Very good dinner - I cooked it on low all day and added the beans and cilantro after I came home from work. Very easy to make on a busy day! Thanks for sharing!\n ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "220089",
        "user_id": "541842",
        "content": "really delicious and healthy, makes you feel good all the way around :)\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "220089",
        "user_id": "388248",
        "content": "This was great! My husband, a little picky, liked it as is, but did suggest that a little lemon juice might be good. A definite winner in my house!\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "220089",
        "user_id": "579298",
        "content": "This was AMAZING! I'm not on WW or Core but thought we could use a little more veggies in our diet. I never was a fan of sweet potatoes or cooked carrots before but this dish changed my mind! I simply couldn't get enough :) the only change I made was subbing the turmeric for saffron. I served this with olive oil and garlic couscous. YUM!\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "316925",
        "user_id": "2000798550",
        "content": "I am sorry, but this is horrible! First, I should have been instructed to peal the eggplant. Second, 15 minutes, and my eggplant was basically still raw. I threw out all the leftovers, including what would have been my husband’s dinner, as he does not get home until about 9:15. There was no way I was going to serve him this after a hard days work! I really wanted to love this, but following the instructions ver batim, yielded me no dinner for me, or, my husband. I could think of ways to improve this, but seriously, I am still too hungry after no dinner, to even think about it.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "316925",
        "user_id": "913360",
        "content": "Even my husband liked this recipe and he usually doesn't get excited over vegetarian meals. I added extra tomatoes and capers; additionally, my mother made this without salting the eggplant (high blood pressure) and it was also very yummy. I served over brown rice and added a bit of asiago at the table. Don't skip the parsley (sometimes I find parsley is not necessary, I really think in this recipe it is).\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "316925",
        "user_id": "1038619",
        "content": "This was delicious. I served it over a bowl of polenta, and it was the ultimate comfort-food meal. I'll be making this again and often.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "316925",
        "user_id": "704950",
        "content": "So delicious!!!!!! Ragouts are some of my favorite dishes, they have such depth of flavor and the veggies are usually the stars!!! I added a few things to enhance it even further for myself and for fun!!! First, I salted and removed the bitterness of the eggplant then roasted it using recipe # 357852 , recipe#357852,,that I really love the method and flavor of. This really sent the flavor of the eggplant into the stratosphere and lessened the time it needed to be in the skillet. I used fire-roasted tomatoes, threw in some chopped black olives and in place of parsley, I used arugula. This recipe is wonderful, it has great flavor, balance and you can tweak it with a few different veggies here and there that won't change the delicious outcome!!! Thanks so much for the recipe!!!\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "316925",
        "user_id": "597999",
        "content": "I was going to post this and here it is. This is wonderful. Only change I made was I added crushed red peppers to the onions which spiced it up. We had it over rigatoni. It's good on it's own, but I would add a small can of tomato sacue if using over pasta. This is a keeper!\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "280466",
        "user_id": "552613",
        "content": "We are big fans of barley soups and this is a very good barley soup. It was very filling and warming which was perfect for a cold almost summer's night in London. The only changes I made were to go for the vegetable stock because it was what I had and to skip the oil and use a cooking spray instead to lower the fat of the soup to next to nothing. Made for ZWT4.\n ",
        "likes": "5",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "280466",
        "user_id": "137302",
        "content": "This is a pretty good soup. The only thing I added was about a half pound of cooked lean ground beef and some kitchen bouquet for a more brown color. The only thing I wasn't real fond of was that it did have a bit of an acidic taste to it that I kept trying to correct...I wondered if it had a potato or two in it if the flavors would have been blended more. Made for ZWT #6 - 2010\n ",
        "likes": "4",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "280466",
        "user_id": "1298125",
        "content": "Very good basic barley tomato soup. I make it regularly. I often add more tomatos, barley or peppers, kale, spinach, chicken, beef,whatever moves me.I regularly change up the spicing, adding oregano, basil, sage, whatever I grab out of the spice cupboard.This recipe never fails me, whatever I add or delete it always turns out.\n ",
        "likes": "3",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "280466",
        "user_id": "401767",
        "content": "Very good recipe just as it is, and also lends itself well to using up other orphaned produce in the fridge, or odds and ends in the freezer, cupboard or pantry. It's hearty, warming, and inviting, and has a greatly satisfying texture and consistency. Last night, I'd added some diced red & green bell peppers and finely chopped baby spinach. If sodium isn't an issue for someone, a bouillon cube adds a flavor boost, as does 1/2 tsp. of crushed Italian seasoning. It's tasty with Middle Eastern spices added or great with curry powder or curry paste added for a more exotic faux Mulligatawny variation. Your favorite salsa, picante sauce, a small can of green chilies, or Southwest-style diced tomatoes can change it up easily for a different twist on it, with a handful of crushed tortilla chips or even a few Fritos also tossed into it. Wonderful way to use up any leftover roasted or rotisserie chicken too. Beans, lentils, and peas work great in it also, and when I'm feeling particularly decadent, I quarter 2 hotdog-sized Polska kielbasa sausage links length-wise, and then dice the quarters into small pieces, to give it a hint of rich sausage flavor. Diced leftover Italian sausage or meatballs work well in it, also. It's hard to go wrong with this soup, since the recipe is both so good and also extremely versatile, so it can be made often and enjoyed in a variety of ways.\n ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "280466",
        "user_id": "2000820349",
        "content": "Thank you for posting this! I was looking for inspiration on how to use up my barley and get my kids to like it in the process. I couldn't follow the recipe to a t, as i was almost out of celery, but it still turned out very well. I think this is a great basic recipe that can me adapted any way you like. Two of my kids did not like it (they are picky eaters, judging food before even tasting it, drives me crazy sometimes). But both my oldest and my husband asked me to make this again. And best of all: my almost 15 month old daughter, who is 99% breastfed because she refuses most food, gobbled this up! She has never before eaten like this and I might even get a good night's sleep out of that full tummy of hers! And thanks to two of her brothers not eating any, we have leftovers she can feast on tomorrow :-D\n ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "280466",
        "user_id": "2000431901",
        "content": "Just needed some salt added. I also topped with fresh parsley.\n ",
        "likes": "1",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "81419",
        "user_id": "2002430634",
        "content": "In another minestrone recipe they use a borlotti bean. Is there another name for it ? Also your recipe is the best I've found so far. It's the oregano definitely. I add more pepper as well. Plus I'll only add the pasta needed and then freeze the soup. I can boil some pasta as needed in vegetable broth for more flavor. Thanks in advance for your expertise. ?????????? !!! I\nSee More  ",
        "likes": "2",
        "type": "question"
    },
    {
        "post_id": 2,
        "food_id": "81419",
        "user_id": "2001468905",
        "content": "Should you drain the beans or add the entire can, undrained. Has anyone used chicken or vegetable broth instead of water?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 3,
        "food_id": "81419",
        "user_id": "2000767449",
        "content": "I made this for Christmas Eve dinner, and it was FABULOUS!!!! My husband loved it, and he's not a big fan of my cooking! ? That proves this recipe is the real deal. I did use vegetable broth instead of 3 cups of water, and put about 14 fresh spinach leaves in at the last minute. Will definitely make this many times in the future.\nSee More  ",
        "likes": "3",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "81419",
        "user_id": "25941",
        "content": "Uncle Bill, this is fantastic. I followed your recipe exactly but I used vegetable stock instead of water because I had some I needed to use up. My husband takes soup for lunch in the winter and he raved about this when he came home. Thanks for another great recipe.\nSee More  ",
        "likes": "3",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "81419",
        "user_id": "252514",
        "content": "Yum yum! A very warming and tasty minestrone with lots of zucchini (a plus!) It is also very tomato-ey, so if you love tomatoes you will enjoy this very much. My only suggestion is to cook the celery a little longer (with the onions maybe?) so they become more tender. I had to cook my soup awhile more until they softened. Also added some fresh spinach and basil from the garden. Thanks, Uncle Bill. [Made for All You Can Cook Tag]\nSee More  ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "81419",
        "user_id": "2002064320",
        "content": "I used organic lentils instead of cannellini beans and used fresh tomatoes instead of canned. All the ingredients were fresh and organic and it turned out great! Your recipe was the inspiration for my own version. Thank you for making it easy to follow.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 7,
        "food_id": "81419",
        "user_id": "2001985209",
        "content": "Awesome, easy recipe. It's super flavorful. I used macaroni instead because that's what I had. I added a splash of spicy pickle juice because it seemed like a good idea and it turned out nicely. Upped the beans because I love beans. Recommended for cold and rainy days! Thanks Uncle Bill!\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 8,
        "food_id": "81419",
        "user_id": "173976",
        "content": "I don't understand the excitement and rave reviews about this recipe. It's just a plain vegetable soup with too much zucchini and celery, and rather bland even with the addition of broth instead of water and extra spices.\n ",
        "likes": "1",
        "type": "tweak"
    },
    {
        "post_id": 9,
        "food_id": "81419",
        "user_id": "2000767449",
        "content": "I made this for Christmas Eve dinner, and it was FABULOUS!!!! My husband loved it, and he's not a big fan of my cooking! ? That proves this recipe is the real deal. I did use vegetable broth instead of 3 cups of water, and put about 14 fresh spinach leaves in at the last minute. Will definitely make this many times in the future.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 10,
        "food_id": "81419",
        "user_id": "1802528797",
        "content": "Thank you Uncle Bill for this recipe. So simple and delicious! I was looking for a vegetarian version for minestrone soup. I used chicken stock instead of vegetable, because well I'm not a vegetarian and wanted the flavor of chicken stock. My husband and two small children ate this up with crusty french bread for dipping.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 11,
        "food_id": "81419",
        "user_id": "697352",
        "content": "Mmmmm! Delish! I used chicken broth instead of water and added the whole can of beans. I love this recipe. I will make again and again. Thanks!\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 12,
        "food_id": "81419",
        "user_id": "1997017",
        "content": "I cook this every three or four weeks, it's delicious. I use 1/2 a teaspoon of oregano instead of 1/4, a dash of Worcestershire and Tabasco sauces and a teaspoon of Vegeta. My boyfriend loves it for dinner with hot toast and butter. Yum!\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "514034",
        "user_id": "1802555155",
        "content": "Being half-Israeli, I am immediately skeptical of all shakshuka recipes. This one surpassed all expectations. Great job, Mandy!\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "379639",
        "user_id": "2001921429",
        "content": "Hi everyone, just wondering if this would still be good if kept in the fridge for 24hrs? Would like to prepare day before a party.\n ",
        "likes": "1",
        "type": "question"
    },
    {
        "post_id": 2,
        "food_id": "379639",
        "user_id": "2001092295",
        "content": "Is Tabouli Gluten free?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 3,
        "food_id": "379639",
        "user_id": "2153320",
        "content": "This recipe totally lives up to its name. The best! I made it with Quinoa instead of bulgar wheat and it was FABULOUS. I just prepared one cup of dry organic Quinoa per the packaging instructions and proceeded as stated. I kept all of the veggies and other ingredients the same as I think Quinoa poofs up a bit more than the bulgar wheat. Plus I like lots of stuff in my salad. I eased up by just a bit on the olive oil and red wind vinegar but I don't think the whole amount would make much difference. Also, I used about 4 parts parsley to 1-2 parts mint which I got from my garden and is stronger than the stuff you buy in the store. I probably had at least a full 3/4 cup of parsley when chopped. To me, it is hard to determine how much \"one bunch\" is, so that's how I handled it. GREAT, GREAT recipe. Seriously the best Tabouleh Salad I have ever made.\nSee More  ",
        "likes": "5",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "379639",
        "user_id": "2032489",
        "content": "A most excellent recipe! I cut the recipe in half. No rice wine vinegar - used balsamic instead... and added cucumbers. It is the perfect balance of bulgar to parsley ratio. A few years ago,I needed a last minute dish to take to a gathering. Looking at what I had on hand and following a whim, I stumbled across a fantastic combo of mixing tabouli with a container of classic tuna salad (not mayonaisy) from Whole Foods. The flavors came together perfectly and it was a huge hit! The whole room wanted the \"recipe\". Since then, when I make tabouli, I often add a can of Albacore tuna to the mix and Wa La(!) - an excellent meal that is appreciated by all. Top with a slice of avocado and you have heaven on a plate. Without fail, recipe requests follow the first bite. It just works. In-joy.\nSee More  ",
        "likes": "4",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "379639",
        "user_id": "394077",
        "content": "I love this salad. So refreshing and clean tasting...I can eat it with everything and everyday...so good...thanks for posting it.\n ",
        "likes": "4",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "379639",
        "user_id": "1428015",
        "content": "I made this recipe 3 times and after experimenting with a couple of additions, I love it. I followed the recipe exactly and then added 1/2 of an english cucumber, chopped, and 1 1/2 packets of raw sugar. This reduced the acidity a little. Shared with others who loved it also. Thanks for posting the recipe.\nSee More  ",
        "likes": "4",
        "type": "review"
    },
    {
        "post_id": 7,
        "food_id": "379639",
        "user_id": "126440",
        "content": "I loved the flavor of this salad. I'm not sure if my bulgur was #1 grind so let it sit for one hour, then added the other ingredients. Loved the kick from the cayenne pepper. Served it with Recipe #303946 and Recipe #93401.\n ",
        "likes": "3",
        "type": "review"
    },
    {
        "post_id": 8,
        "food_id": "379639",
        "user_id": "2032489",
        "content": "A most excellent recipe! I cut the recipe in half. No rice wine vinegar - used balsamic instead... and added cucumbers. It is the perfect balance of bulgar to parsley ratio. A few years ago,I needed a last minute dish to take to a gathering. Looking at what I had on hand and following a whim, I stumbled across a fantastic combo of mixing tabouli with a container of classic tuna salad (not mayonaisy) from Whole Foods. The flavors came together perfectly and it was a huge hit! The whole room wanted the \"recipe\". Since then, when I make tabouli, I often add a can of Albacore tuna to the mix and Wa La(!) - an excellent meal that is appreciated by all. Top with a slice of avocado and you have heaven on a plate. Without fail, recipe requests follow the first bite. It just works. In-joy.\nSee More  ",
        "likes": "1",
        "type": "tweak"
    },
    {
        "post_id": 9,
        "food_id": "379639",
        "user_id": "7578910",
        "content": "Tabbouleh has always been something I wanted to make, and this recipe is the one I will use every time! I substituted Quinoa in place of the bulgur, using 1 1/2 cups of dry Quinoa to 3 cups of water and cooking it according to the directions on its package. This made the perfect amount of Quinoa to veggie ratio since I prefer a more balanced salad. Any less Quinoa and I think the parsley would have been too dominant. I used curly leaf parsley, which to me seemed to be just as flavorful as flat leaf but not as pungent. I chopped it very finely and took other's advice and measured 3/4 cup to 1 cup loosely packed. My \"1 bunch\" of green onions was 6 onions, and I used the whole onion-- both the green and the white. Where the recipe calls for 1 medium onion chopped, I only added 1/4 chopped to the salad, and it was a little too strong even with such a small amount. So I suggest using a mild or sweet onion or leaving it out altogether; I thought the green onions gave it great flavor on their own. I used fresh garden mint as well and only needed 1/4 cup or less after it was chopped. I used 16oz fresh cherry tomatoes quartered, and kept the olive oil and red wine vinegar as stated. Quinoa can be a little sticky so the oil really helped keep the texture of traditional tabbouleh. My only additions were 1 English cucumber finely chopped, which boosted the texture and flavor immensely, and about 2Tbls of balsamic vinegar to give the salad just a little bit of sweet without having to worry about granules of sugar showing up in the salad. I served this wonderful dish with hummus, pita bread, kalamata olives, and marinated Greek chicken kabobs (recipe was from a different website). Everyone loved it all!! Thank you for sharing this recipe blucoat!!\nSee More  ",
        "likes": "1",
        "type": "tweak"
    },
    {
        "post_id": 10,
        "food_id": "379639",
        "user_id": "2332788",
        "content": "Yummy! I substituted cilantro for one half of the parsley, because that is what I had and used garlic instead of the cayenne....wow.\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "364493",
        "user_id": "743849",
        "content": "We really enjoyed this healthier version of rice pilaf. Great flavor! The extra cooking time (for the brown rice) is worth it - the rice was fluffy and scrumptious! I followed the recipe EXACTLY and I wouldn't change a thing! Made for Photo Tag.\n ",
        "likes": "3",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "364493",
        "user_id": "1384367",
        "content": "I cut the recipe in half (because there are only two of us in the house), and it came out perfectly. The rice cooked in about 35 minutes and tasted great. Thank you for helping me make fluffy brown rice that my husband will eat without complaining!\nSee More  ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "364493",
        "user_id": "1099264",
        "content": "Really easy and really tasty. I used all chicken stock instead of water for extra flavor. Also great with mushrooms sautÃ©ed with the onion and pepper.\n ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "364493",
        "user_id": "465911",
        "content": "Great recipe.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "364493",
        "user_id": "514157",
        "content": "Crazy good !!! I used mostly chicken stock for this for more flavor. I used mushrooms as well and red bells too as the others stated . Oh my goodness , The smell of it cooking , is enough to make you faint !! Yummo!\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "364493",
        "user_id": "1849027",
        "content": "Absolutely Perfect! Because of the main dish I was making, I used Beef broth instead of chicken broth. It cooked perfectly and looked beautiful and my family loved it!\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 7,
        "food_id": "364493",
        "user_id": "1099264",
        "content": "Really easy and really tasty. I used all chicken stock instead of water for extra flavor. Also great with mushrooms sauted with the onion and pepper.\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "156662",
        "user_id": "2002470084",
        "content": "Would you cook bone-in, skin on chicken thighs a little longer to thoroughly cook?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 2,
        "food_id": "156662",
        "user_id": "2001177335",
        "content": "A truly simple delicious dinner, husband loved it, definitely make a again!\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "156662",
        "user_id": "471290",
        "content": "Delicious recipe. Wive loves olives and chicken thighs, so this recipe hit the spot. Will make again for sure.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "156662",
        "user_id": "288146",
        "content": "Fantastic! I subbed a can of diced tomatoes for the fresh as that was all I had on hand and it was awesome! I'm sure it would be better as written but it is great in a pinch. Thanks for the awesome recipe Kitten!\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "156662",
        "user_id": "885216",
        "content": "Great recipe! All the flavors work so well together, it makes a great Mediterranean dish. Wonderful served over cous cous.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "156662",
        "user_id": "456860",
        "content": "Excellent meal! Easy to prepare and I was able to chop and cut as I went along. The only changes that were made was an increase in garlic, 1.5 teaspoon of chili flakes, and I omitted the grape tomatoes (seemed like a lot of tomatoes already) and the parsley. (I didn't have any) It reminds me so much of pasta puttanesca which I love. I served it with rice and garlic toast. Mm!\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "183768",
        "user_id": "2000449361",
        "content": "Quick, easy summer meal. I've made couscous salad before, using a different recipe. I was looking for something I could make with items I had on hand and this was a winner.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "183768",
        "user_id": "1052873",
        "content": "Very good. I didn't have any mint and I think that was needed. It's a little bland.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "183768",
        "user_id": "452355",
        "content": "This was a flavorful, easy to make salad. We served as a side to Dolmathes. I had to use shallot in place of red onions, because I was out. We easily halved the recipe ingredients to make a smaller amount. Made for Sun and Spice 2013\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "183768",
        "user_id": "299608",
        "content": "Super nice twist on a cous cous salad...I used less mint and more parsley than indicated in the recipe b/c i thought equal proportions would be too minty for my liking. The only thing i added was diced tomatoes (which i added at the table so the leftover salad would keep better without tomatoes). If i were serving this as a meal on it's own I would also add feta cheese! Yum, thanks for a great recipe!\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "183768",
        "user_id": "47892",
        "content": "I added garlic and used this delicious salad as a filling for pita pockets! Use both fresh mint and fresh parsley from the garden, too! I wish I knew what indigo lentils are. They sound delish! Thanks for sharing! cg ;)\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "183768",
        "user_id": "452355",
        "content": "This was a flavorful, easy to make salad. We served as a side to Dolmathes. I had to use shallot in place of red onions, because I was out. We easily halved the recipe ingredients to make a smaller amount. Made for Sun and Spice 2013\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "455488",
        "user_id": "2000254857",
        "content": "AMAZING!!!! Licked the bowl clean!\n ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "455488",
        "user_id": "266635",
        "content": "Fantastic Hummus recipe -- the best I have tried to date! I doubled the recipe and served it with recipe#427044 (equally delicious). This will be my new \"go to\" recipe when I want a healthy, delicious appetizer or snack. Thanks for posting this great recipe. Made for Everyday is a Food Holiday tag, October, 2011.\nSee More  ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "455488",
        "user_id": "573325",
        "content": "Wow, this really is a very tasty hummus! I liked it a lot. It had just the right amount of cumin and tanf from the yoghurt. Next time I would use a bit less garlic but thats just personal prefernce I guess. I reduced the oil a tad cause I like it when my hummus is a bit sturdier instead of super creamy. Its amazing how versatile this recipe is because of the various topping options. This time I used olives and cayenne pepper on top. Mmm! :)<br/>THANK YOU SO MUCH for sharing this keeper with us, Gail Ann!<br/>Made and reviewed for Aussie/NZ Recipe Swap #54 July 2011.\nSee More  ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "455488",
        "user_id": "37449",
        "content": "I really enjoyed this with chips. It's the first time my DS has tried hummuus and he couldn't get enough and has asked me to make more. I was stumped as I had no yogurt or sour cream so subbed mayonnaise. It worked just fine. Thanks! Made for PRMR game.\nSee More  ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "455488",
        "user_id": "2001959293",
        "content": "This is much better than Zea's hummus! Best recipe that I have used. Fry up some flour tortillas for dipping. Cut into quarters, fry for about 1 1/2 minuets, better that bagged chips.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "82509",
        "user_id": "2002929101",
        "content": "keto friendly ?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 2,
        "food_id": "82509",
        "user_id": "2002786745",
        "content": "Why do you put a potato that you shred into the recipe.? Is it to give it an added creaminess?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 3,
        "food_id": "82509",
        "user_id": "278639",
        "content": "I read recipes for Lentil Soup all day looking for just the right one to take to a Soup Luncheon ..... then I found this one and it was perfect. I used a pound package of lentils and it made a huge pot. Very tasty!! Thanks for posting.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "82509",
        "user_id": "445442",
        "content": "This was delicious! My fiance (the vegetarian) and I (the carnivore) loved it - it was earthy, substantial and flavourful! We made a few tiny adjustments - we used a handful of brown rice instead of the potato, and after the 10 hours of cooking, we added an extra 2 cups or so of broth, and almost double the lemon juice, as well as freshly cracked black pepper. We then cooked it on low for 15 minutes, then on high for another 20-30.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "82509",
        "user_id": "109855",
        "content": "Loved this stuff. Very easy to throw in the crockpot, wonderful flavors. I love healthy recipes and especially soup that I can take to work. I will definitely make this again - many times! Thanks for posting/ Barb\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "82509",
        "user_id": "445442",
        "content": "This was delicious! My fiance (the vegetarian) and I (the carnivore) loved it - it was earthy, substantial and flavourful! We made a few tiny adjustments - we used a handful of brown rice instead of the potato, and after the 10 hours of cooking, we added an extra 2 cups or so of broth, and almost double the lemon juice, as well as freshly cracked black pepper. We then cooked it on low for 15 minutes, then on high for another 20-30.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "182935",
        "user_id": "498271",
        "content": "These shrimp were delicious!! So quick and easy to make and just loved the garlic chips! Didn't serve it over anything, just ate 'em as they were. Wonderful dish - thanks for posting!\n ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "182935",
        "user_id": "11176",
        "content": "Mmm! I used 4 cloves of garlic to 3/4 lb shrimp (it's the Italian in me), cut back on the red pepper and served it over ramen noodles for a quick, pressed-for-time dinner. Honestly, I could eat those garlic chips all day, every day, but then I suppose I'd lose friends quickly. ;o) Thank you for posting this delicious and fast feast, Recipe Reader!\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "182935",
        "user_id": "338451",
        "content": "awesome.....my only change would be MORE GARLIC!\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "182935",
        "user_id": "37636",
        "content": "Quick, tasty, and oh so easy! Can I say any more? Everyone loved this, especially the combination of rosemary with garlic, which is a favorite in our house! Thanks for posting- ~Sue\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "182935",
        "user_id": "182010",
        "content": "Delicious! We all loved the garlic chips. The shrimp were perfectly done, the rosemary just right. Served over linguini with some lemon olive oil.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "244722",
        "user_id": "33186",
        "content": "Congrats! Your recipe is featured on our homepage today as the \"Recipe of the Day\" ! (07/29/11)\n ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "244722",
        "user_id": "2002398687",
        "content": "Great recipe! Will be a go-to for us. I gave it 4 stars instead of 5 for one reason. Spraying a non-stick pan with cooking spray will cause the non-stick surface to lose its non-stick properties. If the pan is non-stick, it shouldn't be necessary.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "244722",
        "user_id": "900992",
        "content": "What a delicious recipe! I love the flavors - they do overpower the flavor of the fish a bit, but it doesn't matter because they are so GOOD!!! This is definitely a keeper. We used a little bit of leftover minced red onion instead of a shallot. It was great.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "244722",
        "user_id": "644307",
        "content": "I liked the salsa but think it would be better on chicken-probably won't make this again. There are much better cod recipes here with less prep.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "244722",
        "user_id": "133174",
        "content": "A delicious and healthy way to serve cod. After getting into the recipes I discovered that I did not have capers so had to leave them out. Also, I used minced red onion in place of the shallots. Even with my subs and omissions this is wonderful. Something I will repeat in the future.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "244722",
        "user_id": "452355",
        "content": "We loved this recipe! 5 stars all the way! I substituted sea bass for the cod because that is what I had on hand. Also, I grilled the fish on the BBQ instead of cooking it on the stovetop. That is the beauty of this recipe--because the salsa goes on top of the fish after it is cooked, you really can prepare the fish any way you like. I highly recommend grilling it. The salsa had excellent flavor. This is definitely a recipe that I will be making again. Made for ZWT4.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "220025",
        "user_id": "452355",
        "content": "We liked this chicken salad. DH actually liked it better the next day when he took it for lunch after the flavors had awhile to meld more. This was very easy to prepare as well. We grilled some extra chicken (when making another grilled chicken recipe) to use in this salad, which worked well. I made no modifications to the ingredients. Thanks!\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "220025",
        "user_id": "679953",
        "content": "MamaJ this is one tasty salad . We did halve the recipe for fear our kids would not like. None the less, We have to agree with Toni, the tarragon, lemon, and mustard combo was great. Unbelievable flavors, with great taste. Very enjoyable. Made for PRMR tag.,\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "220025",
        "user_id": "305531",
        "content": "Wonderful salad! I used some leftover chicken, made as directed otherwise, except that I halved the recipe for 2 of us. Very simple and very tasty. I love tarragon and the combination of the tarragon vinegar, the marinated artichokes, capers and currants was really a great combo. Thanks Mamma J. Made for ZWT4.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "220025",
        "user_id": "67656",
        "content": "This was so easy to prepare and simply delicious. Looking to make this a little lighter in calories, I only used 2 tablespoons of olive oil and 4 tablespoons of fat free chicken broth. The tarragon, lemon and mustard blended just beautifully and elevated the components of the salad. Thanks!\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "220025",
        "user_id": "21752",
        "content": "To echo Chef echo echo (LOL), loved this, loved this! I used craisins instead of the dried currants, and added a handful of chopped coriander. We served this up with pita and hummous and techina and it was a wonderful lunch on a hot summer's day.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "220025",
        "user_id": "21752",
        "content": "To echo Chef echo echo (LOL), loved this, loved this! I used craisins instead of the dried currants, and added a handful of chopped coriander. We served this up with pita and hummous and techina and it was a wonderful lunch on a hot summer's day.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 7,
        "food_id": "220025",
        "user_id": "121690",
        "content": "Love this, love this! Chicken with tarragon is always a favorite of mine. I used yellow raisins instead of the currants. I do think that next time I might leave out the orzo--it was fine, but didn't really add anything much for me. That way it would be good stuffed into a pita, I think.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "131972",
        "user_id": "2002470084",
        "content": "Since you're not using mayonnaise, could you use tuna packed in oil so it's hopefully not dry?\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 2,
        "food_id": "131972",
        "user_id": "386585",
        "content": "This was fantastic and really hit the spot! I had some beautiful ripe garden tomatoes, which were perfect in this dish. I also added some minced kalamata olives, which is the only change I made. What a wonderful lunch I enjoyed! I wished I'd taken a photo, but I ate it too fast! Made for Culinary Quest 2016.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "131972",
        "user_id": "80353",
        "content": "Made a 1/2 recipe of this and cut each tomato in half so we each got a half with Recipe #428353 for lunch. Really good, bright flavours here. I especially enjoyed the addition of pistachios here. Thanks.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "131972",
        "user_id": "305531",
        "content": "Yum! This was great. I've never had a tuna salad before that didn't have mayo so this was a refreshing contrast. After reading the previous reviews, I added a few more pistachios that I really enjoyed. Since I halved the recipe the ingredients were too few to reach the blade in my mini processor, lol, so I just manually crushed them a bit. Thanks Susie for a nice treat. Made by an Unruly Under the Influence for ZWT6.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "131972",
        "user_id": "207616",
        "content": "mmmm....I loved it especially since it has some of my favorite ingredients in it. I didn't have pistachios nuts though :(. Made for ZWT4.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "131972",
        "user_id": "5060",
        "content": "Delish Susie!! DH loved them as did I. Served them with your recipe #98849, a lovely match! I just made half a recipe for the two of us and used walnuts as that is what I had. It was a lovely cool supper and i will be making them again, thanks for posting!\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "323422",
        "user_id": "2851666",
        "content": "This corn salad was heavenly! The only thing I added was pitted kalamata olives. I also decided to throw in the feta just before serving rather than letting it marinate with everything overnight. Such a great side dish (but I can easily see myself eating a whole bowl of this as a meal, lol)! I featured this recipe in my blog - http://danasfoodblog.com/?p=970.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "323422",
        "user_id": "239758",
        "content": "Fabulous salad and a great way to use up leftover corn. I cut the kernels off three large cobs that I boiled yesterday. That gave me more than a pound of corn, so I used 2 tablespoons of oil and 3 of red wine vinegar. Also used a little extra feta and about 2/3 of a large red onion, finely chopped. Added lots of basil (don't forget the basil)! Thanks very much for posting. This is going straight in my 100-star cookbook.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "323422",
        "user_id": "383346",
        "content": "This salad is so good and the basil really adds ton of flavor. The corn and chickpeas are great together. That's a great filling lunch. I used fresh red bell pepper. Thanks JanuaryBride :) Made for ZWT8 for Diners, Winers and Chives\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "323422",
        "user_id": "869184",
        "content": "This was a nice and fresh salad. I opted for fresh orange and green bell peppers, and added chives and parsley for the herb part. I also doubled the vinegar as other reviewers have suggested but I felt that something was missing, or that perhaps the chick peas were a bit out of place in the salad. Perhaps some lemon or lime juice would pick up the flavours as well. Made by Bistro Babes, for ZWT 8\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "323422",
        "user_id": "2193767",
        "content": "I used the basic recipe as a springboard, and made these changes:<br/>1. Cooked corn from 3 cobs instead of using frozen<br/>2. Included roasted red pepper, marinated artichoke hearts, and sun dried tomatoes<br/>3. Instead of red wine vinegar, I used Pesto sauce. <br/><br/>The salad was a little green due to the Pesto, but the taste was awesome. Will definitely make this repeatedly.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "323422",
        "user_id": "2193767",
        "content": "I used the basic recipe as a springboard, and made these changes:<br/>1. Cooked corn from 3 cobs instead of using frozen<br/>2. Included roasted red pepper, marinated artichoke hearts, and sun dried tomatoes<br/>3. Instead of red wine vinegar, I used Pesto sauce. <br/><br/>The salad was a little green due to the Pesto, but the taste was awesome. Will definitely make this repeatedly.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "221237",
        "user_id": "199848",
        "content": "Fantastic salad. The chickpeas make it filling enough to be a complete meal. I made this according to the recipe and included the optional capers and added some sliced onion. Simple but great. Thanx!\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "221237",
        "user_id": "80353",
        "content": "Just the kind of salad my whole family enjoys eating! I had boiled up a batch of chickpeas and cannelini beans to make hummous and used equal amounts of each of those. All the veggies were great - each bite was delightful and different, and the dressing was fabulous. Thanks.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "221237",
        "user_id": "953275",
        "content": "This was a huge hit, and as it was so quick to make too that made it a hit all round. I made half the batch, exactly as written (ok, yellow pepper instead of red...), and I had a tin of mixed beans instead of just chickpeas. My daughter nearly finished off the entire batch. I imagine cutting the oil back would be equally good, but as is was nice and rich and I liked that the vinegar didn't overpower the dressing. Thanks Dreamer, I'm sure I'll make this again again and again.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "221237",
        "user_id": "56003",
        "content": "Loved this salad! The flavors complemented each other very well. I used some giant garlic stuffed green olives and extra capers. I could eat this every week! Thnx for sharing, Dreamer. Made for KcK's Forum.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "221237",
        "user_id": "386585",
        "content": "OMG - this is delicious!!! It makes a super lunch to pack and is very portable. I made it exactly as written, except I did not use stuffed green olives, but a olive combination that included green, kalamata, etc. and I increased the olives to a full cup (because I love olives). I also did not julienne the peppers, but chopped them instead. Anyway...this was delightful and will be made regularly. Thanks for posting. Made for All New Zaar Cookbooks Tag Game.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "221237",
        "user_id": "953275",
        "content": "This was a huge hit, and as it was so quick to make too that made it a hit all round. I made half the batch, exactly as written (ok, yellow pepper instead of red...), and I had a tin of mixed beans instead of just chickpeas. My daughter nearly finished off the entire batch. I imagine cutting the oil back would be equally good, but as is was nice and rich and I liked that the vinegar didn't overpower the dressing. Thanks Dreamer, I'm sure I'll make this again again and again.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "8892",
        "user_id": "14613",
        "content": "this was pretty good. i prefer sauteing the spinach in oil and not water. good with goat cheese instead of feta.\n ",
        "likes": "6",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "8892",
        "user_id": "36777",
        "content": "Found this to be superb & authentic. Reminded me of the foods we ate while touring Italy and Greece. Thank you for sharing.\n ",
        "likes": "5",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "8892",
        "user_id": "486725",
        "content": "I did alter this a bit, but we loved it that way. I looked at the other reviews and decided to add oil and lemon. I also barely wilted the spinach (and added much less, because of it), used more fresh dill and capers, and added potatoes, to make a meal out of it. The capers, dill, potatoes and feta went so well together in this. As another reviewer mentioned, it makes a delicious base to potentially add things to (like beans, potatoes, etc.).\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "8892",
        "user_id": "470351",
        "content": "Very tasty spinach dish! I loved the combo of flavors and was surprised at someone's comment that the dill made it awful. I used fresh dill and barely noticed it in this dish. I sauteed the onions, garlic and dill with a bit of olive oil...then also tossed in the tomatoes for a minute before removing all from heat. I loved the low fat method of cooking the spinach with water. I tried it and loved it. The pairing of capers and feta with this was also really great. I will definitely make this one again.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "8892",
        "user_id": "593513",
        "content": "Oh My, this was really tasty. Was just looking for something to do with my leftover spinach and thought I would try this. Really glad I did. I sauteed the onions garlic and dill in some oil. Used Campanari (cherry) tomatoes because those are the only ones I find have any real flavor here in this City. After the onions and garlic were done sauteing I threw the tomatoes in for about 30 seconds. Sauteed the spinach in a little olive oil and not water. I really found this a delicious quick salad to put together. Didn't come anywhere near 25 minutes to cook though. And so colorful when put together. Thanks so much for posting Mary. Loved it.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "8892",
        "user_id": "276108",
        "content": "SUPER! My husband and I both loved this. I did make a couple of minor changes, I used a large can of spinach instead of fresh and used cherry tomatoes (they are the only ones with flavor now) which I stirred into the spinach mixture just before removing from the heat. The dill gave it a hit of tartness similar to the splash of vinegar we normally add to spinach. Thanks so much for a new favorite!\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 7,
        "food_id": "8892",
        "user_id": "184530",
        "content": "This was exceptionally tasty, and very easy to prepare. I used 600 grams of baby spinach leaves, dried dill, and everything else as listed. I cooked the onions for a few minutes, added the tomatoes and cooked them for a few minutes, then added the spinach to the same pan. I also used olive oil in place of the water. Will make again!\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 8,
        "food_id": "8892",
        "user_id": "15892",
        "content": "I doubled the garlic and only had on hand about half the spinach. I, too, used olive oil, and would consider trying it with chicken broth instead of the water. I don't like dill, but I stuck to it and used my dried. I also added a breath of red pepper flakes just before step five, added a splash of lemon at the end of step 7 and I DIDN'T discard the liquid. Very tasty. I had it with some leftover swordfish that I flaked and stirred throughout. This would also be nice over rice or pasta, or with some canned garbanzo or white beans thrown in. The feta was the perfect touch. Would also be nice with fresh shredded parmesan, pine nuts or some cumin. What a nice base! Thanks, Mary! I can't wait to expand on this (or just keep it simple....)!\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 9,
        "food_id": "8892",
        "user_id": "14613",
        "content": "this was pretty good. i prefer sauteing the spinach in oil and not water. good with goat cheese instead of feta.\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "317056",
        "user_id": "204024",
        "content": "This is a great combination. I cut this in half and used basil as my italian seasoning. Made for ZWT6 for the Voracious Vagabonds\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "317056",
        "user_id": "61660",
        "content": "I thought the salsa was totally awesome!! Loved all the flavors and the feta added just the right kick to make it a little different from other salsas. Lovely!! The hummus was good, but I can't say I could find any noticeable difference with the addition of the sour cream. Served with garlic pita chips!\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "317056",
        "user_id": "779699",
        "content": "Sooo easy and yummy! I doubled the recipe and I only got a little taste as I sent this with DH and his friends for their annual \"guy's weekend\" at the lake! There was none left after the first night according to DH! I sent stacy's pita chips and they loved it! Thanks for posting! Made for The Queens of Quisine ZWT6 Zingo!\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "317056",
        "user_id": "428885",
        "content": "This was a delightful duo from my teammate! I agree with other reviewers, the feta part of the salsa was a huge hit, nice and salty, mixing with the onion, garlic, and Italian seasoning you simply cannot go wrong. The hummus was great too, I didn't realize you could make a creamer version by just adding sour cream!! This is totally delish and served with homemade pita chips! Made for ZWT6 2010\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "317056",
        "user_id": "1637137",
        "content": "I tried the Salsa dip only and found it to be excellent! I was surprised at how the simple ingredients meshed well together. This would also be good on crostini if pita chips are not available\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "179813",
        "user_id": "333017",
        "content": "My DD got into an Edamame kick a while ago, so I was buying them in packages at Costco. Well, she stopped eating them...for whatever reason and didn't tell me, so I had a freezer full of beans. If the recipe turned out the way I was hoping it would, I would use it for our rehersal dinner for when my second DD gets married. We loved it! The salad had the crunch from the beans, sweetness from the tomatoes and salt from the cheese and olives!! I am not a big fan of oil floating around my foods (in fact, it turns me off totally!!) so I did make some changes. I had made a garlic infused oil (for another recipe) and had some of the oil and cooked garlic left over. I used some of the sun-dried tomato oil and the garlic infused oil and the left over garlic chips. I probably did not use even 1 T. It passed the \"bride has to try everything and see everything\" test and loved it!!! I dehydrate roma tomatoes when they come on sale... so next time, I will use half of my tomatoes and half of the oil infused tomatoes to use them up. If anybody else buys edamame at Costco, 3 cotainers equals just shy 2 cups. I have company coming in the next 2 weeks, so I think this recipe will get a good workout from me! Thanks Chef!!\nSee More  ",
        "likes": "3",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "179813",
        "user_id": "269829",
        "content": "I tried this recipe for a potluck and we loved it! (I tripled the recipe.) It is a very aromatic dish that scents the whole house. Mmm! The only changes made were: I snipped the sun-dried tomatoes into small bits and by the time I had added about 2/3 cup of them to the edamame it looked like more would overwhelm the salad, so I didn't triple the amount of sun-dried tomatoes, but sliced and added about a pound of fresh ripe cherry tomatoes, instead. I couldn't find feta cheese, so substituted goat cheese (I read that it's a healthier cheese, anyway, with less fat and less salt). For the dressing (step 2), I decided I would like my garlic pureed, so I mixed the dressing in the blender. I feel like I have too many vinegars already on hand, so used red wine vinegar instead of buying white. I couldn't find white balsamic vinegar, so substituted what I found, which was golden balsamic vinegar. I also had forgotten to buy fresh oregano, so substituted 1/3 as much dried oregano, and I used extra-virgin olive oil. I mixed the edamame, tomatoes, onions and olives, then added the dressing. I found I needed only half of the dressing, so have kept the rest of the dressing aside, in a container in the fridge. Next time I will reduce those ingredients by half. This helps make the recipe lower in fat, too. The cheese was added just before serving. On re-visiting the left-overs the day after, I have found that even if certain ingredients are left out, it still is terrific! My husband picks out the onion and I pick out the olives, but it's delicious even without those. Some of the salad was left without cheese because there were vegans at the potluck -- and it tastes delicious without the cheese, as well.\nSee More  ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "179813",
        "user_id": "2001650987",
        "content": "I used all the ingredients listed plus added an English cucumber quartered, some mini red, orange and yellow peppers chopped. I didn't have the white vinegars on hand so I replaced it with Wegman's balsamic vinaigrette dressing, It was delicious!! I will be making this again for sure! I did omit the garlic and the fresh oregano, because there was garlic in the dressing and I was out of fresh oregano. I think fresh basil would be delightful in it too, or maybe even a little mint! I have a wonderful cayenne pepper olive oil I will use next time, and probably stick with a balsamic vinegar as well.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "179813",
        "user_id": "414452",
        "content": "This is just EXCELLENT! The flavors are fantastic. I used kalamata olives, (I would recommend you NOT use the canned black olives). I omitted the feta as I am not a fan. Double the batch as you will want more.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "179813",
        "user_id": "266635",
        "content": "Delish!! This salad was fantastic and the presentation is so colorful. Great on flavor and a great dish to wow your guests. This salad could not go wrong as it has everything I love in it. I will definitely make this dish again and again!!!! Thanks for the post.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "179813",
        "user_id": "269829",
        "content": "I tried this recipe for a potluck and we loved it! (I tripled the recipe.) It is a very aromatic dish that scents the whole house. Mmm! The only changes made were: I snipped the sun-dried tomatoes into small bits and by the time I had added about 2/3 cup of them to the edamame it looked like more would overwhelm the salad, so I didn't triple the amount of sun-dried tomatoes, but sliced and added about a pound of fresh ripe cherry tomatoes, instead. I couldn't find feta cheese, so substituted goat cheese (I read that it's a healthier cheese, anyway, with less fat and less salt). For the dressing (step 2), I decided I would like my garlic pureed, so I mixed the dressing in the blender. I feel like I have too many vinegars already on hand, so used red wine vinegar instead of buying white. I couldn't find white balsamic vinegar, so substituted what I found, which was golden balsamic vinegar. I also had forgotten to buy fresh oregano, so substituted 1/3 as much dried oregano, and I used extra-virgin olive oil. I mixed the edamame, tomatoes, onions and olives, then added the dressing. I found I needed only half of the dressing, so have kept the rest of the dressing aside, in a container in the fridge. Next time I will reduce those ingredients by half. This helps make the recipe lower in fat, too. The cheese was added just before serving. On re-visiting the left-overs the day after, I have found that even if certain ingredients are left out, it still is terrific! My husband picks out the onion and I pick out the olives, but it's delicious even without those. Some of the salad was left without cheese because there were vegans at the potluck -- and it tastes delicious without the cheese, as well.\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 7,
        "food_id": "179813",
        "user_id": "11176",
        "content": "Very tasty! I omitted the sun-dried tomatoes for our tastebuds, subbed white onions for red, regular balsamic for white and kalamata for black olives, but it turned out very nice and something I'll definitely make again. Thank you, Chef #338124!\nSee More  ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "7968",
        "user_id": "4399",
        "content": "I found this recipe to be very good, but only gave it four stars as it called for (in my opinion) way too much celery and onions. I cut the onions back to 1/2 cup and the celery to 1 cup. I also added 1/3 cup grated carrots. My husband loved it!\n ",
        "likes": "10",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "7968",
        "user_id": "2041603",
        "content": "I've had this with the lemon juice and without as well as with chicken and with beef broth. Each time tasted great. It does take a little bit of time to cut up the onion, potato and carrot but it's worth it. Great soup.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "7968",
        "user_id": "1223517",
        "content": "Love this soup. First time i made this with homemade veg and chicken stock and 2nd time just homemade veg stock with a chicken stock cube. The first method seemed better\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "7968",
        "user_id": "55589",
        "content": "This bean soup has become a staple in my house. And it's proof that a bean soup does NOT need pork or bacon in it to be delicious. The only thing I do differently is add an extra potato for more thickness. Great recipe!\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "7968",
        "user_id": "965764",
        "content": "Super tasty! And pretty easy to make too. I only had one can of cannelini beans on hand, so I improvised a bit. Reduced the amount of stock used in each of the steps (but used close to 3 cups total). Forgot the lemon juice and it still was delicious! Increased the rosemary since it's my favorite herb. Thanks so much for sharing...I know this will be in the regular rotation as we come into fall/winter.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "243354",
        "user_id": "593513",
        "content": "Oh my Lord !!! This was such a yummy salad and a such a fantastic dressing to go with it. Did everything as written but I did cut way back on the oil though and added extra capers....I love them. We found it had a lovely blend of the lemon and vinegar. It was actually a very quick salad to put together. I served it as a side to some manicotti's . I can see just eating a whole plate of just the salad and forget anything else. Will be making this salad often...Thanks so much for sharing Vicki.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "243354",
        "user_id": "239758",
        "content": "The salad mixture was very nice, but I prefer a dressing with more tang and less oil. Loved the capers though. I would add 1/4 teaspoon salt and use castor sugar in place of honey (or leave sweetener out completely). The honey taste was quite strong, but perhaps it was just my variety of honey. Thanks for posting.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "243354",
        "user_id": "56003",
        "content": "This was just straight out delicious! Everything I like, and still pretty good for me! Thnx for sharing it, Vicki. Made for a fellow Vagabond during ZWT 6.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "243354",
        "user_id": "246482",
        "content": "This is a keeper, Just love the dressing Made for ZWT4 for the Chic Chefs. Ps I finally gotto use the bottle of capers I bought months ago.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "243354",
        "user_id": "251917",
        "content": "ZWT4: OUTSTANDING!! The lemon caper vinaigrette definitely pulls this dish together - WOW!!\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "84978",
        "user_id": "593513",
        "content": "This was such a flavorful salad. I made it according to the recipe except I cut the recipe in half and didn't use green peppers only because my friend doesn't like the green ones. Made this early in the morning to bring for lunch then added the avocado at lunchtime. The flavor of the balsamic dressing was really good with this salad. I had put the Za'aar seasoning,salt and pepper in with the oil and balsamic to mix all together then blended it in with the salad. So yummy and will be making this again. Made with Shish Taouk Recipe #66035 Thanks so much for sharing your recipe Sackville..We loved it and I will be making this again.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "84978",
        "user_id": "545825",
        "content": "I've had this in my cookbook for ages, but never made it because I didn't have Zatar seasoning. I finally found some though and made this salad. We really enjoyed it. Colorful, healthy, flavorful and easy!! As with every recipe I make that has a \"add ______ just before serving,\" I forgot to add the avocado! I did prepare this a couple hours ahead of time adding everything but the avocado. It smelled wonderful!! I also ended up roughly dicing the peppers after sauteing them. I just wanted everything to be about the same size. Thanks for posting this, I'll be making this one frequently.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "84978",
        "user_id": "168282",
        "content": "This is really, really good stuff. I mean really good! I didn't have the spice, so I used 1 tsp marjoram and thyme, 1 tbsp sesame. I also replaced the avocado with an english cucumber. Absolutely wonderful. Served with spinach pie.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "84978",
        "user_id": "117438",
        "content": "Oh Friedel, we really enjoyed this as a main dish salad. I cooked up all the capsicum and let it sit with the other ingredients until we were ready. The contrast of textures, colours, made it truly wonderful. Thanks again for sending the za'atar, I'll have to work on the substitute now because this is a definite make again. I too forgot the parsley, but it was still so flavoursome without. Next time I will add more artichokes as I accidentally bought too small a jar!\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "84978",
        "user_id": "37636",
        "content": "This is an outstanding salad that is rich and full of exciting flavors that make a superb accompaniment to a Middle Eastern or mediterranean type meal. I served this with Chicken ala Turk, recipe 74351, and used this as a side salad. I think the ingredients could easily be adjusted to taste among the artichokes, peppers, chickpeas, and avocado. Roasted chicken would also be an interesting addition to this, I think, to make this a main dish salad. You might just need to add a little bit more dressing. I realized after the dinner was over that I had forgotten to add the parsley to this, and that would have added yet another dimension of flavor to an already fantastic salad, although it tasted great as it was. I am definitely going to be making this again! Thanks, SG!\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "84978",
        "user_id": "168282",
        "content": "This is really, really good stuff. I mean really good! I didn't have the spice, so I used 1 tsp marjoram and thyme, 1 tbsp sesame. I also replaced the avocado with an english cucumber. Absolutely wonderful. Served with spinach pie.\n ",
        "likes": "0",
        "type": "tweak"
    },
    {
        "post_id": 1,
        "food_id": "290384",
        "user_id": "133174",
        "content": "This was reduced to 2 servings and cooked in a 6-inch skillet. Made a lovely brunch for DH and me. By flipping this onto a plate and sliding it back into the pan, it was cooked entirely on top of the stove.\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "290384",
        "user_id": "2000407935",
        "content": "This frittata has a great combination of flavors. Use the basic instructions to devise your own combinations. Saute the veggies, whisk up the eggs and spices, fry to set, broil to finish. I use a frittata to use up bits of leftover veggies and meats. Let your imagination take over! Mexican with Pico de Gallo and cumin, Italian with tomatoes and basil, American with hot dogs and cheddar.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "290384",
        "user_id": "498271",
        "content": "What a delightful meal! I used a little less oil, otherwise made as directed. Absolutely loved all that fresh basil with all those veggies and the feta. Easy to make and full of flavor - thanks for sharing a keeper!\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "290384",
        "user_id": "546010",
        "content": "This is amazing. The flavor is perfect. I didn't tweak it, whatsoever. That has got to be a first! This will be in our rotation of meatless EGGSiting dinner dishes. The timing was spot on as well. Just perfect.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "290384",
        "user_id": "222478",
        "content": "Tasty! Beautiful combination of flavours and it was much enjoyed as a light dinner. I thought the quantity of olive oil may have been a little too much at first but using a good quality one it really added to the dish and kept it all nice and moist.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "304676",
        "user_id": "2002305701",
        "content": "Could you use salmon instead of mahi mahi?\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "304676",
        "user_id": "452355",
        "content": "This was a great dinner. It was a little labor intensive, but well worth the end result and all the wonderful flavors. I used fresh herbs from my garden and kalamata olives. We did not modify this recipe a bit, nor would we recommend any changes. Thanks for a lovely meal and one that we will be making again.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "304676",
        "user_id": "942099",
        "content": "my boyfriend really loved this. he's not too big of an olive person but this really worked well for him.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "304676",
        "user_id": "940393",
        "content": "Quite tasty and good for a change of pace. In a pinch dry substitutions will work but of course compromise the fresh taste.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "304676",
        "user_id": "866232",
        "content": "Very tasty, fresh, and high end-tasting. My wife said it may have been the best meal I ever made--and I have made many good ones. Thanks for sharing this impressive recipe. P.S. - Prep time for me was much longer than 20 minutes maybe because of all the gathering, washing and chopping--maybe 50-60 minutes total.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "214004",
        "user_id": "2002417202",
        "content": "How long can this dip be made ahead of time??\n ",
        "likes": "0",
        "type": "question"
    },
    {
        "post_id": 2,
        "food_id": "214004",
        "user_id": "900992",
        "content": "This is delicious! We had to make some changes because we ran out of some things. We used 1/4 c. half-and-half instead of 1/2 c. milk because we discovered that our milk was bad when we got ready to measure it. Also, we only had about 2/3 c. feta cheese left, so we put all of that in. I'm actually glad that's all we used because I think I would have found the feta flavor overpowering had we used the specified amount. Lastly, rather than roasting the red pepper and using it for garnish, I roasted it and just threw it into the food processor with the rest of the ingredients. Next time, I might cut back on the hot sauce. I like the heat it imparts, but the flavor is too prominent. I also think that I will throw the kalamata olives in with the rest of it next time, rather than using them for garnish.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "214004",
        "user_id": "220348",
        "content": "This is a creamy and smooth dip that everyone should try! It is also very refreshing, and made me think of summer, so I'll try again, then. The hot sauce made the dip a bit tangy as opposed to hot, but I kind of liked it that way. Veey good with pita bread.\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "214004",
        "user_id": "880889",
        "content": "This recipe is a keeper! I had grown tired of hummus over the summer and was looking for something a little different. This was it! It is not really hot/spicy with the hot sauce, but well seasoned and the flavors really blend well together. A snap to make. Served with pita chips and cucumbers. I used low fat feta and it did not seem to affect the outcome. You'll get raves with this one!\nSee More  ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "214004",
        "user_id": "239758",
        "content": "Wonderful dip that has a nice little kick to it. I used a little less milk because I added the moist roasted red pepper to the main dip mix. Served at work for Friday night drinks with cucumber slices, celery sticks and bread.\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 6,
        "food_id": "214004",
        "user_id": "945248",
        "content": "Wow... This was good! We used Syrian bread wedges to scoop it up!\n ",
        "likes": "0",
        "type": "review"
    },
    {
        "post_id": 1,
        "food_id": "70005",
        "user_id": "11176",
        "content": "Without knowing how many tomatoes to use, I settled on 7 medium-sized beauties. The end result was a tad over-seasoned; I think about 10-11 tomatoes of this size would have been perfect for me. I baked them for 6 hours and they were still a little wet to the touch, so I put them in the dehydrator overnight on a low setting and they came out nice. I had them in a pasta and prosciutto with arugula pesto last night and we both had seconds. Oh, the aroma... ~*inhales deeply*~ YUM! :) Thanks for the lovely recipe!\nSee More  ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 2,
        "food_id": "70005",
        "user_id": "56181",
        "content": "These were very easy to make and very tasty! It doesn't say how many tomatoes to use, but I used about 5. I also didn't have the fresh spices on hand so I used about 1 tsp of garlic salt, 1 tsp basil, and 1 tsp of oregano, put them together in a ziploc baggie and ran my rolling pin over it a few times to make the spices extra fine. Anyway, this was a great way to use up some extra tomatoes and I will definitely make again!\nSee More  ",
        "likes": "2",
        "type": "review"
    },
    {
        "post_id": 3,
        "food_id": "70005",
        "user_id": "2001112113",
        "content": "I didn't know you could make \"sun-dried\" tomatoes at home. They were so easy to make. Perfect in pastas!\n ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 4,
        "food_id": "70005",
        "user_id": "1666717",
        "content": "This was a vary easy recipe. I used three different types of cherry tomatoes (yellow pear, sun sugar, and red cherry) and a food dehydrator instead of the oven they took about 12 hours to dry. They turned out awesome and we ended up doing about 2 gallons of tomatoes.\nSee More  ",
        "likes": "1",
        "type": "review"
    },
    {
        "post_id": 5,
        "food_id": "70005",
        "user_id": "231057",
        "content": "Another great review for a great recipe! I put all the \"cleaned\" tomato pieces in a big bowl and drizzled with the olive oil and seasonings, then laid them out on the foil lined cookie sheet (quicker for me). Loved the aroma in the house while these were baking and they are so good. Put the pieces in small baggies for the freezer for future use also. (This is an experiment on my part - I have never frozen sun dried tomatoes.) Thanks for the wonderful recipe!\nSee More  ",
        "likes": "1",
        "type": "review"
    }
]