[
    {
        "tweak_and_question_id": "question_178249_1",
        "food_id": "178249",
        "user_id": "2003135967",
        "content": "Can kalamata olives be substituted for the green olives?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_178249_2",
        "food_id": "178249",
        "user_id": "2001693157",
        "content": "Can kalamata olives be substituted for the green olives?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_178249_3",
        "food_id": "178249",
        "user_id": "2002470084",
        "content": "I know it would be delicious, but must the chicken be grilled? Can it be baked in the oven?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_178249_4",
        "food_id": "178249",
        "user_id": "2002091378",
        "content": "How many calories sodium and carbs in this meal\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_178249_1",
        "food_id": "178249",
        "user_id": "2003135967",
        "content": "I bought a very cheap roast and stabbed it all over with a fork (just to make sure that it was dead).\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_178249_2",
        "food_id": "178249",
        "user_id": "239767",
        "content": "DH and I made this for dinner last night and our only complaint was that we ate too much becuase it was so good! Only change I made was used garlic powder instead of roasted garlic in the tapenade as we were short on time. Thank you for posting.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_178249_3",
        "food_id": "178249",
        "user_id": "481092",
        "content": "Excellent! Perfect summer dish with the easy to grill chicken and the cool topping. I just used lemon pepper on the chicken instead of juice and peel. Very good. Thanks for posting.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_178249_4",
        "food_id": "178249",
        "user_id": "415934",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_178249_5",
        "food_id": "178249",
        "user_id": "402698",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_178249_6",
        "food_id": "178249",
        "user_id": "743849",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_293197_1",
        "food_id": "293197",
        "user_id": "2002480485",
        "content": "What can the falafel be served with?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_293197_1",
        "food_id": "293197",
        "user_id": "2001112113",
        "content": "I served them on top of some hummus with pita. So good!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_293197_2",
        "food_id": "293197",
        "user_id": "2001112113",
        "content": "I served them on top of some hummus with pita. So good!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_47961_1",
        "food_id": "47961",
        "user_id": "2002242767",
        "content": "For my next meal/leftovers, I added garlic powder, extra lemon juice, salt and pepper to taste, and lemon zest to add a little extra flavor. Those changes helped make it better but still not excellent.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_47961_2",
        "food_id": "47961",
        "user_id": "167225",
        "content": "This is delicious; I've had the recipe for a while and made it several times (most recently for a 4th of July barbecue) and everyone who tries it is impressed. I really like the flavor of the mint. This time, I found there was too much dressing (I think this may be in part because I didn't use the full amount of cheese), so if your measurements are a bit loose, it might be a good idea to whisk those ingredients together and then add as needed. I've successfully used balsamic vinegar instead of lemon juice; it's a different flavor, but still very tasty.\nSee More  ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_47961_3",
        "food_id": "47961",
        "user_id": "2896724",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_47961_4",
        "food_id": "47961",
        "user_id": "530501",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_229948_1",
        "food_id": "229948",
        "user_id": "37449",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_158351_1",
        "food_id": "158351",
        "user_id": "2002044255",
        "content": "What is the bed the salmon is placed upon ?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_158351_1",
        "food_id": "158351",
        "user_id": "89831",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_537249_1",
        "food_id": "537249",
        "user_id": "2000407935",
        "content": "There are directions for making the vinaigrette but the ingredients for the vinaigrette are not listed. How much vinegar, orange juice, Dijon mustard, shallots, and garlic?\n ",
        "likes": "3"
    },
    {
        "tweak_and_question_id": "tweak_428004_1",
        "food_id": "428004",
        "user_id": "2001556102",
        "content": "I replaced Eggplant with courgettes and added cherry tomatoes 10 minutes before the end.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_428004_2",
        "food_id": "428004",
        "user_id": "148221",
        "content": "So easy and soooo good! I made a few changes; I used two large potatoes and 2 large zucchini in place of the eggplant, and I didn't have any chives so I bumped the basil up to 1 tsp in it's place. I cut my potatoes in smaller chunks to reduce the cooking time, and ended up cooking it 22 minutes, stirring it, then 10 minutes more and my veggies were all nice and soft. I also skipped the cooking spray part and coated my veggies in a large bowl with the oil and herbs. I was a little scared of 2 TBS of vinegar, but it wasn't a problem at all. I'm extremely excited about this because, to me, I felt like I was eating vegetarian hash but wasn't missing the meat a bit. Thanks so much!!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_428004_3",
        "food_id": "428004",
        "user_id": "815198",
        "content": "Love this recipe!! It tasted like I the vegetables were grilled, perfect for when it's not grilling season. I made this as is, except I chickened out on the eggplant and substituted mushrooms instead. We'll be making this again for sure, so maybe next time I'll try it out with the eggplant :)\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_428004_4",
        "food_id": "428004",
        "user_id": "128473",
        "content": "My dh & I really enjoyed this dish. It was the first time that we tried eggplant and we loved it. It was quick and easy to make, tender and crisp with a slightly sweet, yet savory flavor. I used white balsamic vinegar and green onions instead of chives, I also added a small sweet potato. Thank you starrynews for sharing a recipe that we will enjoy again and again.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_12684_1",
        "food_id": "12684",
        "user_id": "2002470084",
        "content": "Is there anything else you can substitute for the beans besides chickpeas? I'm not a bean fan but would like to have the protein.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_12684_1",
        "food_id": "12684",
        "user_id": "2001831916",
        "content": "This salad was so good, I used garbanzos instead of the kidney beans, and chopped kalamata olives instead of the pine nuts because the store was out, and a teaspoon of dried oregano because I think the original recipe calls for fresh, but it was perfect! I'd definitely serve it up with some grilled steak or chicken next time.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_12684_2",
        "food_id": "12684",
        "user_id": "539990",
        "content": "Everybody loved it! My daughter had a blast helping make it. We used chickpeas instead of kidney beans. Will make again, thanks!! :)\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_12684_3",
        "food_id": "12684",
        "user_id": "465460",
        "content": "we really enjoyed this, especially with the chickpeas instead of the kidney beans.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_12684_4",
        "food_id": "12684",
        "user_id": "3288",
        "content": "Nice tasting recipe! I fought my need to mess with the recipe and did as posted with the exception of using red beans instead of kidney beans - just what I had on hand. This was subtle, and I can't wait to see how the tastes meld overnight. Thanks for a great summer salad!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_12684_5",
        "food_id": "12684",
        "user_id": "145960",
        "content": "Very good. I made this ahead of time (8 hours or so) and it was great. I'm eating it today as leftovers. I used toasted slivered almonds instead of pine nuts. Next time I will add sliced kalamata olives. I think it would enhance the recipe alot.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_12684_6",
        "food_id": "12684",
        "user_id": "290107",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_299973_1",
        "food_id": "299973",
        "user_id": "13593",
        "content": "I do not hesitate to rate this recipe with five stars. This is so easy, refreshing, and healthy. I followed the directions as written, but did use yellow onion and Kosher salt instead of sweet onion and sea salt. I don't think it really changed the recipe. This is a nice cooling recipe that is great for summer and lunch boxes. Thank you for sharing.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_299973_2",
        "food_id": "299973",
        "user_id": "691407",
        "content": "I took this salad to a backyard BBQ this weekend as my side dish. It was served with burgers, brats, ribs, hot dogs, etc. The crowd loved it and finished it off. Very easy to make, literally chop everything and throw it into one bowl. I used feta cheese instead of mozzarella, and waited to add it until right before it was served. I also used table salt instead of sea salt, tasted great!!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_299973_3",
        "food_id": "299973",
        "user_id": "216999",
        "content": "Easy to prepare and delicious, this one is a keeper! I left out the parsley and basil and we do not care for them, and used fresh goat-milk feta instead of the mozzarella. Made for the Dining Daredevils for ZWT5.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_299973_4",
        "food_id": "299973",
        "user_id": "197023",
        "content": "A wonderfully delicious - and SO healthy - summer salad. I made this exactly to the recipe - except for using chives instead of the sweet onion and doubling the garlic (a matter of availability and personal taste preferences) and served it on a bed of baby spinach leaves. I'll be making this again during the summer months. Thank you for sharing another fabulous recipe, Brooke!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_299973_5",
        "food_id": "299973",
        "user_id": "89831",
        "content": "very good although it needed a few amount adjustments and fresh ground black pepper, I used green onions in place of the sweet onion as I have a huge crop in my garden, thanks for sharing Brooke!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_304166_1",
        "food_id": "304166",
        "user_id": "2001556398",
        "content": "I have a couple of quick questions I have never really dealt with english cucumbers. I've read about the differences. Can you use plain cucumbers instead? Does it significantly alter the taste of the sauce?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_304166_1",
        "food_id": "304166",
        "user_id": "2000165997",
        "content": "Don’t Salt the cucumber. Made this recipe per directions. Way too watery and way too salty. Grate the cucumber and squeeze in a towel to get the water out. Unless you’re feeding an army make 1/3 or 1/4 recipe. Don’t process the cucumber - just the other seasonings.\n ",
        "likes": "1"
    },
    {
        "tweak_and_question_id": "tweak_304166_2",
        "food_id": "304166",
        "user_id": "2895155",
        "content": "This was an okay sauce. I've made other versions of tzatziki sauce that I liked better. This one came out a little thinner than I would have liked. I think it's because the recipe has you blend the cucumber and spices before adding to the yogurt. In previous recipes I've tried, you just dice the cucumber and add the seasonings to the yogurt instead of blending it all up to make a puree. I probably won't be making this recipe again.\n ",
        "likes": "1"
    },
    {
        "tweak_and_question_id": "tweak_304166_3",
        "food_id": "304166",
        "user_id": "589761",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_536714_1",
        "food_id": "536714",
        "user_id": "505731",
        "content": "The last ingredient for the tabbouleh is listed as \" 1 other seeds or nuts\". What measurement is this \"1\" referring to? One Tablespoon, One Cup, ??\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_39195_1",
        "food_id": "39195",
        "user_id": "2002180508",
        "content": "chiffinade is strips, not finely chopped..like ribbons\n ",
        "likes": "2"
    },
    {
        "tweak_and_question_id": "tweak_382432_1",
        "food_id": "382432",
        "user_id": "2002912073",
        "content": "Red onion, bell peppers, and white cheddar instead of green onion, dill, and feta. Also cooked bulgur according to packaging. It was delicious!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_111865_1",
        "food_id": "111865",
        "user_id": "503845",
        "content": "The second time I made this I cheated and bought precut mixture of tomato, onion and jalapeno. Turned out great in half the time. I love bruschetta so this is my new go to item. Also used basil instead of oregano as I love basil.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_111865_2",
        "food_id": "111865",
        "user_id": "579298",
        "content": "Yum!! I even got my little brother (11) to eat this healthy treat :) I subbed red wine vinegar for balsamic. Delicious!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_220089_1",
        "food_id": "220089",
        "user_id": "2001935726",
        "content": "I may have missed it, but is there a list of the nutritional information (including calorie count)?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_220089_2",
        "food_id": "220089",
        "user_id": "2001844234",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_280466_1",
        "food_id": "280466",
        "user_id": "2000431901",
        "content": "Just needed some salt added. I also topped with fresh parsley.\n ",
        "likes": "1"
    },
    {
        "tweak_and_question_id": "tweak_280466_2",
        "food_id": "280466",
        "user_id": "679759",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_280466_3",
        "food_id": "280466",
        "user_id": "455010",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_280466_4",
        "food_id": "280466",
        "user_id": "339544",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_280466_5",
        "food_id": "280466",
        "user_id": "237533",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_280466_6",
        "food_id": "280466",
        "user_id": "173880",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_81419_1",
        "food_id": "81419",
        "user_id": "2002430634",
        "content": "In another minestrone recipe they use a borlotti bean. Is there another name for it ? Also your recipe is the best I've found so far. It's the oregano definitely. I add more pepper as well. Plus I'll only add the pasta needed and then freeze the soup. I can boil some pasta as needed in vegetable broth for more flavor. Thanks in advance for your expertise. ?????????? !!! I\nSee More  ",
        "likes": "2"
    },
    {
        "tweak_and_question_id": "question_81419_2",
        "food_id": "81419",
        "user_id": "2001468905",
        "content": "Should you drain the beans or add the entire can, undrained. Has anyone used chicken or vegetable broth instead of water?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_81419_1",
        "food_id": "81419",
        "user_id": "173976",
        "content": "I don't understand the excitement and rave reviews about this recipe. It's just a plain vegetable soup with too much zucchini and celery, and rather bland even with the addition of broth instead of water and extra spices.\n ",
        "likes": "1"
    },
    {
        "tweak_and_question_id": "tweak_81419_2",
        "food_id": "81419",
        "user_id": "2000767449",
        "content": "I made this for Christmas Eve dinner, and it was FABULOUS!!!! My husband loved it, and he's not a big fan of my cooking! ? That proves this recipe is the real deal. I did use vegetable broth instead of 3 cups of water, and put about 14 fresh spinach leaves in at the last minute. Will definitely make this many times in the future.\nSee More  ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_81419_3",
        "food_id": "81419",
        "user_id": "1802528797",
        "content": "Thank you Uncle Bill for this recipe. So simple and delicious! I was looking for a vegetarian version for minestrone soup. I used chicken stock instead of vegetable, because well I'm not a vegetarian and wanted the flavor of chicken stock. My husband and two small children ate this up with crusty french bread for dipping.\nSee More  ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_81419_4",
        "food_id": "81419",
        "user_id": "697352",
        "content": "Mmmmm! Delish! I used chicken broth instead of water and added the whole can of beans. I love this recipe. I will make again and again. Thanks!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_81419_5",
        "food_id": "81419",
        "user_id": "1997017",
        "content": "I cook this every three or four weeks, it's delicious. I use 1/2 a teaspoon of oregano instead of 1/4, a dash of Worcestershire and Tabasco sauces and a teaspoon of Vegeta. My boyfriend loves it for dinner with hot toast and butter. Yum!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_81419_6",
        "food_id": "81419",
        "user_id": "962427",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_81419_7",
        "food_id": "81419",
        "user_id": "30674",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_379639_1",
        "food_id": "379639",
        "user_id": "2001921429",
        "content": "Hi everyone, just wondering if this would still be good if kept in the fridge for 24hrs? Would like to prepare day before a party.\n ",
        "likes": "1"
    },
    {
        "tweak_and_question_id": "question_379639_2",
        "food_id": "379639",
        "user_id": "2001092295",
        "content": "Is Tabouli Gluten free?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_379639_1",
        "food_id": "379639",
        "user_id": "2032489",
        "content": "A most excellent recipe! I cut the recipe in half. No rice wine vinegar - used balsamic instead... and added cucumbers. It is the perfect balance of bulgar to parsley ratio. A few years ago,I needed a last minute dish to take to a gathering. Looking at what I had on hand and following a whim, I stumbled across a fantastic combo of mixing tabouli with a container of classic tuna salad (not mayonaisy) from Whole Foods. The flavors came together perfectly and it was a huge hit! The whole room wanted the \"recipe\". Since then, when I make tabouli, I often add a can of Albacore tuna to the mix and Wa La(!) - an excellent meal that is appreciated by all. Top with a slice of avocado and you have heaven on a plate. Without fail, recipe requests follow the first bite. It just works. In-joy.\nSee More  ",
        "likes": "1"
    },
    {
        "tweak_and_question_id": "tweak_379639_2",
        "food_id": "379639",
        "user_id": "7578910",
        "content": "Tabbouleh has always been something I wanted to make, and this recipe is the one I will use every time! I substituted Quinoa in place of the bulgur, using 1 1/2 cups of dry Quinoa to 3 cups of water and cooking it according to the directions on its package. This made the perfect amount of Quinoa to veggie ratio since I prefer a more balanced salad. Any less Quinoa and I think the parsley would have been too dominant. I used curly leaf parsley, which to me seemed to be just as flavorful as flat leaf but not as pungent. I chopped it very finely and took other's advice and measured 3/4 cup to 1 cup loosely packed. My \"1 bunch\" of green onions was 6 onions, and I used the whole onion-- both the green and the white. Where the recipe calls for 1 medium onion chopped, I only added 1/4 chopped to the salad, and it was a little too strong even with such a small amount. So I suggest using a mild or sweet onion or leaving it out altogether; I thought the green onions gave it great flavor on their own. I used fresh garden mint as well and only needed 1/4 cup or less after it was chopped. I used 16oz fresh cherry tomatoes quartered, and kept the olive oil and red wine vinegar as stated. Quinoa can be a little sticky so the oil really helped keep the texture of traditional tabbouleh. My only additions were 1 English cucumber finely chopped, which boosted the texture and flavor immensely, and about 2Tbls of balsamic vinegar to give the salad just a little bit of sweet without having to worry about granules of sugar showing up in the salad. I served this wonderful dish with hummus, pita bread, kalamata olives, and marinated Greek chicken kabobs (recipe was from a different website). Everyone loved it all!! Thank you for sharing this recipe blucoat!!\nSee More  ",
        "likes": "1"
    },
    {
        "tweak_and_question_id": "tweak_379639_3",
        "food_id": "379639",
        "user_id": "2332788",
        "content": "Yummy! I substituted cilantro for one half of the parsley, because that is what I had and used garlic instead of the cayenne....wow.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_364493_1",
        "food_id": "364493",
        "user_id": "1849027",
        "content": "Absolutely Perfect! Because of the main dish I was making, I used Beef broth instead of chicken broth. It cooked perfectly and looked beautiful and my family loved it!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_364493_2",
        "food_id": "364493",
        "user_id": "1099264",
        "content": "Really easy and really tasty. I used all chicken stock instead of water for extra flavor. Also great with mushrooms sauted with the onion and pepper.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_156662_1",
        "food_id": "156662",
        "user_id": "2002470084",
        "content": "Would you cook bone-in, skin on chicken thighs a little longer to thoroughly cook?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_183768_1",
        "food_id": "183768",
        "user_id": "452355",
        "content": "This was a flavorful, easy to make salad. We served as a side to Dolmathes. I had to use shallot in place of red onions, because I was out. We easily halved the recipe ingredients to make a smaller amount. Made for Sun and Spice 2013\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_183768_2",
        "food_id": "183768",
        "user_id": "80365",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_183768_3",
        "food_id": "183768",
        "user_id": "2096356",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_183768_4",
        "food_id": "183768",
        "user_id": "2002192572",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_183768_5",
        "food_id": "183768",
        "user_id": "717221",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_183768_6",
        "food_id": "183768",
        "user_id": "1380573",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_82509_1",
        "food_id": "82509",
        "user_id": "2002929101",
        "content": "keto friendly ?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_82509_2",
        "food_id": "82509",
        "user_id": "2002786745",
        "content": "Why do you put a potato that you shred into the recipe.? Is it to give it an added creaminess?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_82509_1",
        "food_id": "82509",
        "user_id": "445442",
        "content": "This was delicious! My fiance (the vegetarian) and I (the carnivore) loved it - it was earthy, substantial and flavourful! We made a few tiny adjustments - we used a handful of brown rice instead of the potato, and after the 10 hours of cooking, we added an extra 2 cups or so of broth, and almost double the lemon juice, as well as freshly cracked black pepper. We then cooked it on low for 15 minutes, then on high for another 20-30.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_182935_1",
        "food_id": "182935",
        "user_id": "54678",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_244722_1",
        "food_id": "244722",
        "user_id": "452355",
        "content": "We loved this recipe! 5 stars all the way! I substituted sea bass for the cod because that is what I had on hand. Also, I grilled the fish on the BBQ instead of cooking it on the stovetop. That is the beauty of this recipe--because the salsa goes on top of the fish after it is cooked, you really can prepare the fish any way you like. I highly recommend grilling it. The salsa had excellent flavor. This is definitely a recipe that I will be making again. Made for ZWT4.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_244722_2",
        "food_id": "244722",
        "user_id": "2002201927",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_244722_3",
        "food_id": "244722",
        "user_id": "2002201614",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_244722_4",
        "food_id": "244722",
        "user_id": "72421",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_244722_5",
        "food_id": "244722",
        "user_id": "2000216822",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_244722_6",
        "food_id": "244722",
        "user_id": "2000216822",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_220025_1",
        "food_id": "220025",
        "user_id": "21752",
        "content": "To echo Chef echo echo (LOL), loved this, loved this! I used craisins instead of the dried currants, and added a handful of chopped coriander. We served this up with pita and hummous and techina and it was a wonderful lunch on a hot summer's day.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_220025_2",
        "food_id": "220025",
        "user_id": "121690",
        "content": "Love this, love this! Chicken with tarragon is always a favorite of mine. I used yellow raisins instead of the currants. I do think that next time I might leave out the orzo--it was fine, but didn't really add anything much for me. That way it would be good stuffed into a pita, I think.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_131972_1",
        "food_id": "131972",
        "user_id": "2002470084",
        "content": "Since you're not using mayonnaise, could you use tuna packed in oil so it's hopefully not dry?\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_131972_1",
        "food_id": "131972",
        "user_id": "673444",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_323422_1",
        "food_id": "323422",
        "user_id": "2193767",
        "content": "I used the basic recipe as a springboard, and made these changes:<br/>1. Cooked corn from 3 cobs instead of using frozen<br/>2. Included roasted red pepper, marinated artichoke hearts, and sun dried tomatoes<br/>3. Instead of red wine vinegar, I used Pesto sauce. <br/><br/>The salad was a little green due to the Pesto, but the taste was awesome. Will definitely make this repeatedly.\nSee More  ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_323422_2",
        "food_id": "323422",
        "user_id": "13593",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_323422_3",
        "food_id": "323422",
        "user_id": "691407",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_323422_4",
        "food_id": "323422",
        "user_id": "216999",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_323422_5",
        "food_id": "323422",
        "user_id": "197023",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_323422_6",
        "food_id": "323422",
        "user_id": "89831",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_221237_1",
        "food_id": "221237",
        "user_id": "953275",
        "content": "This was a huge hit, and as it was so quick to make too that made it a hit all round. I made half the batch, exactly as written (ok, yellow pepper instead of red...), and I had a tin of mixed beans instead of just chickpeas. My daughter nearly finished off the entire batch. I imagine cutting the oil back would be equally good, but as is was nice and rich and I liked that the vinegar didn't overpower the dressing. Thanks Dreamer, I'm sure I'll make this again again and again.\nSee More  ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_221237_2",
        "food_id": "221237",
        "user_id": "13593",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_221237_3",
        "food_id": "221237",
        "user_id": "691407",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_221237_4",
        "food_id": "221237",
        "user_id": "216999",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_221237_5",
        "food_id": "221237",
        "user_id": "197023",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_221237_6",
        "food_id": "221237",
        "user_id": "89831",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_8892_1",
        "food_id": "8892",
        "user_id": "276108",
        "content": "SUPER! My husband and I both loved this. I did make a couple of minor changes, I used a large can of spinach instead of fresh and used cherry tomatoes (they are the only ones with flavor now) which I stirred into the spinach mixture just before removing from the heat. The dill gave it a hit of tartness similar to the splash of vinegar we normally add to spinach. Thanks so much for a new favorite!\nSee More  ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_8892_2",
        "food_id": "8892",
        "user_id": "184530",
        "content": "This was exceptionally tasty, and very easy to prepare. I used 600 grams of baby spinach leaves, dried dill, and everything else as listed. I cooked the onions for a few minutes, added the tomatoes and cooked them for a few minutes, then added the spinach to the same pan. I also used olive oil in place of the water. Will make again!\nSee More  ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_8892_3",
        "food_id": "8892",
        "user_id": "15892",
        "content": "I doubled the garlic and only had on hand about half the spinach. I, too, used olive oil, and would consider trying it with chicken broth instead of the water. I don't like dill, but I stuck to it and used my dried. I also added a breath of red pepper flakes just before step five, added a splash of lemon at the end of step 7 and I DIDN'T discard the liquid. Very tasty. I had it with some leftover swordfish that I flaked and stirred throughout. This would also be nice over rice or pasta, or with some canned garbanzo or white beans thrown in. The feta was the perfect touch. Would also be nice with fresh shredded parmesan, pine nuts or some cumin. What a nice base! Thanks, Mary! I can't wait to expand on this (or just keep it simple....)!\nSee More  ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_8892_4",
        "food_id": "8892",
        "user_id": "14613",
        "content": "this was pretty good. i prefer sauteing the spinach in oil and not water. good with goat cheese instead of feta.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_179813_1",
        "food_id": "179813",
        "user_id": "269829",
        "content": "I tried this recipe for a potluck and we loved it! (I tripled the recipe.) It is a very aromatic dish that scents the whole house. Mmm! The only changes made were: I snipped the sun-dried tomatoes into small bits and by the time I had added about 2/3 cup of them to the edamame it looked like more would overwhelm the salad, so I didn't triple the amount of sun-dried tomatoes, but sliced and added about a pound of fresh ripe cherry tomatoes, instead. I couldn't find feta cheese, so substituted goat cheese (I read that it's a healthier cheese, anyway, with less fat and less salt). For the dressing (step 2), I decided I would like my garlic pureed, so I mixed the dressing in the blender. I feel like I have too many vinegars already on hand, so used red wine vinegar instead of buying white. I couldn't find white balsamic vinegar, so substituted what I found, which was golden balsamic vinegar. I also had forgotten to buy fresh oregano, so substituted 1/3 as much dried oregano, and I used extra-virgin olive oil. I mixed the edamame, tomatoes, onions and olives, then added the dressing. I found I needed only half of the dressing, so have kept the rest of the dressing aside, in a container in the fridge. Next time I will reduce those ingredients by half. This helps make the recipe lower in fat, too. The cheese was added just before serving. On re-visiting the left-overs the day after, I have found that even if certain ingredients are left out, it still is terrific! My husband picks out the onion and I pick out the olives, but it's delicious even without those. Some of the salad was left without cheese because there were vegans at the potluck -- and it tastes delicious without the cheese, as well.\nSee More  ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_179813_2",
        "food_id": "179813",
        "user_id": "11176",
        "content": "Very tasty! I omitted the sun-dried tomatoes for our tastebuds, subbed white onions for red, regular balsamic for white and kalamata for black olives, but it turned out very nice and something I'll definitely make again. Thank you, Chef #338124!\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_179813_1",
        "food_id": "179813",
        "user_id": "2003107633",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_179813_3",
        "food_id": "179813",
        "user_id": "2002987398",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_179813_4",
        "food_id": "179813",
        "user_id": "937635",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_7968_1",
        "food_id": "7968",
        "user_id": "2001819219",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_7968_1",
        "food_id": "7968",
        "user_id": "2001506770",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_7968_2",
        "food_id": "7968",
        "user_id": "319738",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_7968_3",
        "food_id": "7968",
        "user_id": "133174",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_7968_4",
        "food_id": "7968",
        "user_id": "935354",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_7968_5",
        "food_id": "7968",
        "user_id": "790842",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_243354_1",
        "food_id": "243354",
        "user_id": "13593",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_243354_2",
        "food_id": "243354",
        "user_id": "691407",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_243354_3",
        "food_id": "243354",
        "user_id": "216999",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_243354_4",
        "food_id": "243354",
        "user_id": "197023",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_243354_5",
        "food_id": "243354",
        "user_id": "89831",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_84978_1",
        "food_id": "84978",
        "user_id": "168282",
        "content": "This is really, really good stuff. I mean really good! I didn't have the spice, so I used 1 tsp marjoram and thyme, 1 tbsp sesame. I also replaced the avocado with an english cucumber. Absolutely wonderful. Served with spinach pie.\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "question_214004_1",
        "food_id": "214004",
        "user_id": "2002417202",
        "content": "How long can this dip be made ahead of time??\n ",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_214004_1",
        "food_id": "214004",
        "user_id": "486725",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_214004_2",
        "food_id": "214004",
        "user_id": "464080",
        "content": "",
        "likes": "0"
    },
    {
        "tweak_and_question_id": "tweak_214004_3",
        "food_id": "214004",
        "user_id": "444132",
        "content": "",
        "likes": "0"
    }
]