[
    {
        "tweak_and_review_id": "review_293197_1",
        "food_id": "293197",
        "username": "LILPINKIEJ",
        "content": "This is good Falafel! I could not find dried fava beans, so I used well drained canned. The blend of spices were so good. I served with Recipe #59336 and some red onions sliced very thinly inside pita bread. I will make again. Made and Reviewed for ANZ Recipe Swap #25 - Thanks! :)\nSee More  ",
        "rating": 5.0,
        "likes": "2"
    },
    {
        "tweak_and_review_id": "review_293197_2",
        "food_id": "293197",
        "username": "JONATHAN MELENDEZ",
        "content": "I love falafel so much and this recipe makes them so easy to do at home. The key is to remember to soak the beans the night before! Followed the recipe exactly and it was great.\n ",
        "rating": 5.0,
        "likes": "1"
    },
    {
        "tweak_and_review_id": "review_293197_3",
        "food_id": "293197",
        "username": "MERSAYDEES",
        "content": "These are as good as any falafel I've eaten from American west to east coasts (i.e., San Francisco to NYC). I, too, couldn't find \"broad beans\", aka \"fava beans\", so I used all garbanzo beans, which is fairly traditional from my understanding. Great flavors! I served them in recipe #187699. Thanks, Che floWer! Made for PRMR.\nSee More  ",
        "rating": 5.0,
        "likes": "1"
    },
    {
        "tweak_and_review_id": "review_293197_4",
        "food_id": "293197",
        "username": "CUISTOT",
        "content": "No stars because I really didn't know what to expect from this recipe. I've never had Falafel before and just thought this would be a nice change of pace. It didn't go over as well as I'd hoped. We found them bland, which surprised me given the delectable spices that went into them, and dry. Now a friend of mine who has had Falafel in Israel liked them though she agreed they were a bit dry and suggested adding a small amount of extra virgin olive oil to the mix. I may try this again adding oil and doubling the spices, if I do I'll update my review.\nSee More  ",
        "rating": 0.0,
        "likes": "1"
    },
    {
        "tweak_and_review_id": "review_293197_5",
        "food_id": "293197",
        "username": "EMCQUAID",
        "content": "First time making (though long time eating!) falafel and this was surprisingly easy and really really good (I used all dried garbanzos though). They were crispy on the outside and super tender in the middle. They had really good flavor too even though I had no coriander nor cilantro. A couple things I'd do different next time, and recommend to others: 1) Careful not to chop/puree the chickpea mixture too much. I over-did it and they were a bit too runny. Stop when the mixture is still a bit course. 2) When deep-frying I found they did best at 350 degrees for 5 minutes (though I found another recipe telling me 375, I thought they came out too dark at that temp). 3) Sprinkle with course salt immediately after removing from the frier, the salt will stick better when they are still hot.\nSee More  ",
        "rating": 5.0,
        "likes": "0"
    },
    {
        "tweak_and_review_id": "tweak_293197_1",
        "food_id": "293197",
        "username": "JONATHAN MELENDEZ",
        "content": "I served them on top of some hummus with pita. So good!\n ",
        "likes": "0"
    },
    {
        "tweak_and_review_id": "tweak_293197_2",
        "food_id": "293197",
        "username": "JONATHAN MELENDEZ",
        "content": "I served them on top of some hummus with pita. So good!\n ",
        "likes": "0"
    }
]